{"id":1570,"date":"2023-07-20T08:39:26","date_gmt":"2023-07-20T08:39:26","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=1570"},"modified":"2023-07-26T12:30:58","modified_gmt":"2023-07-26T12:30:58","slug":"debt-recovery-law-in-india","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/","title":{"rendered":"Debt Recovery Law in India"},"content":{"rendered":"<h2><span data-preserver-spaces=\"true\">Debt Recovery: An Introduction <\/span><\/h2>\n<p>&#8216;Debt recovery&#8217; according to the Black Law Dictionary refers to legal procedures and approaches used to reclaim money loaned to someone else. In simpler terms, it involves legitimate methods to retrieve extended funds, with or without interest.<\/p>\n<p>Initially, India&#8217;s insolvency laws were limited to the Presidency Towns Insolvency Acts of 1909 (applicable to Kolkata, Chennai, and Mumbai) and the Provincial Insolvency Act of 1920 (covering the rest of India). These Acts primarily focused on individual insolvency and didn&#8217;t include corporations.<\/p>\n<p>Recognizing the need for comprehensive insolvency and bankruptcy laws, the legislature made several attempts to address debt recovery challenges. Critical legislations include the Securitization and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI), the Recovery of Debt Due to Banks and Financial Institutions Act, 1993 (DRT Act), and the Sick Industrial Companies Act, 1985. These laws aimed to provide a framework for resolving insolvency and debt recovery effectively.<\/p>\n<p><span data-preserver-spaces=\"true\">If you are facing any problem regarding debt recovery, please have a piece of proper<\/span><a href=\"https:\/\/legal251.com\/legal-claim-help\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\"> legal advice<\/span><\/a><span data-preserver-spaces=\"true\">.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2>Debt Recovery Laws in India: A Comprehensive Framework for Timely Repayment<\/h2>\n<p>In India, the issue of non-performing assets and debt recovery has been a significant concern for banks, financial institutions, and corporate debtors alike. To address this challenge, the country has established a robust legal framework for debt recovery, aiming to ensure the efficient and expeditious adjudication of debt recovery matters.<\/p>\n<p>When a borrower defaults on loan payments, banks and financial institutions initiate the debt recovery process. The first step typically involves sending a legal notice to the debtor, informing them of the outstanding debts and demanding repayment. Many loan agreements include an arbitration clause, allowing disputes to be resolved through alternative dispute resolution services rather than lengthy court proceedings.<\/p>\n<p>In cases of dishonest misappropriation or misappropriation of property, the banks or financial institutions can take legal action and file recovery proceedings against the defaulters. The legal process for recovery of loans involves approaching the appropriate legal forum, such as the Debt Recovery Tribunal (DRT) or the Debts Recovery Appellate Tribunal (DRAT), depending on the amount and nature of the debt.<\/p>\n<p>Secured creditors, who have collateral properties or immovable property as security, may have a faster recovery process compared to unsecured creditors, who lack such security. The Recovery of Debts Due to Banks and Financial Institutions Act, along with the Insolvency and Bankruptcy Code, provides a legal framework for the recovery of money from defaulters, including corporate debtors and individuals.<\/p>\n<p>The Debt Recovery Tribunals and Debt Recovery Appellate Tribunals play a crucial role in handling debt recovery matters. A financial creditor, such as a bank or financial institution, may initiate proceedings by submitting a recovery application to the relevant Debt Recovery Tribunal. The Tribunal then examines the case and can pass a judgment for debt recovery in favor of the creditor.<\/p>\n<p>&nbsp;<\/p>\n<h2><span data-preserver-spaces=\"true\">Methods of Debt Recovery in India<\/span><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-1573 size-full\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083500\/Methods-of-Debt-Recovery.jpg\" alt=\"Methods of Debt Recovery\" width=\"1080\" height=\"1080\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083500\/Methods-of-Debt-Recovery.jpg 1080w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083500\/Methods-of-Debt-Recovery-300x300.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083500\/Methods-of-Debt-Recovery-1024x1024.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083500\/Methods-of-Debt-Recovery-150x150.jpg 150w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083500\/Methods-of-Debt-Recovery-768x768.jpg 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/a><\/p>\n<p><span data-preserver-spaces=\"true\">Below, we will explore the various approaches available under Indian laws to initiate proceedings for debt recovery. These methods are commonly employed:<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Negotiated Settlement<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">Creditors can directly negotiate with the debtor to reach a settlement wherein the debtor agrees to repay the outstanding debt either in a lump sum or through installments.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Legal Notice<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">Creditors can send a legal notice to the debtor, demanding repayment of the debt within a specified period. The notice serves as a formal communication, putting the debtor on notice of the creditor&#8217;s intention to initiate legal proceedings if the debt remains unpaid.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Civil Suit<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">Creditors can file a civil suit in the appropriate court to recover the debt. This involves initiating a formal legal process, presenting evidence, and seeking a judgment from the court to enforce the repayment of the debt. In civil remedy, the aggrieved party can initiate a civil suit by sending a legal notice to the debtor. The notice serves as a formal communication demanding payment of debts due or seeking compensation for damages caused. If the debtor fails to comply with the notice, the aggrieved party can proceed with filing a civil lawsuit in the appropriate court. The court will then adjudicate the matter, considering the evidence and legal arguments presented by both parties and make a decision regarding debt recovery or compensation.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Summary Suit<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">For smaller debts not exceeding a certain threshold, creditors can opt for a summary suit under Order 37 of the Civil Procedure Code (CPC). This expedites the legal process by providing a shorter timeframe for the debtor to respond, and if the debtor fails to appear, the court can presume the creditor&#8217;s claims as valid and proceed with judgment.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Debt Recovery Tribunals (DRTs)<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">DRTs are specialized forums established under the Recovery of Debts Due to Banks and Financial Institutions Act, 1993. They handle cases related to the recovery of debts from borrowers and provide a quicker resolution compared to civil courts.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">SARFAESI Act<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">Securitization and Reconstruction of Financial Assets and Enforcement of Security Interest (SARFAESI) Act enables banks and financial institutions to take possession and sell the secured assets of defaulting borrowers without the intervention of a court, subject to certain conditions.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Was Insolvency and Bankruptcy Code (IBC)<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">In cases where the debtor is unable to repay the debt, creditors can initiate insolvency proceedings under the IBC. This allows for the resolution and recovery of debts through the corporate insolvency resolution process or liquidation, depending on the circumstances.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2><span data-preserver-spaces=\"true\">Purpose of debt recovery laws in India<\/span><\/h2>\n<p><span data-preserver-spaces=\"true\">The purpose of debt recovery laws in India extends beyond protecting consumers from unfair practices by debt collectors. These laws serve multiple objectives to ensure a fair and efficient debt recovery process. Here are some key purposes of debt recovery laws in India:<\/span><\/p>\n<h4>Balance the Interests of Creditors and Debtors<\/h4>\n<p>Debt recovery laws aim to strike a balance between the rights and interests of creditors, who are owed money, and debtors, who owe the debt. They provide a legal framework to facilitate the recovery of legitimate debts while ensuring that debtors are not subject to unjust or excessive practices.<\/p>\n<h4>Provide Legal Remedies for Creditors<\/h4>\n<p>These laws offer creditors legal remedies and mechanisms to recover their dues. Creditors can utilize the provisions within the legal framework to initiate appropriate legal actions and pursue debt recovery through authorized channels.<\/p>\n<h4>Facilitate a Fair and Transparent Process<\/h4>\n<p>Debt recovery laws establish clear procedures and guidelines for both creditors and debtors. They provide a structured and transparent process for initiating and pursuing debt recovery, ensuring that parties are aware of their rights and obligations. This helps prevent arbitrary or unfair actions from either party.<\/p>\n<h4>Establish Debt Recovery Tribunals and Appellate Tribunals<\/h4>\n<p>The establishment of Debt Recovery Tribunals (DRT) and Debts Recovery Appellate Tribunals (DRAT) under the Recovery of Debts due to the Bank and Financial Institutions (RDBFI) Act, 1993, and other relevant legislation, provides specialized forums for resolving debt recovery disputes. These tribunals play a crucial role in expediting the resolution of debt-related cases and offering a dedicated platform for adjudicating debt recovery matters.<\/p>\n<h4>Promote Speedy Resolution of Debt Disputes<\/h4>\n<p>Debt recovery laws emphasize the importance of timely resolution of debt disputes. They provide mechanisms for expediting the legal process, such as summary suits, where applicable, to facilitate swift judgments and enforcement actions.<\/p>\n<h4>Protect Consumers from Harassment and Unfair Practices<\/h4>\n<p>Debt recovery laws include provisions that safeguard consumers from harassment, intimidation, and unfair practices by debt collectors. These laws restrict abusive or unethical practices, ensuring that debt collectors adhere to prescribed codes of conduct and respect the rights and dignity of debtors.<\/p>\n<h4>Enable Efficient Insolvency and Bankruptcy Proceedings<\/h4>\n<p>With the introduction of the IBC, debt recovery laws have been further strengthened to address insolvency situations effectively. The IBC provides a comprehensive framework for the resolution of insolvency and bankruptcy cases. It focuses on the maximization of value for all stakeholders involved.<\/p>\n<p>While debt recovery laws offer certain protections to debtors, they do not absolve debtors of their responsibility to repay debts. Debtors are still expected to honor their financial obligations. The laws primarily ensure a fair and lawful process for debt recovery without shielding debtors from their liabilities.<\/p>\n<h2>What can you do if a debt collector is harassing you?<\/h2>\n<p><span data-preserver-spaces=\"true\">If you are facing harassment from a debt collector, you can take the following steps to address the situation effectively:<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Know your rights<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">Educate yourself about the legal framework governing debt collection in India. The Reserve Bank of India (RBI) has issued guidelines and regulations to safeguard consumers from unfair debt collection practices. Understanding your rights under these guidelines will enable you to recognize instances of harassment.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Maintain records<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">Keep thorough records of all interactions with the debt collector, including dates, times, names of individuals involved, and the content of conversations. This documentation will serve as valuable evidence if further action is required.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Correspond in writing<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">It is recommended to communicate with the debt collector in writing rather than through phone conversations. Draft a formal letter requesting that they immediately cease all forms of harassment and clearly state your preference to be contacted solely through written correspondence. Send this letter via registered post or courier to ensure proof of delivery.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Seek legal advice<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">If the harassment persists despite your written communication, seek legal advice from a specialized lawyer knowledgeable in debt collection laws in India. They can provide you with guidance on your rights and the available legal remedies.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">File a complaint<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">Complaint about the debt collector with the appropriate authority. If the harassment is linked to a bank or financial institution, you can file a complaint with the banking ombudsman. Alternatively, you may approach consumer forums or the National Company Law Tribunal (NCLT) for resolution in specific cases.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Report to the RBI<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">If the debt collector is a registered entity, report the harassment to the Reserve Bank of India (RBI). The RBI maintains a dedicated grievance redressal mechanism where you can file a complaint against the debt collector.<\/span><\/p>\n<h2><span data-preserver-spaces=\"true\">What is the time limit for the recovery of debts in India?<\/span><\/h2>\n<p><span data-preserver-spaces=\"true\">In India, the time limit for the recovery of debts depends on various factors. It is subjected to the laws governing debt recovery. Here are some key aspects to consider:<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Limitation Period<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">The limitation period refers to the time within which a legal action can be initiated to recover a debt. The Limitation Act, of 1963, sets out the general limitation periods for different types of debts. The limitation period for debt recovery in India is typically three years from the date the cause of action arises. <\/span><span data-preserver-spaces=\"true\">However, it&#8217;s important to note that different types of debts may have different limitation periods. So it&#8217;s advisable to consult the specific laws applicable to your situation.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Negotiable Instruments<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">In cases involving negotiable instruments such as cheques, the Negotiable Instruments Act, of 1881, provides a specific limitation period. Generally, a complaint for the dishonor of a cheque must be filed within 30 days from the date of receipt of the dishonored cheque notice.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Recovery of Debts Due to Banks and Financial Institutions<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">The Recovery of Debts Due to Banks and Financial Institutions Act, 1993, governs the recovery of debts by financial institutions. Under this act, a creditor can apply to DRT within three years from the date the debt became due.<\/span><\/p>\n<h3><span data-preserver-spaces=\"true\">Insolvency and Bankruptcy Code<\/span><\/h3>\n<p><span data-preserver-spaces=\"true\">If the debtor is unable to repay the debt, creditors can initiate insolvency proceedings under IBC. The IBC provides a time-bound process for the resolution or liquidation of debtors, aiming to ensure timely debt recovery.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2><span data-preserver-spaces=\"true\">A Brief on Debt Recovery Tribunals<\/span><\/h2>\n<p><span data-preserver-spaces=\"true\">Debts Recovery Tribunal (DRT) is an important institution established by the Central Government to handle matters related to debt recovery. It has several key features that ensure its effective functioning and jurisdiction.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">Central Government establishes DRT to entertain appeals against orders made by the Adjudicating Authority under the Insolvency and Bankruptcy Code. These Appellate Tribunals of DRT, are responsible for exercising jurisdiction, powers, and authority conferred upon them by the relevant legislation.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">The composition of a Tribunal consists of a single person, referred to as the Presiding Officer. The Presiding Officer is appointed by the Central Government. To be eligible for this position, a person must either be a District Judge or possess the qualifications of one.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">The term of office for the Presiding Officer is five years, with the possibility of reappointment. This ensures a level of stability and continuity in the functioning of the Tribunal.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">The Tribunal is supported by a staff provided by the Central Government. It includes Recovery Officers and other officers and employees deemed necessary. These individuals work under the general superintendence of the Presiding Officer. T<\/span><span data-preserver-spaces=\"true\">he Presiding Officer or Chairperson of an Appellate Tribunal can be removed by an order made by the Central Government. Following an inquiry that establishes proven misbehavior or incapacity.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">The primary jurisdiction of the DRT is to decide applications from banks and financial institutions for the recovery of debts. This empowers the Tribunal to address issues related to debt recovery. It also ensures that banks and financial institutions have a legal recourse to recover their dues.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2><span data-preserver-spaces=\"true\">Conclusion <\/span><\/h2>\n<p><span data-preserver-spaces=\"true\">In conclusion, the debt recovery law in India plays a crucial role in addressing and resolving issues related to unpaid debts and financial obligations. The legal framework provides individuals and institutions with effective mechanisms to recover their dues and seek redress for damages caused by defaulting debtors.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">The availability of civil remedies empowers creditors to initiate legal proceedings through the issuance of a legal notice and filing a civil suit. This allows them to present their case before a court, present evidence, and seek a favourable judgment for the recovery of debts owed or compensation for damages. Civil remedies provide a structured and formal process for debt recovery, ensuring fairness and adherence to legal principles.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">In cases of serious offences or deliberate fraud, the criminal remedy offers a powerful recourse. By filing an FIR with the local police station, aggrieved parties can initiate a criminal investigation and pursue legal action against the debtor. This serves as a deterrent and holds accountable those who engage in fraudulent activities or intentional non-payment of debts.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">To further strengthen debt recovery mechanisms, continuous efforts are being made to improve the legal infrastructure, streamline legal procedures, and enhance the efficiency of debt recovery tribunals and appellate bodies. The government, judiciary, and financial institutions work collaboratively to ensure the effective implementation of debt recovery laws.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">In summary, the debt recovery law in India serves as a vital tool for resolving debt-related issues and upholding the principles of justice and fairness. It provides individuals and institutions with legal remedies and avenues to seek redress, ultimately contributing to the stability and credibility of the financial ecosystem in the country.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">For online <\/span><a href=\"https:\/\/legal251.com\/legal-claim-help\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\">legal advice<\/span><\/a><span data-preserver-spaces=\"true\">, don&#8217;t hesitate to get in touch with Legal251 at toll-free no.- (+91) 77728-77729 or download the Legal251 mobile app now.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Debt Recovery: An Introduction &#8216;Debt recovery&#8217; according to the Black Law Dictionary refers to legal procedures and approaches used to reclaim money loaned to someone else. In simpler terms, it involves legitimate methods to retrieve extended funds, with or without interest. Initially, India&#8217;s insolvency laws were limited to the Presidency Towns Insolvency Acts of 1909 [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":1572,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Debt Recovery Law in India<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Debt Recovery Law in India\" \/>\n<meta property=\"og:description\" content=\"Debt Recovery: An Introduction &#8216;Debt recovery&#8217; according to the Black Law Dictionary refers to legal procedures and approaches used to reclaim money loaned to someone else. In simpler terms, it involves legitimate methods to retrieve extended funds, with or without interest. Initially, India&#8217;s insolvency laws were limited to the Presidency Towns Insolvency Acts of 1909 [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-20T08:39:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-26T12:30:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083018\/Debt-Recovery-Law-in-India.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Meghna Singh\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Meghna Singh\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\"},\"author\":{\"name\":\"Meghna Singh\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/75ba95f957f65f1b7cd831f19f7b3aaa\"},\"headline\":\"Debt Recovery Law in India\",\"datePublished\":\"2023-07-20T08:39:26+00:00\",\"dateModified\":\"2023-07-26T12:30:58+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\"},\"wordCount\":2466,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\",\"url\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\",\"name\":\"Debt Recovery Law in India\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-07-20T08:39:26+00:00\",\"dateModified\":\"2023-07-26T12:30:58+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Debt Recovery Law in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/75ba95f957f65f1b7cd831f19f7b3aaa\",\"name\":\"Meghna Singh\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9f63b06fbed7260a86e88e1819db16f4?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9f63b06fbed7260a86e88e1819db16f4?s=96&d=mm&r=g\",\"caption\":\"Meghna Singh\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/meghna\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Debt Recovery Law in India","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Debt Recovery Law in India","og_description":"Debt Recovery: An Introduction &#8216;Debt recovery&#8217; according to the Black Law Dictionary refers to legal procedures and approaches used to reclaim money loaned to someone else. In simpler terms, it involves legitimate methods to retrieve extended funds, with or without interest. Initially, India&#8217;s insolvency laws were limited to the Presidency Towns Insolvency Acts of 1909 [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-07-20T08:39:26+00:00","article_modified_time":"2023-07-26T12:30:58+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20083018\/Debt-Recovery-Law-in-India.jpg","type":"image\/jpeg"}],"author":"Meghna Singh","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Meghna Singh","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/"},"author":{"name":"Meghna Singh","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/75ba95f957f65f1b7cd831f19f7b3aaa"},"headline":"Debt Recovery Law in India","datePublished":"2023-07-20T08:39:26+00:00","dateModified":"2023-07-26T12:30:58+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/"},"wordCount":2466,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/","url":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/","name":"Debt Recovery Law in India","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-07-20T08:39:26+00:00","dateModified":"2023-07-26T12:30:58+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/debt-recovery-law-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Debt Recovery Law in India"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/75ba95f957f65f1b7cd831f19f7b3aaa","name":"Meghna Singh","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9f63b06fbed7260a86e88e1819db16f4?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9f63b06fbed7260a86e88e1819db16f4?s=96&d=mm&r=g","caption":"Meghna Singh"},"url":"https:\/\/legal251.com\/resources\/author\/meghna\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1570"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=1570"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1570\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/1572"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=1570"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=1570"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=1570"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}