{"id":1592,"date":"2023-07-20T11:17:56","date_gmt":"2023-07-20T11:17:56","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=1592"},"modified":"2023-07-22T10:54:31","modified_gmt":"2023-07-22T10:54:31","slug":"the-protection-provided-by-law-against-cruelty-in-marriage","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/","title":{"rendered":"The Protection Provided by Law Against Cruelty in Marriage"},"content":{"rendered":"<h2><span data-preserver-spaces=\"true\">Introduction<\/span><\/h2>\n<h4><span data-preserver-spaces=\"true\">Section 498A: Penalizing Marital Cruelty and Protecting Women&#8217;s Rights in India<\/span><\/h4>\n<p>In India, the issue of women experiencing abuse from their husbands or in-laws continues to be a pressing concern. The incidence of such cases is on the rise. Acknowledging the gravity of this problem and bringing perpetrators to justice, Chapter XXA was incorporated. This chapter introduced Section 498A, titled &#8220;Cruelty By Husband or Relatives of Husband.&#8221; With the primary objective of penalizing those husbands and their family members who inflict cruelty and harassment upon wives.<\/p>\n<p>Section 498A specifically targets acts of torture or cruelty aimed at coercing the wife or her relatives into fulfilling illegal demands or driving her towards suicidal tendencies. This amendment seeks to ensure that those responsible for subjecting women to such abusive behavior are held accountable for their actions and face appropriate legal consequences. By imposing penalties for such offenses, the law aims to provide a safeguard for women against domestic violence and offer them a recourse to seek justice in situations of marital abuse.<\/p>\n<h4>Defining Cruelty under Section 498A: A Legal Recourse for Victims of Domestic Abuse<\/h4>\n<p><span data-preserver-spaces=\"true\">Section 498A defines cruelty as any willful conduct that is likely to drive a woman to commit suicide or cause grave injury to her physical or mental health. It also includes harassment with the intention of coercing her or her relatives to meet unlawful demands. This provision recognizes the vulnerability of women in marital relationships and seeks to provide them with legal recourse. <\/span><span data-preserver-spaces=\"true\">If a woman faces cruelty from her husband or in-laws, she can file a complaint with the police, who will initiate an investigation. If the allegations are found to be true, the offenders can be punished with imprisonment for a term of up to three years and\/or a fine. The law aims to deter and punish those who subject their spouses to cruelty or harassment.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Balancing the Focus: Section 498A and Protection of Women from Domestic Violence Act<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">It&#8217;s important to note that the law recognizes that both men and women can be victims of domestic cruelty. However, Section 498A specifically addresses cruelty against married women due to the historical prevalence of such cases. Additionally, there are other legal provisions in India that aim to protect individuals in abusive marriages, such as the Protection of Women from Domestic Violence Act (PWDVA) of 2005. This act provides broader protection by defining various forms of abuse, including physical, emotional, sexual, and economic, and enables victims to seek protection orders, residence orders, and other reliefs.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">it is advisable to contact a consultant and have a piece of proper <\/span><a href=\"https:\/\/legal251.com\/legal-claim-help\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\">legal advice<\/span><\/a><span data-preserver-spaces=\"true\"> if you are facing any sort of physical cruelty or mental cruelty. Physical violence is not acceptable, if you are facing some or know anyone facing, let your nearest police station know. <\/span><\/p>\n<h2><span data-preserver-spaces=\"true\">Provision under the Indian Penal Code, 1860<\/span><\/h2>\n<h4><strong><span data-preserver-spaces=\"true\">Indian Penal Code, 1860<\/span><\/strong><\/h4>\n<p><span data-preserver-spaces=\"true\">Chapter: XXA- “Of Cruelty by Husband or Relatives of Husband”<\/span><\/p>\n<p><em><span data-preserver-spaces=\"true\">“Section 498A. Husband or relative of husband of a woman subjecting her to cruelty. &#8211; Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine.<\/span><\/em><\/p>\n<p><em><span data-preserver-spaces=\"true\">Explanation.- For the purpose of this section, “cruelty” means-<\/span><\/em><\/p>\n<ul>\n<li><em><span data-preserver-spaces=\"true\">any wilful conduct which is of such a nature as is likely to drive the women to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or<\/span><\/em><\/li>\n<li><em><span data-preserver-spaces=\"true\">harassment of the women where such harassment is with a view to coercing her or any person related to her to meet any unlawful demand for any property or valuable security or is on account of failure by her or any person related to her to meet such demand” <\/span><\/em><\/li>\n<\/ul>\n<p><span data-preserver-spaces=\"true\">Section 498-A of the Indian Penal Code (IPC) classifies the offence as cognizable. Which means that a police officer can arrest the accused without an arrest warrant, If they receive information about the commission of the offence. The information can be provided by the person who has suffered from the offence, or by any person related to them. In the absence of such relatives, a public servant belonging to a specified class or category notified by the State Government can also provide the information. Additionally, Section 498-A is categorised as a non-bailable offence.<\/span><\/p>\n<h4>Arun Vyas v. Anita Vyas<\/h4>\n<p>The offence described in section 498-A is cruelty. It is important to note that this is a continuing offence. As stated in Arun Vyas v. Anita Vyas (1999) 4 SCC 690, each incident in which the woman is subjected to cruelty can serve as a new starting point for the statute of limitations. This means that if there are multiple incidents of cruelty, the statute of limitations can be calculated from each incident. Although the court has the discretion to extend this period if it deems it necessary given the nature of the crime and the circumstances of the case, the general time limit for filing an action under Section 498-A is three years.<\/p>\n<h2><span data-preserver-spaces=\"true\">Findings of Apex Court on Section 498A, IPC<\/span><\/h2>\n<p><span data-preserver-spaces=\"true\">In the case of <\/span><em><span data-preserver-spaces=\"true\">Arnesh Kumar v. State of Bihar (2014) 8 SCC 273<\/span><\/em><span data-preserver-spaces=\"true\">, the Supreme Court issued directions to prevent unnecessary arrests by police officers and casual authorizations of detention by magistrates in cases under Section 498-A of the IPC. These directions, which also apply to cases where the offence is punishable with imprisonment of not more than seven years, include the following:<\/span><\/p>\n<ol>\n<li><span data-preserver-spaces=\"true\">Police officers should not automatically arrest the accused when a case under Section 498-A is registered.<\/span>  They must assess the necessity of arrest based on the parameters outlined in Section 41 of the Code of Criminal Procedure (CrPC).<\/li>\n<li><span data-preserver-spaces=\"true\">It is important to ensure that police officers adhere to the guidelines outlined in Section 41(1)(b)(ii) of the CrPC, which necessitates the completion of a checklist and the provision of justifications and supporting evidence for arrests.<\/span><\/li>\n<li><span data-preserver-spaces=\"true\">To ensure proper legal procedure, magistrates should record their satisfaction and authorize detention only after carefully reviewing the report submitted by police officers.<\/span><\/li>\n<li><span data-preserver-spaces=\"true\">Non-compliance with these instructions by police officers may lead to departmental consequences and potential charges of contempt of court.<\/span><\/li>\n<li><span data-preserver-spaces=\"true\">Failure by the judicial magistrate to comply with these directions can lead to departmental action by the respective High Court.<\/span><\/li>\n<\/ol>\n<h4><span data-preserver-spaces=\"true\">Case laws <\/span><\/h4>\n<p>In the case of Rajesh Sharma v. State of U.P., 2017 SCC OnLine SC 821, the Supreme Court also directed to prevent the misuse of Section 498-A of the IPC.<\/p>\n<p>The court further modified these directions in the case of the Social Action Forum for Manav Adhikar v. Union of India, 2018 SCC OnLine SC 1501. The additional directions include:<\/p>\n<ol>\n<li>Designated Investigating Officers from the respective area should handle complaints under Section 498-A and related offenses to ensure thorough investigations.<\/li>\n<li>If the parties involved in a dispute reach a settlement, they can approach the High Court under Section 482 of the CrPC (Criminal Procedure Code) to request the quashing of proceedings or seek any other appropriate order.<\/li>\n<li>Bail applications that provide at least one day&#8217;s notice to the Public Prosecutor or complainant should be promptly decided to facilitate a fair and efficient process. Denying bail solely on the grounds of disputed dowry items should be avoided if the rights of the wife or minor children can be safeguarded, particularly in terms of maintenance or other relevant concerns.<\/li>\n<li>Impounding passports or issuing Red Corner Notices for individuals residing outside India should not be done routinely.<\/li>\n<li>These directions are not applicable in cases that involve tangible physical injuries or death.<\/li>\n<\/ol>\n<p>The aim of these directions is to strike a balance between protecting the rights of the accused and ensuring justice for victims while preventing the misuse of Section 498-A of the IPC.<\/p>\n<h2><span data-preserver-spaces=\"true\">Other legal provisions that govern instances of cruelty in marriage<\/span><\/h2>\n<p><span data-preserver-spaces=\"true\">In addition to Section 498A, the legal framework addressing cruelty in marriage encompasses other provisions as well. Section 304-B of the Indian Penal Code (IPC) addresses cases where a woman&#8217;s death occurs within seven years of her marriage, and it is determined that she was subjected to cruelty by her husband or his relatives for dowry demands. Such deaths are classified as &#8220;dowry deaths.&#8221;<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">Section 304-B stipulates that the punishment for this offence includes imprisonment for a minimum of seven years, which may extend up to life imprisonment. The provision recognizes the seriousness of dowry-related cruelty, which can result in the tragic loss of a woman&#8217;s life.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">It is important to note that Section 304-B specifically focuses on cases where the death of a woman is caused by burns or bodily injuries, and it is linked to cruelty inflicted for dowry demands. This provision serves as a deterrent and seeks to ensure that those responsible for dowry-related cruelty leading to a woman&#8217;s death are held accountable.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">Section 304-B does not categorize deaths caused by burns as exclusively homicidal, suicidal, or accidental. This is because a death resulting from burns can be attributed to any of these causes. However, the provision establishes a legal requirement for the court to presume that the accused committed a dowry death when the prosecution proves the following:<\/span><\/p>\n<ol>\n<li><span data-preserver-spaces=\"true\">The death of the wife occurred within seven years of her marriage.<\/span><\/li>\n<li><span data-preserver-spaces=\"true\">The wife was a victim of cruelty related to dowry demands shortly before her death.<\/span><\/li>\n<\/ol>\n<p><span data-preserver-spaces=\"true\">When a demand for property or valuable security is connected directly or indirectly to the marriage, it constitutes a demand for dowry. The determination of whether a demand is connected to dowry or not must be made based on the factual context of each case.<\/span><\/p>\n<h2>Ensuring Safety: The Act of 2005 &#8211; Protecting Women from Domestic Violence<\/h2>\n<p><span data-preserver-spaces=\"true\">The Domestic Violence Act of 2005 was enacted to provide effective protection for women who experience violence within their families.<\/span> This legislation grants women the right to secure housing and the right to reside in their matrimonial home. It empowers magistrates to issue protection orders to address domestic violence crimes. The act also includes provisions for the appointment of Protection Officers, who play a crucial role in assisting victims by facilitating access to medical examinations, legal aid services, safe shelter, and other essential legal remedies.<\/p>\n<h4>Rupali Devi v. State of Uttar Pradesh and Others<\/h4>\n<p><span data-preserver-spaces=\"true\">In the case of <\/span><em><span data-preserver-spaces=\"true\">Rupali Devi v. State of Uttar Pradesh and Others (2019) 5 SCC 384; (2019) 2 SCC (Cri) 558; 2019 SCC OnLine SC 493<\/span><\/em><span data-preserver-spaces=\"true\">, the Supreme Court defined &#8220;cruelty&#8221; in relation to Section 498-A of the Penal Code. It held that cruelty includes intentional and malicious infliction of mental or physical suffering upon a woman. This definition encompasses both the physical and mental aspects of cruelty. The impact on the wife&#8217;s mental health and the psychological distress or trauma caused by being forced out of the matrimonial home are factors to consider when understanding the concept of &#8220;cruelty&#8221; in Section 498-A.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">This highlights the comprehensive nature of the Domestic Violence Act and emphasizes the importance of addressing the mental well-being of victims alongside physical abuse. The legislation aims to provide necessary support and legal remedies to women who are victims of domestic violence.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Domestic Violence Act, 2005 <\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">Domestic Violence Act, 2005 provides for a remedy under civil law which is intended to protect women from being victims of domestic violence occurring within the family and to prevent the occurrence of domestic violence in society. It makes provision for a protection order under Section 18, a residence order under Section 19, monetary relief under Section 20, a custody order under Section 21, compensation under Section 22 and interim relief under Section 23.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">This law encompasses sexual abuse, which refers to any form of sexually oriented behavior that inflicts harm, humiliation, degradation, or violates the dignity of women.<\/span><\/p>\n<p>This legislation is frequently employed to protect women from experiencing sexual harassment within their homes or domestic environments due to its inclusion of sexual abuse.<\/p>\n<h2><span data-preserver-spaces=\"true\">Ground for divorce <\/span><\/h2>\n<p>In India, cruelty in marriage can constitute a valid ground for divorce. The Hindu Marriage Act, which applies to Hindus, allows divorce on the grounds of cruelty. Cruelty can be physical or mental and refers to the behavior of one spouse that causes suffering and distress or makes it intolerable for the other spouse to continue living with him or her. The courts in India have recognized that cruelty can take various forms, including emotional abuse, verbal abuse, harassment, or any other behavior that undermines the well-being and dignity of a spouse. A spouse may be granted a divorce on the ground of cruelty if they can prove that they have been subjected to it. It is important to note that divorce laws may be different for different religions and communities in India.<\/p>\n<p><span data-preserver-spaces=\"true\">if you need any sort of help drafting your divorce petition, contact<\/span><a href=\"https:\/\/legal251.com\/\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\"> Legal251<\/span><\/a><span data-preserver-spaces=\"true\">.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2><span data-preserver-spaces=\"true\">Conclusion<\/span><\/h2>\n<h4><span data-preserver-spaces=\"true\">Section 498-A: Protecting Individuals Against Cruelty in Marriage in India<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">The protection provided by law against cruelty in marriage in India is a significant step towards ensuring the well-being and dignity of individuals within matrimonial relationships. India recognizes the importance of safeguarding the rights of married individuals and has implemented several legal provisions to address and prevent acts of cruelty within marriages. <\/span><span data-preserver-spaces=\"true\">One of the key provisions is Section 498-A of the Indian Penal Code, which specifically deals with cruelty by husbands or their relatives towards married women. This provision acts as a deterrent against domestic violence and provides victims with a legal recourse to seek justice. It encompasses a wide range of acts, both physical and mental, that cause harm or endanger the life and well-being of the victim.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Comprehensive Protection: The Role of Laws and Provisions in Addressing Domestic Violence<\/span><\/h4>\n<p><span data-preserver-spaces=\"true\">In addition to Section 498-A, there are other relevant laws and provisions that contribute to the protection against cruelty in marriage. The Protection of Women from Domestic Violence Act, 2005 is a significant legislation that recognizes the rights of women in domestic relationships and aims to provide them with effective protection from various forms of abuse and violence. <\/span><span data-preserver-spaces=\"true\">The judiciary also plays a crucial role in upholding the rights of individuals facing cruelty in marriage. The courts have ensured the protection of victims and held perpetrators accountable by interpreting and applying these laws. They have emphasized the importance of acting promptly in domestic violence cases and have taken a proactive approach to protecting victims&#8217; interests.<\/span><\/p>\n<h4><span data-preserver-spaces=\"true\">Empowering Victims: Government and NGOs&#8217; Efforts Towards Legal Literacy and Support Services<\/span><\/h4>\n<p>The government and various nongovernmental organizations (NGOs) are actively helping to raise awareness, provide support services, and promote legal literacy among the population. These efforts empower victims by educating them about their rights and available remedies. While India has a comprehensive and robust legal framework, there is a need for continued efforts to improve implementation, strengthen support systems, and foster a culture of zero tolerance for cruelty in marriages. Collectively, society must recognize the importance of respecting the rights and dignity of individuals in marital relationships.<\/p>\n<p>In summary, legal protection against cruelty in marriage in India represents a significant step toward protecting the welfare and rights of individuals. Thanks to legal provisions, the appointment of protection officers, an active judiciary, and ongoing efforts by the government and nongovernmental organisations, victims of marital cruelty have access to the protection, support, and remedies they need. However, it is the collective responsibility to ensure effective implementation, awareness, and societal change toward promoting healthy and respectful relationships in marriages.<\/p>\n<p><span data-preserver-spaces=\"true\">It is advisable to contact a consultant and have a piece of proper <\/span><a href=\"https:\/\/legal251.com\/legal-claim-help\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\">legal advice<\/span><\/a><span data-preserver-spaces=\"true\"> if you are facing any sort of cruelty.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction Section 498A: Penalizing Marital Cruelty and Protecting Women&#8217;s Rights in India In India, the issue of women experiencing abuse from their husbands or in-laws continues to be a pressing concern. The incidence of such cases is on the rise. Acknowledging the gravity of this problem and bringing perpetrators to justice, Chapter XXA was incorporated. [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":1589,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Protection Provided by Law Against Cruelty in Marriage<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Protection Provided by Law Against Cruelty in Marriage\" \/>\n<meta property=\"og:description\" content=\"Introduction Section 498A: Penalizing Marital Cruelty and Protecting Women&#8217;s Rights in India In India, the issue of women experiencing abuse from their husbands or in-laws continues to be a pressing concern. The incidence of such cases is on the rise. Acknowledging the gravity of this problem and bringing perpetrators to justice, Chapter XXA was incorporated. [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-20T11:17:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-22T10:54:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20111120\/The-Protection-Provided-by-Law-Against-Cruelty-in-Marriage.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"The Protection Provided by Law Against Cruelty in Marriage\",\"datePublished\":\"2023-07-20T11:17:56+00:00\",\"dateModified\":\"2023-07-22T10:54:31+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\"},\"wordCount\":2578,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\",\"url\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\",\"name\":\"The Protection Provided by Law Against Cruelty in Marriage\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-07-20T11:17:56+00:00\",\"dateModified\":\"2023-07-22T10:54:31+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Protection Provided by Law Against Cruelty in Marriage\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Protection Provided by Law Against Cruelty in Marriage","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/","og_locale":"en_US","og_type":"article","og_title":"The Protection Provided by Law Against Cruelty in Marriage","og_description":"Introduction Section 498A: Penalizing Marital Cruelty and Protecting Women&#8217;s Rights in India In India, the issue of women experiencing abuse from their husbands or in-laws continues to be a pressing concern. The incidence of such cases is on the rise. Acknowledging the gravity of this problem and bringing perpetrators to justice, Chapter XXA was incorporated. [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-07-20T11:17:56+00:00","article_modified_time":"2023-07-22T10:54:31+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20111120\/The-Protection-Provided-by-Law-Against-Cruelty-in-Marriage.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"The Protection Provided by Law Against Cruelty in Marriage","datePublished":"2023-07-20T11:17:56+00:00","dateModified":"2023-07-22T10:54:31+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/"},"wordCount":2578,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/","url":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/","name":"The Protection Provided by Law Against Cruelty in Marriage","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-07-20T11:17:56+00:00","dateModified":"2023-07-22T10:54:31+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/the-protection-provided-by-law-against-cruelty-in-marriage\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"The Protection Provided by Law Against Cruelty in Marriage"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1592"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=1592"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1592\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/1589"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=1592"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=1592"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=1592"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}