{"id":1603,"date":"2023-07-20T13:14:24","date_gmt":"2023-07-20T13:14:24","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=1603"},"modified":"2023-07-28T13:47:20","modified_gmt":"2023-07-28T13:47:20","slug":"limited-liability-partnership-llp-the-basics","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/","title":{"rendered":"Limited Liability Partnership (LLP) &#8211; The Basics"},"content":{"rendered":"<h2><strong>Introduction <\/strong><\/h2>\n<h4>Limited Liability Partnership (LLP): Combining Advantages of Partnerships and Limited Liability<\/h4>\n<p>A Limited Liability Partnership is an entity that combines the benefits of a traditional partnership and a limited liability company. It provides individual partners with the advantages of limited liability, perpetual succession, and protection of personal assets. LLPs have become popular business structures, offering an alternative to unlimited liability partnerships and limited liability companies. The foundation of an LLP is a partnership agreement, which outlines the rights, duties, and liabilities of the partners. Unlike a traditional partnership firm, an LLP creates a separate entity, distinct from its partners. This separation ensures that the personal liability of partners is limited, shielding personal assets from the business&#8217;s debts.<\/p>\n<h4>Separation of Entity and Limited Personal Liability<\/h4>\n<ul>\n<li>An LLP exhibits similarities with both a limited company and a partnership firm. It combines the flexibility and tax advantages of a partnership with the separate legal identity and compliance requirements of a private or public company.<\/li>\n<li>LLPs must have a registered office, maintain LLP agreements, and file annual returns to ensure compliance with the provisions of the Limited Liability Partnership Act.<\/li>\n<li>The LLP agreement defines the internal governance structure of an LLP, specifying the roles and responsibilities of partners, including the designated partner(s). The agreement also covers details of the partners, such as their addresses, contributions, and profit-sharing ratios.<\/li>\n<li>An individual, a silent partner, or even a sole partner can be a partner in an LLP.<\/li>\n<\/ul>\n<h4>Managing LLPs as Hybrid Business Structures<\/h4>\n<p>Compared to other corporate business forms, LLPs offer a great deal of flexibility in terms of management structure, tax codes, and legal consequences. LLPs are particularly suitable for professional services, such as law firms or regular firms that desire the benefits of limited liability while maintaining the day-to-day operations of a partnership.<\/p>\n<p>One of the key differences between LLPs and regular partnership firms is the limited liability aspect. In a traditional partnership, partners have joint liability, meaning they are personally liable for the partnership&#8217;s debts. In an LLP, partners have limited liability, which protects their personal assets and restricts their legal liability to the extent of their agreed contributions. Limited Liability Partnerships have emerged as a popular choice due to their efficient governance structure, simplified compliance measures, and flexibility in operations. They provide an attractive alternative for partnerships seeking to protect the liabilities of partners and maintain a separate legal entity.<\/p>\n<p>LLPs offer distinct advantages by combining the benefits of a partnership and limited liability. They provide a flexible and straightforward process for business registration, compliance with business laws, and protection of personal assets. LLPs have become a preferred choice for many businesses seeking the advantages of limited liability without the complexities of a traditional corporation.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Limited Liability Partnership (LLP)- Concept<\/strong><\/h2>\n<ul>\n<li>The Limited Liability Partnership Act, 2008, introduced the business structure of Limited Liability Partnership (LLP) in India, which came into effect on April 1, 2009.<\/li>\n<li>This act, along with the specified rules and regulations, governs LLPs. In an LLP, partners enjoy limited liability, protecting their personal assets from the LLP&#8217;s liabilities, unlike traditional partnerships with unlimited liability. LLPs also offer the advantage of partnership flexibility, allowing partners to directly manage the business.<\/li>\n<li>Professionals, such as lawyers, accountants, and consultants, commonly prefer LLPs for their flexibility, limited liability, and ease of management. Additionally, LLPs serve as an alternative to traditional partnership structures and are suitable for small and medium-sized enterprises (SMEs) as well.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2><strong>Nature of Limited Liability Partnership<\/strong><\/h2>\n<ul>\n<li>An LLP is a distinct legal entity from its partners, capable of owning property, entering contracts, and suing and being sued in its own name. This separation ensures that the liabilities of the LLP are distinct from the personal liabilities of its partners.<\/li>\n<li>The key advantage of an LLP is limited liability. Each partner&#8217;s liability is limited to their agreed contribution to the LLP, except in cases of fraud or wrongful acts committed by the partner. This protects the personal assets of individual partners in the event of financial losses or legal liabilities incurred by the LLP.<\/li>\n<li>An LLP enjoys perpetual succession, meaning its existence is not contingent on the status of its partners. The LLP continues to exist even in the face of partner changes, such as death, retirement, or exit, until it is dissolved as per the provisions of the LLP Act.<\/li>\n<li>LLPs offer greater management flexibility compared to companies. Partners typically have the right to directly manage the business without the necessity of appointing a board of directors. However, designated partners are responsible for ensuring compliance with statutory requirements.<\/li>\n<li>An LLP must have a minimum of two partners, and there is no restriction on the maximum number of partners. This allows both small and large partnerships to function under the LLP structure.<\/li>\n<li>LLPs are generally taxed as partnerships, where the LLP itself is not taxed. Instead, partners are individually taxed on their share of profits, avoiding double taxation common in companies.<\/li>\n<li>LLPs are subject to audit requirements only if their annual turnover exceeds a prescribed threshold or if the contributions exceed a specified limit. This provides relief to smaller businesses from extensive auditing requirements.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2><strong>Nature of Partners in a LLP<\/strong><\/h2>\n<p>Every Limited Liability Partnership (LLP) in India must have at least two partners to be formed. Additionally, an LLP must have at least two designated partners, and at least one of them must be a resident and citizen of India. The roles of partners and designated partners can be held by the same individuals or different persons. However, every LLP must have at least two individuals designated as partners.<\/p>\n<p>Regarding the maximum number of partners in an LLP, there is no prescribed cap. This means that the number of partners in an LLP can extend beyond the minimum requirement of two, providing the flexibility to accommodate more partners as the business grows.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Benefits of LLP <\/strong><\/h2>\n<p>The LLP form of business offers several advantages:<\/p>\n<h3>Organized by Agreement<\/h3>\n<p>LLPs are structured and operated based on an agreement among the partners. This allows for customization and flexibility in setting the terms and conditions of the partnership, including profit sharing, decision-making processes, and other operational aspects.<\/p>\n<h3>Flexibility without Excessive Requirements<\/h3>\n<p>LLPs provide flexibility in terms of governance and operations. Unlike companies, LLPs are not burdened with extensive legal and procedural requirements. This simplifies the administrative and compliance aspects of running the business, making it easier for partners to manage and operate the LLP.<\/p>\n<h3>Integration of Expertise and Risk-taking<\/h3>\n<p>LLPs allow for the integration of professional or technical expertise with financial risk-taking capacity. This makes it an ideal structure for professionals such as lawyers, accountants, and consultants who want to pool their skills and resources while limiting personal liability. It encourages innovation and efficiency by combining diverse skill sets within the LLP.<\/p>\n<h3>Limited Liability Protection<\/h3>\n<p>One of the key advantages of an LLP is that partners enjoy limited liability. Their personal assets are protected from the liabilities of the LLP. This safeguard provides peace of mind to partners and encourages entrepreneurial risk-taking.<\/p>\n<h3>Perpetual Succession<\/h3>\n<p>Perpetual succession is a characteristic of LLPs, which means that changes in partners do not affect the existence of the LLP. The LLP continues to exist until the provisions of the LLP Act dissolve it. This feature ensures business continuity and prevents disruption in operations caused by partner changes.<\/p>\n<h3>Taxation Benefits<\/h3>\n<p>LLPs are taxed as partnerships, which means that the LLP itself is not taxed. Instead, partners are individually taxed on their share of profits. This avoids the issue of double taxation that often affects companies.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Registration of LLP <\/strong><\/h2>\n<p>LLP registration in India has emerged as an alternative business form that combines the advantages of a company with the flexibility of a partnership. Introduced in 2008 through the Limited Liability Partnership Act, this unique hybrid structure is well-suited for small and medium-sized businesses. The process of registering an LLP involves several steps, with the initial one being the acquisition of name approval from the Ministry of Corporate Affairs (MCA). This typically takes around 24-48 hours.<\/p>\n<p>When selecting a name for a private limited company in India, it is important to ensure that it ends with the words &#8220;private limited.&#8221; For a One Person Company, the name should conclude with &#8220;(OPC) private limited.&#8221; LLP names, on the other hand, should end with &#8220;LLP.&#8221; In the case of Section 8 companies, they can employ words such as foundation, association, or institution as part of their name.<\/p>\n<p>It is crucial to note that a proposed company name cannot be identical or similar to an existing company name. Additionally, every company name must incorporate a word that signifies the nature of the business activity undertaken by the company.<\/p>\n<p>These requirements and considerations play a significant role in the LLP registration process in India, ensuring uniqueness, clarity, and relevance in the selection of the company&#8217;s name.<\/p>\n<p>&nbsp;<\/p>\n<h2>Conclusion<\/h2>\n<h4>A Versatile Business Structure with Limited Liability Benefits<\/h4>\n<p>In conclusion, Limited Liability Partnerships (LLPs) provide a valuable and flexible business structure. It combines the benefits of limited liability with the ease of operating as a partnership. LLPs are recognized as separate legal entities, distinct from their individual partners, ensuring the protection of personal assets. The foundation of an LLP lies in the partnership agreement, which establishes the rights, duties, and liabilities of the partners. This agreement sets out the basic differences between an LLP and a traditional partnership firm, ensuring that partners have limited liability rather than personal liability. It also outlines the internal governance structure and compliance requirements of the LLP. Compared to other business structures such as limited companies, LLPs offer a deal of flexibility in operations, internal management, and tax advantages. LLPs are suitable for various types of businesses, including law firms, regular firms, and partnerships seeking the benefits of limited liability.<\/p>\n<h4>Advantages and Compliance<\/h4>\n<p>Key differences between LLPs and regular partnership firms include the separate entity status of an LLP, compliance with LLP agreement, and the ability to file annual returns. LLPs also provide distinct advantages, such as the preservation of personal assets, simplified compliance measures, and a straightforward registration process. LLPs are subject to business laws and regulations, but they offer more favorable legal consequences compared to regular firms. They eliminate the need for a common seal, simplify record-keeping with fewer books of accounts, and avoid dividend distribution tax. LLPs also enjoy the convenience of official correspondence and the flexibility to engage in various lawful business activities. Partnership firms transitioning to LLPs benefit from the disposal of partnership assets, liability protection, and continued business operations. LLPs provide an alternative for partnerships that find the unlimited liability of regular firms undesirable.<\/p>\n<h4>Key Considerations for Partners<\/h4>\n<p>It is important for partners of an LLP to be aware of their rights and obligations, as outlined in the LLP agreement. The retirement, death, or vacation of office of a partner has specific legal implications, and proper documentation is required to ensure compliance with the LLP Act. Overall, LLPs offer distinct advantages as a business structure, combining the benefits of limited liability, flexibility, and ease of operation. They provide a viable option for various types of businesses, ensuring the protection of personal assets, compliance with statutory requirements, and access to tax advantages. The flexibility in operations and management structure allows LLPs to adapt to changing business needs while maintaining a high level of legal protection and compliance.<\/p>\n<p>It is advisable to consult and seek legal advice to understand the registration of LLP. For online <a href=\"https:\/\/legal251.com\/\">legal advice,<\/a> please contact <a href=\"https:\/\/legal251.com\/\"> Legal251 <\/a>on toll-free no.- (+91) 77728-77729 or download the <a href=\"https:\/\/legal251.com\/\"> Legal251 <\/a>mobile app now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction  Limited Liability Partnership (LLP): Combining Advantages of Partnerships and Limited Liability A Limited Liability Partnership is an entity that combines the benefits of a traditional partnership and a limited liability company. It provides individual partners with the advantages of limited liability, perpetual succession, and protection of personal assets. LLPs have become popular business structures, [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":1604,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Limited Liability Partnership (LLP) - The Basics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Limited Liability Partnership (LLP) - The Basics\" \/>\n<meta property=\"og:description\" content=\"Introduction  Limited Liability Partnership (LLP): Combining Advantages of Partnerships and Limited Liability A Limited Liability Partnership is an entity that combines the benefits of a traditional partnership and a limited liability company. It provides individual partners with the advantages of limited liability, perpetual succession, and protection of personal assets. LLPs have become popular business structures, [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-20T13:14:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-28T13:47:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20131323\/Limited-Liability-Partnership-LLP-The-Basics.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Limited Liability Partnership (LLP) &#8211; The Basics\",\"datePublished\":\"2023-07-20T13:14:24+00:00\",\"dateModified\":\"2023-07-28T13:47:20+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\"},\"wordCount\":1936,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\",\"url\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\",\"name\":\"Limited Liability Partnership (LLP) - The Basics\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-07-20T13:14:24+00:00\",\"dateModified\":\"2023-07-28T13:47:20+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Limited Liability Partnership (LLP) &#8211; The Basics\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Limited Liability Partnership (LLP) - The Basics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/","og_locale":"en_US","og_type":"article","og_title":"Limited Liability Partnership (LLP) - The Basics","og_description":"Introduction  Limited Liability Partnership (LLP): Combining Advantages of Partnerships and Limited Liability A Limited Liability Partnership is an entity that combines the benefits of a traditional partnership and a limited liability company. It provides individual partners with the advantages of limited liability, perpetual succession, and protection of personal assets. LLPs have become popular business structures, [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-07-20T13:14:24+00:00","article_modified_time":"2023-07-28T13:47:20+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/20131323\/Limited-Liability-Partnership-LLP-The-Basics.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Limited Liability Partnership (LLP) &#8211; The Basics","datePublished":"2023-07-20T13:14:24+00:00","dateModified":"2023-07-28T13:47:20+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/"},"wordCount":1936,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/","url":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/","name":"Limited Liability Partnership (LLP) - The Basics","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-07-20T13:14:24+00:00","dateModified":"2023-07-28T13:47:20+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/limited-liability-partnership-llp-the-basics\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Limited Liability Partnership (LLP) &#8211; The Basics"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1603"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=1603"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1603\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/1604"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=1603"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=1603"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=1603"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}