{"id":1825,"date":"2023-07-27T11:36:10","date_gmt":"2023-07-27T11:36:10","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=1825"},"modified":"2023-08-02T12:38:32","modified_gmt":"2023-08-02T12:38:32","slug":"arbitration-clause-in-a-contract","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/","title":{"rendered":"Arbitration Clause in a contract"},"content":{"rendered":"<h2><strong>A Brief about Arbitration <\/strong><\/h2>\n<p><em>“Discourage litigation. Persuade your neighbors to compromise whenever they can&#8230;As a peacemaker, the lawyer has a superior opportunity of being a good man. There will still be business enough.” &#8211; Abraham Lincoln<\/em><\/p>\n<h3>Meaning of &#8216;Arbitration&#8217;<\/h3>\n<p>The term ‘Arbitration’ literally means “settlement of a dispute outside the court by an appointed private individual”. Foreign arbitration refers to an arbitration conducted in a place outside India and the resulting award is supposed to be enforced in India as a foreign award. The Indian law of arbitration is contained in the Arbitration and Conciliation Act 1996. The Act is based on the 1985 UNCITRAL Model Law on International Commercial Arbitration and the UNCITRAL Arbitration Rules 1976. The industrial revolution led to a swift upsurge in international trade and commerce. To correspond with economic growth and avoid prolonged litigation, the parties prefer arbitration as a dispute resolution mechanism. Cross-border transactions and bilateral trade relations have fostered affiliations between countries and led to the development of an international arbitration system.<\/p>\n<h3>Progression in India<\/h3>\n<p>India has recently entered into various bilateral investment protection agreements with the United Kingdom, Germany, Russian Federation, The Netherlands, Malaysia, and Denmark. Each agreement makes provision for the settlement of a dispute between an investor of one contracting party and an investor of the other contracting party with the help of alternative dispute resolution procedures such as; Arbitration, Conciliation, and negotiation.<\/p>\n<p>One of the recent examples of the use of arbitration by India is that India and Pakistan have agreed to refer the dispute relating to the Indus Water Treaty 1960 to The Permanent Court of Arbitration. This move clarified and supported the importance of arbitration globally. The government of India along with the Judiciary is instrumental in making arbitration synchronised and more viable. The law of arbitration in India is evolving with the needs of a globalizing economy. India’s intention of making arbitration the preferred mode of resolving disputes among the parties for both domestic and international businesses operating in India had been well documented in recent times.<\/p>\n<p>In India, the judicial system faces a significant burden due to a substantial number of pending cases, resulting in delayed judgments becoming the norm. As a result, individuals and businesses have increasingly turned to alternative dispute resolution (ADR) methods to seek quicker and more effective resolutions. Among these methods, arbitration stands out as the most commonly ututilized approach.<\/p>\n<p>Arbitration is an out-of-court proceeding that offers an expedited resolution to disputes. It involves a neutral third party, known as an arbitrator, who listens to the presented evidence and subsequently issues a binding decision. Compared to traditional litigation, arbitration offers several advantages that make it an attractive choice for many.<\/p>\n<h3>The Advantages<\/h3>\n<p>One notable advantage is the speed at which arbitration proceedings can be conducted. As opposed to the prolonged litigation process, arbitration offers a more efficient and timely resolution to conflicts. This expeditiousness allows parties to save valuable time and resources, as well as move forward with their lives or business operations without unnecessary delays.<\/p>\n<p>Additionally, the cost factor plays a significant role in the preference for arbitration over litigation. Legal proceedings can be notoriously expensive, with various expenses such as court fees, attorney fees, and other associated costs. On the contrary, arbitration tends to be more cost-effective, as it typically involves simplified procedures and a quicker resolution, resulting in lower overall expenses.<\/p>\n<p>Confidentiality is another critical aspect of arbitration. Unlike court litigation, which often takes place in public settings, arbitration proceedings are private and confidential. This privacy ensures that the details of the dispute, the evidence presented, and the final arbitral award are kept confidential, providing parties with the necessary discretion and protection of their sensitive information.<\/p>\n<h3>At Last<\/h3>\n<p>Arbitration has emerged as a highly effective and desirable method of resolving disputes in India&#8217;s context of overburdened courts and delayed judgments. Its speed, cost-efficiency, and confidentiality make it an appealing alternative to traditional litigation. By choosing arbitration, individuals and businesses can obtain a swift and private resolution to their conflicts, allowing them to move forward with their lives or operations more efficiently.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Features of the Arbitration Clause<\/strong><\/h2>\n<p>Arbitration clauses in contracts made in India possess distinct features that govern the resolution of disputes through arbitration. These features are crucial in ensuring an efficient and fair arbitration process.<\/p>\n<p>Let&#8217;s explore the key elements of an arbitration clause in contracts made in India:<\/p>\n<h3>Arbitration Agreement<\/h3>\n<p>An arbitration agreement is a separate agreement within the contract that establishes the parties&#8217; consent to resolve any future disputes through arbitration rather than litigation in courts.<\/p>\n<h3>What is Arbitration Clause?<\/h3>\n<p>The specific provision within the contract outlines the details of the arbitration process, including the rules, procedures, and governing principles.<\/p>\n<h3>Arbitration Proceedings<\/h3>\n<p>Formal proceedings are where disputes are resolved through arbitration. This process may involve an arbitrator or a panel of arbitrators who impartially consider the evidence and arguments presented by the parties.<\/p>\n<h3>Commercial Arbitration<\/h3>\n<p>Arbitration is commonly used to settle disputes arising from commercial contracts and relationships, providing an efficient and specialized resolution mechanism.<\/p>\n<h3>Arbitration Institutions<\/h3>\n<p>Institutions such as the London Court of International Arbitration (LCIA) provide guidelines and rules that facilitate the arbitration process, ensuring procedural fairness and expertise in commercial arbitration.<\/p>\n<h3>Seat of Arbitration<\/h3>\n<p>The physical location where the arbitration takes place. The seat determines the legal framework, applicable law, and procedural rules governing the arbitration process.<\/p>\n<h3>Arbitral Award<\/h3>\n<p>The final decision rendered by the arbitrator or arbitral tribunal, resolves the dispute between the parties. An arbitral award is binding and enforceable under Indian law.<\/p>\n<h3>Appointment of Arbitrator<\/h3>\n<p>The process of selecting an arbitrator or a panel of arbitrators to preside over the dispute. The appointment may be based on the agreement of the parties or the rules specified by the chosen arbitration institution.<\/p>\n<h3>Oral Hearings<\/h3>\n<p>The opportunity for the parties to present their arguments, evidence, and witnesses before the arbitrator or arbitral tribunal. Oral hearings promote transparency and allow parties to articulate their positions effectively.<\/p>\n<h3>Speedy Resolution<\/h3>\n<p>Arbitration is favored for its expeditious nature, providing a quicker resolution compared to court proceedings, which can be lengthy and subject to delays.<\/p>\n<h3>Exclusive Jurisdiction<\/h3>\n<p>The arbitration clause may stipulate that arbitration is the exclusive method for resolving disputes, precluding the parties from pursuing litigation in court or participating in class-action lawsuits.<\/p>\n<h3>Sole Arbitrator or Panel of Arbitrators<\/h3>\n<p>The arbitration clause may specify whether the dispute will be resolved by a sole arbitrator or a panel of arbitrators, depending on the complexity and nature of the dispute.<\/p>\n<h3>International Arbitration<\/h3>\n<p>Arbitration involves parties from different countries, requiring considerations of applicable laws, jurisdictional issues, and the enforcement of arbitral awards across borders.<\/p>\n<h3>Dispute Resolution Clause<\/h3>\n<p>Another term for the arbitration clause, highlights its purpose of resolving disputes outside of court.<\/p>\n<h3>Public Policy<\/h3>\n<p>The arbitration clause and subsequent proceedings must adhere to the public policy of India, ensuring fairness, legality, and adherence to established legal principles.<\/p>\n<p>Arbitration clauses in contracts made in India provide a framework for efficient and effective dispute resolution in commercial relationships. They enable parties to resolve their disputes through a specialized arbitration process, promoting speedy resolution, maintaining commercial relationships, and upholding the principles of fairness and public policy.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Advantages of the Arbitration clause <\/strong><\/h2>\n<h3>Efficiency and Flexibility<\/h3>\n<p>Arbitration offers a significantly faster resolution compared to court trials. While securing a trial date can take years, arbitration hearings can usually be scheduled within a few months. Court calendars often face a backlog of numerous cases, whereas arbitration allows parties to schedule proceedings based on their availability and that of the arbitrator.<\/p>\n<h3>Simplicity<\/h3>\n<p>Arbitration simplifies the complex rules of evidence and procedure involved in litigation. Unlike court proceedings, arbitrators may not strictly adhere to traditional rules of evidence, making it easier to admit evidence. Additionally, the time-consuming and costly process of discovery, which includes interrogatories, depositions, and document requests, can be significantly reduced in arbitration. Parties can often address key matters, such as witness testimony and document production, through simple phone calls with the arbitrator.<\/p>\n<h3>Confidential Resolution<\/h3>\n<p>Arbitration ensures a private resolution, keeping the details of the dispute and its resolution confidential. This aspect is particularly appealing to public figures or clients involved in business disputes, as it prevents the disclosure of sensitive information. In contrast, court proceedings carry the risk of public access to potentially confidential business information, even if certain records are not released.<\/p>\n<h3>Impartiality<\/h3>\n<p>Parties in a dispute typically have a say in selecting the arbitrator, ensuring they choose an impartial and unbiased individual whom they both trust.<\/p>\n<h3>Cost-Effectiveness<\/h3>\n<p>While not always the case, arbitration tends to be less expensive than litigation. The expedited nature of arbitration proceedings reduces attorney fees compared to lengthy court trials. Moreover, the preparation costs for arbitration are generally lower than those for a jury trial.<\/p>\n<h3>Conclusive Resolution<\/h3>\n<p>In binding arbitration, opportunities for appeal are limited. This provides a level of finality to the arbitration process, which is not often found in trial decisions that may undergo appeals, new trials, and further appeals.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Disadvantages of Arbitration<\/strong><\/h2>\n<h3>Transparency Concerns<\/h3>\n<p>Arbitration hearings are held in private, which may be viewed positively by some. However, the lack of transparency in the process can raise concerns about potential bias, particularly considering that arbitration decisions are infrequently reviewed by the courts.<\/p>\n<h3>Limited Appeal Options<\/h3>\n<p>In binding arbitration, both parties give up their right to appeal. While this can be advantageous if the arbitration decision is favorable, it leaves little opportunity for correcting erroneous decisions. Parties must be aware of the finality of the arbitration process.<\/p>\n<h3>Potential for Higher Costs<\/h3>\n<p>Arbitration can be more expensive than court proceedings in certain cases. Quality arbitrators may demand substantial fees that would not apply in a court setting. In non-binding arbitrations, parties have the option to take their issue back to court, essentially adding the cost of litigation to the expenses already incurred during arbitration. Employers, in particular, are usually responsible for paying the full fees of the arbitrator, which can be significant in employment law cases.<\/p>\n<h3>Unpredictability<\/h3>\n<p>Arbitration does not always follow formal rules of procedure and evidence employed in courtroom trials. While rules of evidence may restrict the consideration of certain evidence in court, arbitrators have more flexibility in their decision-making. As a result, an arbitrator&#8217;s decision may be based on evidence that would not be considered in a trial, potentially affecting the outcome of the case. Conversely, if information from a witness is presented solely through documents, there is no opportunity for cross-examination, which may impact the fairness of the process.<\/p>\n<p>In summary, arbitration comes with certain disadvantages. These include concerns regarding transparency, limited appeal options, potentially higher costs, and unpredictability compared to courtroom trials. It is essential to carefully consider these drawbacks when deciding whether to opt for arbitration as an alternative to litigation.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>What should an arbitration clause include?<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\"><img decoding=\"async\" loading=\"lazy\" class=\"alignnone wp-image-1826\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113228\/What-should-an-arbitration-clause-include-300x300.jpg\" alt=\"What should an arbitration clause include?\" width=\"720\" height=\"720\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113228\/What-should-an-arbitration-clause-include-300x300.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113228\/What-should-an-arbitration-clause-include-1024x1024.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113228\/What-should-an-arbitration-clause-include-150x150.jpg 150w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113228\/What-should-an-arbitration-clause-include-768x768.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113228\/What-should-an-arbitration-clause-include.jpg 1080w\" sizes=\"(max-width: 720px) 100vw, 720px\" \/><\/a><\/p>\n<h3>Governing Law<\/h3>\n<p>Clearly specify which law will apply to the arbitration, especially in cases where the parties involved are from different jurisdictions. The choice can be the laws of a specific country or an internationally recognized set of rules.<\/p>\n<h3>Jurisdiction<\/h3>\n<p>If the arbitration will take place in a specific country, clearly identify the court or legal system that will have jurisdiction over any matters related to the arbitration.<\/p>\n<h3>Number of Arbitrators<\/h3>\n<p>Determine whether there will be one arbitrator or a panel of three. If three arbitrators are chosen, specify how they will be appointed, either through mutual agreement or by each party appointing one arbitrator who will then select a third arbitrator.<\/p>\n<h3>Place of Arbitration<\/h3>\n<p>Identify the physical location where the arbitration will be conducted. If the arbitration is subject to the rules of an institution, the default place of arbitration is typically where the institution is based, unless the parties agree otherwise.<\/p>\n<h3>Language of the Arbitration<\/h3>\n<p>Determine the language in which the arbitration proceedings will be conducted and all related documents will be presented. This is usually decided through mutual agreement or determined by the arbitral tribunal.<\/p>\n<h3>Finality of Award<\/h3>\n<p>Include a provision stating that the decision rendered by the arbitrator(s) will be final and binding on all parties involved, with no further right of appeal, except in cases of limited review on procedural grounds.<\/p>\n<h3>Costs of Arbitration<\/h3>\n<p>Always address how the parties will allocate the costs of the arbitration. While it is common to share costs equally, it is essential to explicitly state this allocation or any alternative arrangement.<\/p>\n<p>&nbsp;<\/p>\n<h2>Conclusion<\/h2>\n<p>In conclusion, arbitration clauses in contracts made in India offer a robust framework for resolving disputes in commercial relationships. The inclusion of an arbitration agreement and arbitration clause provides parties with an alternative method to litigation, promoting efficient and fair resolution through arbitration proceedings.<\/p>\n<p>Commercial arbitration, facilitated by reputable arbitration institutions like the London Court of International Arbitration, ensures specialized expertise and procedural fairness in resolving disputes. The arbitration process, whether initiated through a request for arbitration or by agreement, allows parties to present their cases before an arbitrator or panel of arbitrators. The arbitration clause specifies important aspects such as the seat of arbitration, which determines the applicable law and procedural rules governing the proceedings. It may also outline the form of arbitration, the appointment of arbitrators, and the conduct of oral hearings, ensuring transparency and an opportunity for parties to present their arguments.<\/p>\n<p>Arbitration clauses in contracts made in India adhere to public policy, promoting fairness, legality, and upholding established legal principles. They enable parties to maintain commercial relationships while ensuring a speedy resolution of disputes without resorting to lengthy court proceedings. By providing an exclusive jurisdiction for dispute resolution, arbitration clauses discourage class action lawsuits and reinforce the binding nature of the arbitration award. They offer flexibility in choosing a sole arbitrator or a panel of arbitrators based on the complexity of the dispute, allowing parties to select qualified professionals with expertise in the relevant field.<\/p>\n<p>It is important to consult with legal professionals when drafting an arbitration clause to ensure that it meets the specific requirements and needs of the parties involved. For <a href=\"https:\/\/legal251.com\/consultancy\" target=\"_blank\" rel=\"noopener\">online legal advice<\/a>, please contact <a href=\"https:\/\/legal251.com\/\" target=\"_blank\" rel=\"noopener\">Legal251<\/a> on toll-free no.- (+91) 77728-77729 or download the Legal251 mobile app now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Brief about Arbitration “Discourage litigation. Persuade your neighbors to compromise whenever they can&#8230;As a peacemaker, the lawyer has a superior opportunity of being a good man. There will still be business enough.” &#8211; Abraham Lincoln Meaning of &#8216;Arbitration&#8217; The term ‘Arbitration’ literally means “settlement of a dispute outside the court by an appointed private [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":1827,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Arbitration Clause in a contract<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Arbitration Clause in a contract\" \/>\n<meta property=\"og:description\" content=\"A Brief about Arbitration “Discourage litigation. Persuade your neighbors to compromise whenever they can&#8230;As a peacemaker, the lawyer has a superior opportunity of being a good man. There will still be business enough.” &#8211; Abraham Lincoln Meaning of &#8216;Arbitration&#8217; The term ‘Arbitration’ literally means “settlement of a dispute outside the court by an appointed private [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-27T11:36:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-02T12:38:32+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113438\/Arbitration-Clause-in-a-contract.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Arbitration Clause in a contract\",\"datePublished\":\"2023-07-27T11:36:10+00:00\",\"dateModified\":\"2023-08-02T12:38:32+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\"},\"wordCount\":2356,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\",\"url\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\",\"name\":\"Arbitration Clause in a contract\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-07-27T11:36:10+00:00\",\"dateModified\":\"2023-08-02T12:38:32+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Arbitration Clause in a contract\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Arbitration Clause in a contract","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/","og_locale":"en_US","og_type":"article","og_title":"Arbitration Clause in a contract","og_description":"A Brief about Arbitration “Discourage litigation. Persuade your neighbors to compromise whenever they can&#8230;As a peacemaker, the lawyer has a superior opportunity of being a good man. There will still be business enough.” &#8211; Abraham Lincoln Meaning of &#8216;Arbitration&#8217; The term ‘Arbitration’ literally means “settlement of a dispute outside the court by an appointed private [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-07-27T11:36:10+00:00","article_modified_time":"2023-08-02T12:38:32+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/27113438\/Arbitration-Clause-in-a-contract.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Arbitration Clause in a contract","datePublished":"2023-07-27T11:36:10+00:00","dateModified":"2023-08-02T12:38:32+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/"},"wordCount":2356,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/","url":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/","name":"Arbitration Clause in a contract","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-07-27T11:36:10+00:00","dateModified":"2023-08-02T12:38:32+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/arbitration-clause-in-a-contract\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Arbitration Clause in a contract"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1825"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=1825"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1825\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/1827"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=1825"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=1825"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=1825"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}