{"id":1888,"date":"2023-08-04T07:06:24","date_gmt":"2023-08-04T07:06:24","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=1888"},"modified":"2023-08-04T10:28:22","modified_gmt":"2023-08-04T10:28:22","slug":"registration-of-a-society-in-india","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/","title":{"rendered":"Registration of a Society in India"},"content":{"rendered":"<h2><strong>What is Society?<\/strong><\/h2>\n<p>At its core, a society can be understood as a collective association of individuals. Individuals who come together voluntarily, bound by mutual consent, to collaborate and address various everyday needs. Societies are distinguished by the intricate web of social connections that interlink individuals sharing a common culture and organized institutions. The collective sum of these relationships defines a society, shaping the interactions and behaviors of its members.<\/p>\n<p>In pursuit of benevolent objectives, societies often seek official recognition and may register under the Societies Registration Act, 1860. This act lays down specific procedures for registration and functioning, aimed at facilitating activities for the betterment of society. Some such facilities are providing free education, and healthcare, supporting arts, and science, and alleviating the circumstances of the underprivileged. Across different states, this act has been adopted with or without amendments, signifying its widespread acceptance in advancing numerous causes.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Registration of a Society in India<\/strong><\/h2>\n<p>Society registration in India is a process that involves fulfilling legal conditions and requirements to establish a registered society. The following steps outline the process:<\/p>\n<h4><em>Application for Society Registration<\/em><\/h4>\n<p>The interested parties must submit an application for society registration, including a cover letter, to the concerned authority.<\/p>\n<h4><em>Essential Documents<\/em><\/h4>\n<p>Along with the application, certain essential documents must be provided, such as the complete address of the registered office, proof of address, valid residence proof, bank statements, and proof of income.<\/p>\n<h4><em>Legal Stipulations<\/em><\/h4>\n<p>The society&#8217;s objectives should align with charitable purposes, educational institutions, advancement of literature, promotion of science, and other common goals. The society&#8217;s activities should adhere to the legal stipulations and conditions of societies registration.<\/p>\n<h4><em>Vetting and Approval<\/em><\/h4>\n<p>The application and associated documents undergo proper vetting by the competent authority to ensure compliance with the requirements for registration. This may involve scrutiny by gazetted officers and oath commissioners.<\/p>\n<h4><em>Registration Process<\/em><\/h4>\n<p>Upon successful vetting, the concerned society is registered, and a certificate of registration or incorporation is issued. The official stamp of the society is applied to validate the registration.<\/p>\n<h4><em>Benefits of Society Registration<\/em><\/h4>\n<p>Registered societies enjoy various benefits, such as income tax exemption, access to bank loans, and eligibility for funding for charitable activities. Additionally, the society gains recognition and credibility in its pursuit of its objectives.<\/p>\n<h4><em>Day-to-Day Activities<\/em><\/h4>\n<p>Once registered, the society can engage in day-to-day activities related to its objectives, including the maintenance of libraries, provision of educational services, and distribution of awareness on social and political issues.<\/p>\n<h4><em>Disputes and Dissolution<\/em><\/h4>\n<p>If disputes arise among society members or a decision to dissolve the society is made, it is imperative to follow legal procedures. Adhere to the dissolution clause and provide essential documents, including audit reports and income receipts.<\/p>\n<p>Registration of a society in India is essential to establish a legally recognized entity that can engage in various charitable and educational activities for the betterment of society. It ensures compliance with the stipulations of society registration, allows access to benefits, and facilitates the achievement of the society&#8217;s goals.<\/p>\n<h2>Purpose of Society Registration<\/h2>\n<p>The registration of a society serves several purposes, which are outlined in Section 20 of the Society Act of 1860. These purposes include:<\/p>\n<h4><em>Promotion of fine arts<\/em><\/h4>\n<p>Society registration can be sought to support and foster the development of various forms of artistic expression.<\/p>\n<h4><em>Diffusion of political education<\/em><\/h4>\n<p>Societies can be established to educate individuals about political matters, enabling them to make informed decisions and participate actively in the political process.<\/p>\n<h4><em>Grant of charitable assistance<\/em><\/h4>\n<p>Registered societies can provide charitable aid to those in need, such as financial support, resources, or other forms of assistance.<\/p>\n<h4><em>Promotion of science and literature<\/em><\/h4>\n<p>Societies may focus on advancing scientific knowledge, conducting research, and promoting literature through various initiatives.<\/p>\n<h4><em>Creation of military orphan funds<\/em><\/h4>\n<p>Societies can be formed to establish and manage funds aimed at providing support to orphaned children of military personnel.<\/p>\n<h4><em>Maintenance or foundation of galleries or public museums<\/em><\/h4>\n<div class=\"group w-full text-token-text-primary border-b border-black\/10 dark:border-gray-900\/50 bg-gray-50 dark:bg-[#444654]\">\n<div class=\"flex p-4 gap-4 text-base md:gap-6 md:max-w-2xl lg:max-w-[38rem] xl:max-w-3xl md:py-6 lg:px-0 m-auto\">\n<div class=\"relative flex w-[calc(100%-50px)] flex-col gap-1 md:gap-3 lg:w-[calc(100%-115px)]\">\n<div class=\"flex flex-grow flex-col gap-3\">\n<div class=\"min-h-[20px] flex flex-col items-start gap-3 overflow-x-auto whitespace-pre-wrap break-words\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p>Societies can establish, maintain, and manage galleries or public museums for preserving and showcasing cultural artifacts and works of art.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<h4><em>Maintenance or foundation of reading rooms or libraries<\/em><\/h4>\n<p>Societies can establish and maintain reading rooms or libraries to facilitate access to educational resources and promote a culture of learning.<\/p>\n<h4><em>Promotion or diffusion of instruction of useful knowledge<\/em><\/h4>\n<p>Societies may engage in activities that promote the spread of practical knowledge and skills for the betterment of society.<\/p>\n<h4><em>Collections of natural history<\/em><\/h4>\n<p>Societies can focus on the collection, preservation, and study of natural history specimens, contributing to scientific understanding and conservation efforts.<\/p>\n<p>Collections of mechanical and philosophical inventions, designs, or instruments: Societies can undertake the collection and preservation of mechanical and philosophical inventions, designs, or instruments, fostering innovation and knowledge-sharing.<\/p>\n<p>By registering under the Society Act, organizations can pursue these purposes, ensuring legal recognition and facilitating their efforts to contribute to society in these diverse areas.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Registration of Society in India<\/strong><\/h2>\n<h2><a href=\"https:\/\/legal251.com\/legal251app\"><strong><img decoding=\"async\" loading=\"lazy\" class=\"alignnone wp-image-1890\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070544\/Registration-of-a-Society-300x169.jpg\" alt=\"Registration of a Society\" width=\"1056\" height=\"595\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070544\/Registration-of-a-Society-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070544\/Registration-of-a-Society-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070544\/Registration-of-a-Society-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070544\/Registration-of-a-Society-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070544\/Registration-of-a-Society.jpg 1920w\" sizes=\"(max-width: 1056px) 100vw, 1056px\" \/><\/strong><\/a><\/h2>\n<p>To establish a society, there are important considerations and procedures involved. Here is a comprehensive guide on how to register a society and the requirements for registration:<\/p>\n<ol>\n<li aria-level=\"1\">Minimum number of members: A minimum of seven or more individuals, companies, foreigners, or other registered societies in India must come together to form a society.<\/li>\n<li aria-level=\"1\">Similar to partnership firms, individuals can register or leave a society unregistered. For registration, individuals need to draft a memorandum outlining the society&#8217;s objectives, rules, and regulations.<\/li>\n<li aria-level=\"1\">Registered society benefits: It&#8217;s important to note that only a registered society can collectively own property or file legal proceedings on behalf of the society.<\/li>\n<li>The state government authority manages society registrations. Therefore, you should submit the application for society registration to the appropriate authority in the state where the society&#8217;s registered office is located.<\/li>\n<\/ol>\n<p>By adhering to these steps and requirements, individuals or groups can proceed with the registration process and establish a society to fulfil their intended purposes.<\/p>\n<p>The formation of a Society in India requires a minimum of seven or more individuals, including foreigners, companies, and other registered societies, who can subscribe to the Memorandum of the society. Registered societies can hold vested properties and participate in legal proceedings, whereas unregistered societies do not have these privileges.<\/p>\n<p>The State Governments oversee the process of society registration. To register a society, the founding members must agree on a suitable name and prepare the Memorandum and Rules and Regulations of the Society.<\/p>\n<h4><strong><em>Choosing a Name for the Society<\/em><\/strong><em>:<\/em><\/h4>\n<p>While selecting a name, it is essential to ensure it is distinct from existing registered societies and does not suggest government patronage or infringe upon the provisions of the Emblem and Names Act, 1950.<\/p>\n<h4><strong><em>Memorandum of a Society:<\/em><\/strong><\/h4>\n<p>Each founding member must sign the Memorandum and Rules and Regulations, and an authorized official, such as an Oath Commissioner, Notary Public, Gazetted Officer, Advocate, Chartered Accountant, or Magistrate 1st Class, must witness the signatures. The authorized official should also affix their official stamp and provide their complete address.<\/p>\n<h4><strong><em>Documents Required for Society Registration:<\/em><\/strong><\/h4>\n<ol>\n<li aria-level=\"1\">Covering letter signed by all founding members, requesting society registration.<\/li>\n<li aria-level=\"1\">Duplicate copies of the Memorandum of Association and Rules and Regulations, along with certified copies.<\/li>\n<li aria-level=\"1\">Affidavit from the President or Secretary of the Society, stating the relationship between the subscribers.<\/li>\n<li aria-level=\"1\">Address proof for the registered office of the Society and a No-Objection Certificate from the landlord.<\/li>\n<\/ol>\n<h4><strong><em>Submission and Registration:<\/em><\/strong><\/h4>\n<div class=\"group w-full text-token-text-primary border-b border-black\/10 dark:border-gray-900\/50 bg-gray-50 dark:bg-[#444654]\">\n<div class=\"flex p-4 gap-4 text-base md:gap-6 md:max-w-2xl lg:max-w-[38rem] xl:max-w-3xl md:py-6 lg:px-0 m-auto\">\n<div class=\"relative flex w-[calc(100%-50px)] flex-col gap-1 md:gap-3 lg:w-[calc(100%-115px)]\">\n<div class=\"flex flex-grow flex-col gap-3\">\n<div class=\"min-h-[20px] flex flex-col items-start gap-3 overflow-x-auto whitespace-pre-wrap break-words\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p>You must file the signed Memorandum and Rules and Regulations, along with the required documents, with the concerned Registrar of Societies in the State, accompanied by the prescribed fee. If the Registrar finds the application satisfactory, they will register the Society.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<h2>Conclusion<\/h2>\n<p>In conclusion, society registration in India plays a vital role in formalizing and empowering organizations dedicated to charitable activities, political education, and the advancement of various societal objectives. The process involves adhering to legal conditions and submitting essential documents, such as proof of address, bank statements, and a cover letter, for proper vetting by the competent authority.<\/p>\n<p>Once registered, societies can engage in day-to-day activities, including the maintenance of libraries, distribution of awareness, and provision of educational services. They operate with an official stamp and have a registered office, ensuring a solid foundation for their operations.<\/p>\n<p>The registration brings several benefits, such as income tax exemption and access to bank loans, facilitating the pursuit of their charitable purposes and the achievement of common goals. It also ensures compliance with legal stipulations and opens doors to valuable resources and support.<\/p>\n<p>Registered societies, whether educational or charitable, hold a significant role in the development of the nation. They foster the dissemination of objective knowledge, promote literature and science, and contribute to the maintenance of a vibrant society. Their existence and active participation create opportunities for the distribution of helpful knowledge and the cultivation of political awareness.<\/p>\n<p>In case of disputes or the need for dissolution, societies follow legal procedures, supported by audit documents, income receipts, and the appropriate decision-making processes.<\/p>\n<h3>At Last<\/h3>\n<p>Ultimately, society registration provides a framework for collective endeavors and the pursuit of bountiful purposes. It enables organizations to establish and maintain educational institutions, promote literature and science, and contribute to the overall well-being of society. By fostering access to education and undertaking day-to-day activities, registered societies work towards the common goal of societal progress and betterment.<\/p>\n<p>In summary, the registration process for societies in India empowers them to operate effectively, obtain legal recognition, and access necessary resources. It ensures compliance with legal conditions, facilitates the achievement of objectives, and promotes the development of a harmonious and inclusive society.<\/p>\n<p>It is advisable to consult and seek <a href=\"https:\/\/legal251.com\/legal-claim-help\">legal advice<\/a> to understand the registration of Society. For<a href=\"https:\/\/legal251.com\/legal-claim-help\"> online legal advice<\/a>, please contact <a href=\"https:\/\/legal251.com\/\"> Legal251 <\/a>on toll-free no.- (+91) 77728-77729 or download the Legal251 mobile app now.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Society? At its core, a society can be understood as a collective association of individuals. Individuals who come together voluntarily, bound by mutual consent, to collaborate and address various everyday needs. Societies are distinguished by the intricate web of social connections that interlink individuals sharing a common culture and organized institutions. The collective [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":1889,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Registration of a Society in India<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Registration of a Society in India\" \/>\n<meta property=\"og:description\" content=\"What is Society? At its core, a society can be understood as a collective association of individuals. Individuals who come together voluntarily, bound by mutual consent, to collaborate and address various everyday needs. Societies are distinguished by the intricate web of social connections that interlink individuals sharing a common culture and organized institutions. The collective [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-04T07:06:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-04T10:28:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070506\/Registration-of-a-Society-in-India.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Registration of a Society in India\",\"datePublished\":\"2023-08-04T07:06:24+00:00\",\"dateModified\":\"2023-08-04T10:28:22+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\"},\"wordCount\":1611,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Guide\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\",\"url\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\",\"name\":\"Registration of a Society in India\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-04T07:06:24+00:00\",\"dateModified\":\"2023-08-04T10:28:22+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Registration of a Society in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Registration of a Society in India","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Registration of a Society in India","og_description":"What is Society? At its core, a society can be understood as a collective association of individuals. Individuals who come together voluntarily, bound by mutual consent, to collaborate and address various everyday needs. Societies are distinguished by the intricate web of social connections that interlink individuals sharing a common culture and organized institutions. The collective [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-04T07:06:24+00:00","article_modified_time":"2023-08-04T10:28:22+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/04070506\/Registration-of-a-Society-in-India.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Registration of a Society in India","datePublished":"2023-08-04T07:06:24+00:00","dateModified":"2023-08-04T10:28:22+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/"},"wordCount":1611,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Guide"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/","url":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/","name":"Registration of a Society in India","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-04T07:06:24+00:00","dateModified":"2023-08-04T10:28:22+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/registration-of-a-society-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Registration of a Society in India"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1888"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=1888"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1888\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/1889"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=1888"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=1888"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=1888"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}