{"id":1975,"date":"2023-08-09T06:56:54","date_gmt":"2023-08-09T06:56:54","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=1975"},"modified":"2023-08-09T07:03:16","modified_gmt":"2023-08-09T07:03:16","slug":"retrospective-effect-pocso-act","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/","title":{"rendered":"Retrospective Effect POCSO Act"},"content":{"rendered":"<div id=\"text-body\">\n<h2><strong>Introduction to the Protection of Children from Sexual Offences (POCSO) Act<\/strong><\/h2>\n<p>The Protection of Children from Sexual Offences (POCSO) Act was originally enacted in 2012 and was enforced on 14th November. It aims to provide comprehensive protection to children from sexual assault, sexual harassment, and pornography. It establishes a legal framework that prioritizes the well-being and interests of the child throughout the judicial process.<\/p>\n<p>This lack of robust legislation meant various forms of sexual offenses against children. Such as sexual assault (excluding rape), harassment, and exploitation for pornography, went unpunished. However, in recent years, there has been a significant increase in reported cases of sexual offenses against children. Leading to a collaborative effort between Non-Governmental Organisations and the Ministry of Women and Child Development to address the issue.<\/p>\n<p>This collective momentum resulted in the passing of the landmark Protection of Children from Sexual Offences (POCSO) Act in 2012. The Act recognizes a child as any person below the age of eighteen. It also defines different forms of sexual abuse, including penetrative and non-penetrative assault, sexual harassment, and pornography. The Act considers sexual assault as &#8220;aggravated&#8221; in certain circumstances, such as when the abused child is mentally ill or when a person in a position of trust or authority commits the abuse.<\/p>\n<p>The POCSO Act emphasizes the protection of children and introduces child-friendly mechanisms at every stage of the judicial process. It establishes special courts dedicated to handling POCSO cases, ensuring the expeditious resolution of such offenses. This comprehensive legislation marks a significant step forward in safeguarding children from sexual offenses. It has also addressed the issue of child sexual abuse in India.<\/p>\n<h2><strong>The Retrospective Effect of the POCSO Act: Ensuring Justice for Victims<\/strong><\/h2>\n<p>The Protection of Children from Sexual Offences (POCSO) Act serves as a pivotal legal framework aimed at safeguarding children from sexual exploitation and abuse. A notable facet of this act is its retrospective effect, which plays a pivotal role in ensuring justice for victims of past offenses. This retrospective provision holds the potential to bring perpetrators of historical child sexual abuse to account, even for offenses committed before the enactment of the act.<\/p>\n<h3>Understanding Retrospective Effect<\/h3>\n<p>The retrospective effect of the POCSO Act implies its applicability to cases that transpired prior to its implementation. This provision substantially broadens the scope of justice, enabling the prosecution of individuals who might have evaded legal consequences due to the absence of specific legislation addressing child sexual abuse in the past.<\/p>\n<h3>Significance of Retrospective Effect<\/h3>\n<p><strong>Closure for Victims:<\/strong><\/p>\n<p>The retrospective effect offers victims the opportunity to seek justice and closure for traumatic experiences endured during their childhood. This provision acknowledges that the emotional and psychological scars of child sexual abuse can endure a lifetime and underscores the significance of addressing historical cases.<\/p>\n<p><strong>Deterrence:<\/strong><\/p>\n<p>By allowing the retrospective application of the POCSO Act, potential offenders are deterred from avoiding accountability through the exploitation of legal gaps that existed before the act&#8217;s implementation. This resoundingly conveys the message that no one is exempt from prosecution for such heinous crimes, regardless of the elapsed time.<\/p>\n<p><strong>Alignment with International Standards:<\/strong><\/p>\n<p>Numerous international conventions emphasize the necessity of prosecuting child sexual abuse cases, irrespective of when they occurred. The retrospective effect aligns the POCSO Act with these global standards and commitments to safeguard children&#8217;s rights.<\/p>\n<h3>Legal and Ethical Considerations<\/h3>\n<p><strong>Constitutional Validity:<\/strong><\/p>\n<p>The retrospective effect raises queries about the constitutional validity of applying the law to past actions. Courts must carefully weigh the retrospective provision against the principles of fairness and justice enshrined in the Constitution.<\/p>\n<p><strong>Prescription of Offenses:<\/strong><\/p>\n<p>The retrospective effect challenges the concept of the prescription of offenses, which establishes a time limit for commencing legal proceedings. Balancing the imperative for justice with legal principles can be intricate when dealing with historical child sexual abuse cases.<\/p>\n<h3>Challenges and Limitations<\/h3>\n<p><strong>Evidentiary Challenges:<\/strong><\/p>\n<p>Collecting evidence in historical cases can be formidable due to the passage of time, faded memories, and the unavailability of witnesses. These factors can impede the successful prosecution of offenders.<\/p>\n<p><strong>Statute of Limitations:<\/strong><\/p>\n<p>In some jurisdictions, statutes of limitations might apply to child sexual abuse cases, restricting the timeframe within which legal actions can be initiated. The retrospective effect might need to contend with these limitations.<\/p>\n<p>The retrospective effect of the POCSO Act stands as a crucial stride towards ensuring justice for victims of historical child sexual abuse. By extending its protective reach to cases preceding its enactment, the act upholds the rights of children and aligns with international standards. While challenges persist, the potential of this provision to grant closure to victims and discourage potential offenders underscores its paramount significance in the pursuit of a just and equitable society.<\/p>\n<h2><strong>The Protection of Children from Sexual Offences (POCSO) Act: Ensuring Child Welfare and Justice<\/strong><\/h2>\n<p>The POCSO Act is a significant legal framework in India that focuses on safeguarding minor children from sexual abuse and exploitation. Enacted to address various aspects of child protection, the Act employs stringent measures to punish offenders and ensure the well-being of child abuse survivors.<\/p>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"alignnone wp-image-1977\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065013\/Key-Provisions-of-POCSO-Act-300x169.jpg\" alt=\"Key Provisions of POCSO Act\" width=\"1053\" height=\"593\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065013\/Key-Provisions-of-POCSO-Act-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065013\/Key-Provisions-of-POCSO-Act-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065013\/Key-Provisions-of-POCSO-Act-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065013\/Key-Provisions-of-POCSO-Act-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065013\/Key-Provisions-of-POCSO-Act.jpg 1920w\" sizes=\"(max-width: 1053px) 100vw, 1053px\" \/><\/a><\/p>\n<h3>Key Provisions<\/h3>\n<p>Imposition of Death Sentence and Life Sentence:<\/p>\n<ul>\n<li>The Act provides for the imposition of the death sentence and life imprisonment for severe cases of child abuse.<\/li>\n<\/ul>\n<p>Anticipatory Bail and Retrospective Operation:<\/p>\n<ul>\n<li>Anticipatory bail is limited under the Act, emphasizing the urgency of child protection.<\/li>\n<li>The Act does not have retrospective operation, ensuring that older cases are addressed under previous laws.<\/li>\n<\/ul>\n<p>Mandatory Reporting and Child Line:<\/p>\n<ul>\n<li>Mandatory reporting requires individuals to report any suspicion or knowledge of child abuse.<\/li>\n<li>Child Line is a helpline for children in distress or danger, ensuring immediate assistance.<\/li>\n<\/ul>\n<p>Abuse on Children and Child Marriages:<\/p>\n<ul>\n<li>The Act encompasses various forms of abuse on children, including penetrative assault and assault against boys.<\/li>\n<li>It addresses child marriages, providing legal protection against such practices.<\/li>\n<\/ul>\n<p>Child Victim and Child for Adoption\/Ransom:<\/p>\n<ul>\n<li>The Act recognizes the rights and protection of child victims.<\/li>\n<li>Provisions address cases involving children being used for adoption or ransom.<\/li>\n<\/ul>\n<p>Role of Courts and Judiciary:<\/p>\n<ul>\n<li>The Supreme Court, Bombay High Court, and Delhi High Court play crucial roles in interpreting and enforcing the Act.<\/li>\n<li>Larger benches and 3-Judge benches are sometimes convened for complex cases.<\/li>\n<\/ul>\n<h3><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"alignnone wp-image-1978\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065115\/Developments-in-POCSO-Act_-300x169.jpg\" alt=\"Developments in POCSO Act_\" width=\"1044\" height=\"588\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065115\/Developments-in-POCSO-Act_-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065115\/Developments-in-POCSO-Act_-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065115\/Developments-in-POCSO-Act_-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065115\/Developments-in-POCSO-Act_-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09065115\/Developments-in-POCSO-Act_.jpg 1920w\" sizes=\"(max-width: 1044px) 100vw, 1044px\" \/><\/a>Recent Developments<\/h3>\n<p>Centre Tells Supreme Court: The central government communicates legislative and policy changes related to child protection to the Supreme Court.<\/p>\n<p>Child Welfare Committee (CWC) and Child-Friendly Procedures:<\/p>\n<p>CWCs work to ensure the welfare of child abuse survivors and their rehabilitation. Child-friendly procedures aim to make the legal process less traumatic for child victims.<\/p>\n<p>Challenges and Future Considerations: Capital Punishment and Legislative Intent: The debate over capital punishment underscores the legislative intent behind the Act.<\/p>\n<p>Amendment of Pleadings and Allocation of Time: Amendments to legal proceedings are allowed, but the allocation of time is crucial to expedite justice.<\/p>\n<p>Role of Adult Survivors and Child Trusts: Adult survivors play a role in advocating for child protection reforms. Child trusts work towards the well-being of abused children.<\/p>\n<p>The POCSO Act is a vital legal instrument that addresses child abuse comprehensively, ensuring the safety and well-being of minor children. It reflects the commitment of Indian legal institutions to protect the rights and dignity of children, and ongoing efforts aim to enhance its effectiveness and child-friendly procedures.<\/p>\n<h2><strong>Exploring the Retrospective Effect of the POCSO Act: Case Analysis<\/strong><\/h2>\n<h4>Background of Retrospective Application<\/h4>\n<p>The Protection of Children from Sexual Offences (POCSO) Act, enacted in 2012, has raised questions about its retrospective application. While the Act came into force in 2012, it applies only to offenses committed after 14th November 2012. This limitation excludes offenses committed before this date from its provisions, highlighting the Act&#8217;s non-retrospective nature.<\/p>\n<h4>Stricter Punishments and the 2019 Amendment<\/h4>\n<p>In 2019, an amendment to the POCSO Act introduced harsher penalties, including the possibility of the death penalty for perpetrators of sexual assault against children. The amendment aimed to send a strong deterrent message to society. However, the Supreme Court underscored that retrospective application cannot be granted to this amendment, particularly when the intent is prospective.<\/p>\n<h4>Constitutional Safeguards and Article 20(1)<\/h4>\n<p>Article 20(1) of the Constitution of India safeguards individuals from ex post facto laws, preventing retroactive conviction and sentencing. It ensures that penalties greater than those applicable at the time of the offense are not imposed.<\/p>\n<h4>State of Telangana vs. Polepaka Praveen @ Pawan: Case Analysis<\/h4>\n<p>The recent case of State of Telangana vs. Polepaka Praveen @ Pawan, adjudicated by the Hon’ble Supreme Court, provides insights into the retrospective effect of the POCSO Act.<\/p>\n<h4>Challenging the Retrospective Application<\/h4>\n<p>The state in this case advocated for the retrospective application of the 2019 amendment, arguing that despite the amendment&#8217;s prospective nature, it should be applied retrospectively in line with the Parliament&#8217;s intent. The state&#8217;s stance was based on the premise that the gravity of the crime warranted such application.<\/p>\n<h4>Supreme Court&#8217;s Response<\/h4>\n<p>The Hon’ble Supreme Court, in a succinct three-page order, dismissed the state&#8217;s argument. The Court&#8217;s decision emphasized the Act&#8217;s existing limitations and the principle of non-retrospective application. This decision aligns with constitutional safeguards and legal precedents.<\/p>\n<h4>Key Takeaways<\/h4>\n<p>The State of Telangana vs. Polepaka Praveen @ Pawan case serves as a reminder of the legal boundaries surrounding retrospective application of the POCSO Act. The Court&#8217;s decision reaffirms the importance of adhering to constitutional principles while interpreting and applying legislative amendments.<\/p>\n<h2><strong>Conclusion<\/strong><\/h2>\n<p>The discussion surrounding the retrospective effect of the POCSO Act underscores the complexity of legal interpretation and the balance between protecting children&#8217;s rights and upholding constitutional safeguards. The judicial response to the State of Telangana vs. Polepaka Praveen @ Pawan case offers valuable insights into the nuanced considerations guiding the application of legal amendments.<\/p>\n<p>The retrospective effect of the POCSO Act emerges as a transformative measure in the realm of child protection and justice. Through its application to cases predating its enactment, this provision bridges the gap between past injustices and present legal frameworks. By doing so, it offers a glimmer of hope to victims, allowing them to address long-held grievances and seek closure. Furthermore, the deterrence it instills in potential offenders is a testament to its efficacy in upholding the values of accountability and responsibility. However, it is essential to acknowledge the nuanced legal and ethical considerations that accompany this provision, particularly in terms of constitutional validity and the concept of the prescription of offenses. Nevertheless, the overriding goal of aligning with international standards and creating a more just society bolsters the importance of the retrospective effect.<\/p>\n<p>Despite the challenges and limitations, the act&#8217;s ability to transcend temporal boundaries signifies a significant step forward in the ongoing fight against child sexual abuse. As we move forward, it remains crucial to strike a delicate balance between justice, fairness, and the preservation of legal principles in order to truly realize the potential of the POCSO Act&#8217;s retrospective effect.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Introduction to the Protection of Children from Sexual Offences (POCSO) Act The Protection of Children from Sexual Offences (POCSO) Act was originally enacted in 2012 and was enforced on 14th November. It aims to provide comprehensive protection to children from sexual assault, sexual harassment, and pornography. It establishes a legal framework that prioritizes the well-being [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":1976,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,440],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Retrospective Effect POCSO Act<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Retrospective Effect POCSO Act\" \/>\n<meta property=\"og:description\" content=\"Introduction to the Protection of Children from Sexual Offences (POCSO) Act The Protection of Children from Sexual Offences (POCSO) Act was originally enacted in 2012 and was enforced on 14th November. It aims to provide comprehensive protection to children from sexual assault, sexual harassment, and pornography. It establishes a legal framework that prioritizes the well-being [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-09T06:56:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-09T07:03:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09064932\/Retrospective-Effect-POCSO-Act.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Retrospective Effect POCSO Act\",\"datePublished\":\"2023-08-09T06:56:54+00:00\",\"dateModified\":\"2023-08-09T07:03:16+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\"},\"wordCount\":1796,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Protection of Children from Sexual Offences (POCSO) Act\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\",\"url\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\",\"name\":\"Retrospective Effect POCSO Act\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-09T06:56:54+00:00\",\"dateModified\":\"2023-08-09T07:03:16+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Retrospective Effect POCSO Act\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Retrospective Effect POCSO Act","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/","og_locale":"en_US","og_type":"article","og_title":"Retrospective Effect POCSO Act","og_description":"Introduction to the Protection of Children from Sexual Offences (POCSO) Act The Protection of Children from Sexual Offences (POCSO) Act was originally enacted in 2012 and was enforced on 14th November. It aims to provide comprehensive protection to children from sexual assault, sexual harassment, and pornography. It establishes a legal framework that prioritizes the well-being [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-09T06:56:54+00:00","article_modified_time":"2023-08-09T07:03:16+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09064932\/Retrospective-Effect-POCSO-Act.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Retrospective Effect POCSO Act","datePublished":"2023-08-09T06:56:54+00:00","dateModified":"2023-08-09T07:03:16+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/"},"wordCount":1796,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Protection of Children from Sexual Offences (POCSO) Act"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/","url":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/","name":"Retrospective Effect POCSO Act","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-09T06:56:54+00:00","dateModified":"2023-08-09T07:03:16+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/retrospective-effect-pocso-act\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Retrospective Effect POCSO Act"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1975"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=1975"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/1975\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/1976"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=1975"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=1975"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=1975"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}