{"id":2021,"date":"2023-08-10T12:41:39","date_gmt":"2023-08-10T12:41:39","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2021"},"modified":"2023-08-10T12:41:39","modified_gmt":"2023-08-10T12:41:39","slug":"legal-requirements-to-be-fulfilled-by-a-startup-in-india","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/","title":{"rendered":"Legal requirements to be fulfilled by a startup in India"},"content":{"rendered":"<p>Starting a business is an exciting venture that brings forth numerous opportunities for growth and innovation. In India, with the emergence of a vibrant startup ecosystem, there has been a surge in entrepreneurial activities. However, amidst the enthusiasm, entrepreneurs must navigate through a complex web of legal requirements to establish their startups on a solid legal foundation. From choosing the right business structure to adhering to tax and compliance regulations, understanding and fulfilling these legal obligations is paramount for the success and sustainability of startups.<\/p>\n<h2><strong>1. Choosing the Right Business Structure<\/strong><\/h2>\n<p>The legal structure of a startup is crucial as it determines the level of liability, taxation, and management control. Various forms of business structures exist in India, including Private Limited Companies, Limited Liability Partnerships (LLPs), Partnership Firms, and Sole Proprietorships.<\/p>\n<h3>Private Limited Companies<\/h3>\n<p>This structure offers limited liability protection to its shareholders, separating personal assets from business liabilities. The process involves registering the company with the Ministry of Corporate Affairs (MCA) and adhering to the Companies Act. It requires a minimum of two directors and shareholders.<\/p>\n<h3>Limited Liability Partnership (LLP)<\/h3>\n<p>Combining the features of a partnership firm and a company, an LLP provides limited liability protection to its partners. It requires a formal LLP agreement and registration with the MCA.<\/p>\n<h3>Partnership Firms<\/h3>\n<p>These are businesses owned and operated by two or more partners, where personal assets are not separated from business liabilities. A partnership deed defines the terms and conditions of the partnership.<\/p>\n<h3>Sole Proprietorship<\/h3>\n<p>In this form, a single individual owns and operates the business, being solely responsible for its liabilities.<\/p>\n<h2><strong>2. Incorporation and Registration<\/strong><\/h2>\n<p>For startups, legal recognition is vital. Incorporation involves registering the business entity with the appropriate government authorities. The process includes obtaining a Certificate of Incorporation (for companies) or registration (for LLPs and partnerships). A registered office must also be established within India, serving as the official address for all communication.<\/p>\n<p>In India, startups must also comply with the Companies Act, 2013 and other applicable laws. For instance, businesses must obtain approval from the Reserve Bank of India (RBI) if they deal with foreign exchange transactions or transactions involving foreign companies or individuals. Similarly, businesses dealing with import and export activities must obtain an Importer Exporter Code (IEC) number from the Directorate General of Foreign Trade (DGFT).<\/p>\n<h2><strong>3. Share Capital and Ownership<\/strong><\/h2>\n<p>In the case of private limited companies, the ownership is divided into shares. These shares represent the ownership interest of individuals or entities in the company. The authorized share capital fee and the issuance of equity share capital need to be accurately defined and adhered to, as these aspects affect ownership and control. In addition, startups must also comply with the Minimum Alternate Tax (MAT).<\/p>\n<p>Taxability of a business entity is determined by its legal structure. Companies are liable to pay corporate tax, while LLPs, partnerships, and sole proprietorships are subject to income tax. In addition to income tax, companies must pay dividend distribution tax on any profits distributed as dividends among shareholders. Other taxes include wealth tax and service tax.<\/p>\n<p>Startups may also be eligible for certain government incentives such as exemption from capital gains taxes and lower rates for corporate taxes. It is advisable to seek professional advice in matters related to taxation.<\/p>\n<p>Also, businesses must adhere to various compliance requirements such as filing quarterly returns with the Income Tax Department and obtaining necessary permits or licenses for carrying out specific activities. Failure to comply with these requirements could result in financial penalties or other sanctions imposed by the authorities.<\/p>\n<p>It is essential for entrepreneurs to understand the legal framework surrounding their startups in India. This includes choosing an appropriate business structure that best suits the purpose of the startup and adhering to all applicable laws and regulations pertaining to taxation, ownership, capitalization, compliance, and more. Professional advice can be sought in complex matters such as taxation or foreign exchange transactions. A thorough understanding of applicable laws can help ensure a solid legal foundation upon which great businesses are built.<\/p>\n<h2><strong>4. Intellectual Property Rights<\/strong><\/h2>\n<p>Startups often hinge on innovative products or services, and protecting their intellectual property (IP) is critical. Obtaining patents, trademarks, copyrights, or trade secrets can prevent unauthorized use or imitation, safeguarding the startup&#8217;s unique value proposition. Moreover, when entering into contracts with third parties, startups must ensure that the terms of the agreement are in compliance with IP laws and do not compromise their IP rights. Startups can also benefit from registering a domain name to protect their online presence.<\/p>\n<p>Data Protection<\/p>\n<p>Data protection is an important consideration for startups, especially those dealing with sensitive customer information. The Right to Information Act (RTI) and the Personal Data Protection Bill (PDPB) are two laws that regulate the collection, storage, and use of personal data. Companies must ensure compliance with these laws by establishing appropriate security measures to protect customer data from unauthorized access or misuse.<\/p>\n<h2><strong>5. Compliance with Taxation and Regulatory Norms<\/strong><\/h2>\n<h3>Tax Exemptions<\/h3>\n<p>The Indian government, under the Startup India initiative, offers tax exemptions for eligible startups for a certain period. Understanding the eligibility criteria and availing these exemptions can significantly ease the financial burden.<\/p>\n<h3>Annual Returns and Tax Returns<\/h3>\n<p>Regular filing of annual returns with the MCA and income tax returns with the Income Tax Department is mandatory for all business structures. Adhering to these compliances ensures that the startup maintains its legal status and avails necessary benefits.<\/p>\n<h3>Goods and Services Tax (GST)<\/h3>\n<p>If the startup&#8217;s turnover crosses the prescribed threshold, registering for GST is obligatory. Proper GST compliance is vital to avoid penalties.<\/p>\n<h3>Service Tax<\/h3>\n<p>For businesses providing services, adherence to service tax regulations is essential. The tax must be collected and remitted to the government within the stipulated time period.<\/p>\n<h3>Insurance Policies<\/h3>\n<p>Startups should consider obtaining insurance coverage, including Professional Liability Insurance and Omissions Insurance. These policies protect against potential legal claims arising from errors or omissions in providing services.<\/p>\n<h3>Compliance with SEBI Regulations<\/h3>\n<p>If the startup plans to go public and list on the stock exchange, it must comply with the Securities and Exchange Board of India (SEBI) regulations. This involves drafting an Offer Document, Red Herring Prospectus, and Information Document, and adhering to reporting requirements.<\/p>\n<h3>Filing and Reporting Requirements<\/h3>\n<p>Startups must comply with various reporting requirements as per the Companies Act and other applicable laws. Regular filings with the MCA and other regulatory bodies are essential to maintain active status.<\/p>\n<h2><strong>6. Intellectual Property Protection and Non-Disclosure Agreements<\/strong><\/h2>\n<p>Innovation is at the heart of startups, and protecting their intellectual property is vital. Non-Disclosure Agreements (NDAs) play a crucial role in safeguarding confidential information when sharing it with potential partners, investors, or employees. So, it is important for startups to understand their legal requirements and ensure compliance at all stages of the business. This article discussed the various laws that startups must adhere to, such as data protection laws, taxation and regulatory norms, intellectual property protection, and filing and reporting requirements.<\/p>\n<h2><strong>7. Legal Documentation and Agreements<\/strong><\/h2>\n<p>Startups require various legal documents, including shareholder agreements, operating agreements, and partnership deeds. These documents define the roles, responsibilities, and relationships between stakeholders and provide clarity during disputes or challenges. Accordingly , it is important for the startup to understand the need for these agreements and ensure that they are properly drafted. Additionally, startups must carefully review other types of contracts such as lease agreements, vendor agreements, and investor agreements before signing them.<\/p>\n<p>Good corporate governance practices are essential for startups, as they help ensure that the company adheres to legal and ethical standards. This involves implementing systems to monitor key performance metrics, establish accountability for all stakeholders, and promote transparency in operations. The board of directors must also take steps to ensure compliance with applicable laws and regulations such as the Companies Act, SEBI regulations, and GST.<\/p>\n<h2><strong>8. Board of Directors and Management Structure<\/strong><\/h2>\n<p>Private Limited Companies are required to have a Board of Directors. This board oversees the company&#8217;s operations and strategic decisions. Defining the roles and responsibilities of directors is crucial for effective governance. In addition, startups must also establish a management structure that appoints individuals to carry out the day-to-day operations and sets up reporting lines between various divisions. All in all, startups should be aware of the various legal requirements that must be complied with at each stage. Consulting with a lawyer can help startups ensure compliance and protect their interests.<\/p>\n<p>Startups should consider implementing investor protection mechanisms to ensure that their interests are safeguarded. This includes providing investors with periodic updates and financial statements, as well as allowing them to participate in company decisions. Additionally, startups should also consider offering rights of first refusal to existing shareholders and making disclosures related to any changes in the company’s ownership structure. These measures help protect investor interests, as well as ensure compliance with applicable laws.<\/p>\n<h2><strong>9. Funding and Investor Agreements<\/strong><\/h2>\n<p>For startups seeking funding, investor agreements outline the terms of investment, ownership stakes, and exit options. These agreements protect both the startup and the investors, ensuring transparency and accountability. In short, startups should carefully review all investor-related documents and consult with a lawyer to determine the legality of these agreements. Additionally, they should ensure that they are compliant with applicable laws related to fundraising activities such as the Companies Act, 2013 and the SEBI (Issue of Capital and Disclosure Requirements) Regulations, 2018.<\/p>\n<p>Startups are subject to a wide range of laws and regulations, including those related to taxation, labor environment, health and safety, and consumer protection. Each state in India has its own set of laws that may apply depending on the nature of the business. For instance, companies involved in manufacturing or trading activities may need to register for VAT<\/p>\n<h2><strong>10. Startup India Recognition and Benefits<\/strong><\/h2>\n<p>Startups meeting the eligibility criteria can obtain recognition from the Startup India initiative. This recognition provides various benefits, including tax exemptions, faster patent processing, and access to government schemes. Furthermore, recognized startups may also receive funding from venture capitalists or the government. To qualify for recognition, startups must submit an application containing details such as the company’s business model and address proof. Additionally, startups must provide documents such as the memorandum of association, articles of association, and PAN card details. Startups that are accepted into the program will receive a certificate of recognition from the Department for Promotion of Industry and Internal Trade (DPIIT).<\/p>\n<p>For startups to succeed, it is important to hire the right talent and manage them effectively. Companies should create employee policies that cover topics such as leave, working hours, job descriptions, and remuneration. These policies should adhere to applicable labor laws such as the Industrial Disputes Act 1947, Minimum Wages Act 1948, Employees&#8217; Provident<\/p>\n<h2><strong>11. Exit Strategy and Long-Term Planning<\/strong><\/h2>\n<p>While startup founders often focus on growth, having an exit strategy is equally important. Whether through mergers, acquisitions, or Initial Public Offerings (IPOs), a well-defined exit plan ensures a smooth transition and wealth creation. In addition, startups should plan for the long term by preparing projections and strategies to manage future growth. Investing in resources such as market research, financial planning, and legal advice can help startups identify potential regulatory risks, maximize returns, and ensure compliance with applicable laws.<\/p>\n<p>Startups should also strive to protect their intellectual property (IP) rights in order to prevent infringement and ensure that the value of the startup is not compromised. This includes registering trademarks, copyrights, and patents for any products or services created by the startup. Startups should be aware of applicable laws such as the Copyright Act 1957 and the Trade Marks Act<\/p>\n<h2>Conclusion<\/h2>\n<p>In conclusion, navigating the legal landscape is a critical aspect of establishing a startup in India. While the process may seem daunting, seeking legal expertise and adhering to the required formalities are essential steps toward building a successful and legally compliant business. By understanding and fulfilling these legal obligations, startups can operate with confidence, attract potential investors, and achieve sustained growth in the dynamic Indian business environment.<\/p>\n<p>It is advisable to have proper advice regarding the <a href=\"https:\/\/legal251.com\/consultancy\" target=\"_blank\" rel=\"noopener\">legal compliances<\/a>, before starting a startup. For online <a href=\"https:\/\/legal251.com\/consultancy\" target=\"_blank\" rel=\"noopener\">legal advice<\/a>, please contact <a href=\"https:\/\/legal251.com\/\" target=\"_blank\" rel=\"noopener\">Legal251 <\/a>on toll-free no.- (+91) 77728-77729 or download the <a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\">Legal251 mobile app<\/a> now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Starting a business is an exciting venture that brings forth numerous opportunities for growth and innovation. In India, with the emergence of a vibrant startup ecosystem, there has been a surge in entrepreneurial activities. However, amidst the enthusiasm, entrepreneurs must navigate through a complex web of legal requirements to establish their startups on a solid [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2022,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,444],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Legal requirements to be fulfilled by a startup in India<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Legal requirements to be fulfilled by a startup in India\" \/>\n<meta property=\"og:description\" content=\"Starting a business is an exciting venture that brings forth numerous opportunities for growth and innovation. In India, with the emergence of a vibrant startup ecosystem, there has been a surge in entrepreneurial activities. However, amidst the enthusiasm, entrepreneurs must navigate through a complex web of legal requirements to establish their startups on a solid [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-10T12:41:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/10124023\/Legal-requirements-to-be-fulfilled-by-a-startup-in-India.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Legal requirements to be fulfilled by a startup in India\",\"datePublished\":\"2023-08-10T12:41:39+00:00\",\"dateModified\":\"2023-08-10T12:41:39+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\"},\"wordCount\":2026,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Startup in India\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\",\"url\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\",\"name\":\"Legal requirements to be fulfilled by a startup in India\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-10T12:41:39+00:00\",\"dateModified\":\"2023-08-10T12:41:39+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Legal requirements to be fulfilled by a startup in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Legal requirements to be fulfilled by a startup in India","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Legal requirements to be fulfilled by a startup in India","og_description":"Starting a business is an exciting venture that brings forth numerous opportunities for growth and innovation. In India, with the emergence of a vibrant startup ecosystem, there has been a surge in entrepreneurial activities. However, amidst the enthusiasm, entrepreneurs must navigate through a complex web of legal requirements to establish their startups on a solid [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-10T12:41:39+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/10124023\/Legal-requirements-to-be-fulfilled-by-a-startup-in-India.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Legal requirements to be fulfilled by a startup in India","datePublished":"2023-08-10T12:41:39+00:00","dateModified":"2023-08-10T12:41:39+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/"},"wordCount":2026,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Startup in India"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/","url":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/","name":"Legal requirements to be fulfilled by a startup in India","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-10T12:41:39+00:00","dateModified":"2023-08-10T12:41:39+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/legal-requirements-to-be-fulfilled-by-a-startup-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Legal requirements to be fulfilled by a startup in India"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2021"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2021"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2021\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2022"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2021"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2021"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2021"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}