{"id":2087,"date":"2023-08-17T08:42:43","date_gmt":"2023-08-17T08:42:43","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2087"},"modified":"2023-08-17T08:42:43","modified_gmt":"2023-08-17T08:42:43","slug":"import-export-license-iec-all-you-need-to-know","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/","title":{"rendered":"Import Export License (IEC) &#8211; All you need to know"},"content":{"rendered":"<div id=\"text-body\">\n<p>The world of international trade offers a plethora of opportunities for businesses to expand their horizons and tap into global markets. To embark on this exciting journey, one of the fundamental requirements is the Importer-Exporter Code (IEC), commonly known as the Import Export License. This 10-digit alpha-numeric code serves as a key business identification number for entities engaged in cross-border trade. In this article, we will delve into the essential aspects of obtaining an IEC, from the application process to its significance in facilitating seamless import and export transactions.<\/p>\n<h3><strong>Pre-Requisites for IEC Registration<\/strong><\/h3>\n<p>Before delving into the application process, it&#8217;s crucial to understand the prerequisites for IEC registration. These include:<\/p>\n<p><strong>Business Entity<\/strong><\/p>\n<p>To be eligible for an IEC, you must be a legally recognized business entity. This can range from a sole proprietorship to a partnership firm, a limited liability partnership, or even a corporate entity.<\/p>\n<p><strong>Address Proof<\/strong><\/p>\n<p>A valid address proof is essential to establish the identity and location of your business. This can be in the form of a rent agreement, ownership proof, or other acceptable documents.<\/p>\n<p><strong>Permanent Validity<\/strong><\/p>\n<p>Once obtained, the IEC has lifetime validity, eliminating the need for renewal.<\/p>\n<h2><strong>Importance<\/strong><\/h2>\n<p>The Import Export Code (IEC) holds significant importance for individuals and businesses engaged in import and export activities in India. Here are some key reasons why the IEC is important:<\/p>\n<h4><strong>Legal Requirement<\/strong><\/h4>\n<p>The IEC is a legal requirement as per the Foreign Trade Policy of India. Without an IEC, you cannot engage in import\/export transactions in the country.<\/p>\n<h4><strong>Identification and Tracking<\/strong><\/h4>\n<p>The IEC serves as a unique identification number for importers and exporters. It helps customs authorities and other regulatory agencies track and monitor international trade transactions, ensuring compliance with laws and regulations.<\/p>\n<h4><strong>Global Trade Opportunities<\/strong><\/h4>\n<p>An IEC opens up opportunities for businesses to participate in global trade. It enables you to import goods from other countries for sale in India or export goods to international markets, expanding your customer base and potential revenue streams.<\/p>\n<h4><strong>Access to Benefits and Incentives<\/strong><\/h4>\n<p>Several benefits and incentives are available to registered importers and exporters in India. These include various export promotion schemes, duty drawbacks, exemptions, and concessions. Having an IEC is a prerequisite to avail of these benefits.<\/p>\n<h4><strong>Building Credibility and Trust<\/strong><\/h4>\n<p>An IEC enhances your credibility and trustworthiness as a legitimate importer or exporter. It signifies that you comply with the legal requirements, maintain proper documentation, and follow the prescribed procedures for international trade.<\/p>\n<h4><strong>Opening Bank Accounts<\/strong><\/h4>\n<p>Most banks in India require an IEC as a prerequisite for opening an account for import\/export-related transactions. The IEC establishes your legitimacy and facilitates smooth banking operations for international trade activities.<\/p>\n<h4><strong>Participation in Trade Associations<\/strong><\/h4>\n<p>Trade associations and chambers of commerce often require an IEC for membership. Being a part of these associations provides networking opportunities, access to industry knowledge, and a platform for advocacy and representation.<\/p>\n<h4><strong>Enabling Easier Customs Clearance<\/strong><\/h4>\n<p>The IEC simplifies the customs clearance process by streamlining documentation and facilitating electronic communication with customs authorities. It helps expedite the movement of goods across borders, reducing delays and operational costs.<\/p>\n<h4><strong>Expanding Business Opportunities<\/strong><\/h4>\n<p>With an IEC, you can explore a wider range of suppliers and markets worldwide. It allows you to source quality products at competitive prices from international suppliers or reach out to global buyers to sell your products or services.<\/p>\n<h4><strong>Compliance and Risk Management<\/strong><\/h4>\n<p>Obtaining an IEC ensures compliance with import\/export laws and regulations, reducing the risk of penalties, fines, or legal issues. It also helps you stay updated with changing trade policies and adapt to evolving international trade scenarios.<\/p>\n<h2><strong>Features of IEC in India<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-1995 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103704\/Features-and-Importance-of-IEC-in-India-300x169.jpg\" alt=\"Features and Importance of IEC in India\" width=\"937\" height=\"528\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103704\/Features-and-Importance-of-IEC-in-India-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103704\/Features-and-Importance-of-IEC-in-India-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103704\/Features-and-Importance-of-IEC-in-India-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103704\/Features-and-Importance-of-IEC-in-India-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103704\/Features-and-Importance-of-IEC-in-India.jpg 1920w\" sizes=\"(max-width: 937px) 100vw, 937px\" \/><\/a><\/p>\n<p>The Importer-Exporter Code (IEC) is a vital component of India&#8217;s international trade ecosystem, offering numerous features and benefits that facilitate smooth export and import operations. Let&#8217;s delve into its features and understand its significance for businesses engaged in global trade.<\/p>\n<h3>Export Promotion Council<\/h3>\n<p>IEC serves as a gateway to collaboration with Export Promotion Councils, enabling businesses to tap into specialized expertise and guidance tailored to their specific export products and markets.<\/p>\n<h3>Facilitation for Service Providers<\/h3>\n<p>IEC isn&#8217;t limited to tangible goods alone. Service providers also require IEC to engage in cross-border service transactions, extending its applicability beyond traditional products.<\/p>\n<h3>Streamlined Documentation<\/h3>\n<p>With IEC, businesses can swiftly execute export transactions as it simplifies documentation procedures by serving as a common reference point.<\/p>\n<h3>International Market Access<\/h3>\n<p>IEC empowers businesses to explore and enter international markets, broadening their horizons and contributing to increased revenue potential.<\/p>\n<h3>Partnership Firms Included<\/h3>\n<p>Both individual entrepreneurs and partnership firms can obtain IEC, making it accessible to various business structures.<\/p>\n<h3>Certificate of Origin<\/h3>\n<p>IEC aids in obtaining the Certificate of Origin, a critical document validating the source of exported goods, which is often required for preferential tariff treatment in various trade agreements.<\/p>\n<h3>Speed Post Usage<\/h3>\n<p>The IEC application process involves utilizing Speed Post for onward transmission of documents, ensuring secure and timely delivery.<\/p>\n<h3>Collaboration with Banks<\/h3>\n<p>IEC mandates that current bank accounts are linked, enhancing transparency and facilitating seamless payment processes for export transactions.<\/p>\n<h3>Permanent Validity<\/h3>\n<p>Once granted, IEC has lifetime validity, eliminating the need for frequent renewals and ensuring consistent access to international trade avenues.<\/p>\n<h3>Digital Signature Integration<\/h3>\n<p>IEC applications can be digitally signed, further streamlining the process and enhancing security measures.<\/p>\n<h3>Document Standardization<\/h3>\n<p>IEC aids in ensuring uniformity in document types and format, reducing discrepancies and potential delays in customs clearance.<\/p>\n<h3>Compliance Assistance<\/h3>\n<p>IEC encourages adherence to business compliances, including customs regulations, direct tax compliance, and secretarial compliance.<\/p>\n<h3>Access to Government Initiatives<\/h3>\n<p>It opens doors to government schemes and initiatives aimed at fostering trade and export activities, providing businesses with financial support and incentives.<\/p>\n<h3>Export Costing Benefits<\/h3>\n<p>IEC facilitates accurate export costing through the provision of an export costing sheet, ensuring that businesses are well-prepared for international trade ventures.<\/p>\n<h3>Regular Updates<\/h3>\n<p>IEC holders benefit from updates in the Foreign Trade Policy and other policy circulars issued by the Directorate General of Foreign Trade.<\/p>\n<h3>Direct Interaction with Authorities<\/h3>\n<p>Businesses can directly interact with customs officials, regional authorities, and relevant government bodies due to the official recognition provided by the IEC.<\/p>\n<h3>Document Submission<\/h3>\n<p>IEC simplifies the process of submitting documents to overseas buyers, aiding in the smooth execution of export transactions.<\/p>\n<h3>Single Consignment Facility<\/h3>\n<p>IEC allows businesses to export a single consignment without the need for recurring permissions, speeding up the export process.<\/p>\n<p>The IEC plays an indispensable role in the success of India&#8217;s international trade endeavors. It empowers businesses with the necessary authorization, documentation standardization, and access to crucial government schemes, ultimately bolstering the growth and prosperity of businesses engaged in global trade operations. This step-by-step guide to obtaining an IEC code ensures that businesses can seamlessly navigate the intricacies of international trade.<\/p>\n<h2><strong>Registration Process of IEC<\/strong><\/h2>\n<p>The process of obtaining an IEC involves several steps:<\/p>\n<p><strong>Access the DGFT Portal<\/strong><\/p>\n<p>The Directorate General of Foreign Trade (DGFT) website is the gateway to IEC registration. Visit the portal and navigate to the IEC section.<\/p>\n<p><strong>Filling the Form<\/strong><\/p>\n<p>Fill out the online application form, known as &#8220;Aayaat Niryaat Form ANF-2A,&#8221; in the prescribed format.<\/p>\n<p><strong>Provide Details<\/strong><\/p>\n<p>Furnish relevant details, including business entity type, director\/partner details, address proof, bank account details, and more.<\/p>\n<p><strong>Attach Documents<\/strong><\/p>\n<p>Scan and attach the required documents, such as address proof, partnership deed (if applicable), bank account statement, and other additional documents as needed.<\/p>\n<p><strong>Digital Signature<\/strong><\/p>\n<p>Complete the application by providing digital signature details for authentication.<\/p>\n<p><strong>Payment<\/strong><\/p>\n<p>Pay the IEC code application fees through online payment methods such as debit cards, credit cards, or foreign currency payments.<\/p>\n<p><strong>Submission<\/strong><\/p>\n<p>Submit the application form along with the necessary documents.<\/p>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-1994 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103613\/Steps-involved-to-Obtain-an-IEC-in-India-300x169.jpg\" alt=\"Steps involved to Obtain an IEC in India\" width=\"859\" height=\"484\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103613\/Steps-involved-to-Obtain-an-IEC-in-India-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103613\/Steps-involved-to-Obtain-an-IEC-in-India-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103613\/Steps-involved-to-Obtain-an-IEC-in-India-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103613\/Steps-involved-to-Obtain-an-IEC-in-India-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/09103613\/Steps-involved-to-Obtain-an-IEC-in-India.jpg 1920w\" sizes=\"(max-width: 859px) 100vw, 859px\" \/><\/a><\/p>\n<h3>Step 1: Understand the Basics<\/h3>\n<p>Before you begin, familiarize yourself with the terms such as IEC Code (Importer-Exporter Code) and its significance in international trade. The IEC code is a 10-digit unique number that is mandatory for all business entities involved in import-export activities.<\/p>\n<p>Obtain the &#8216;Aayaat Niryaat Form &#8211; ANF2A&#8217; in the prescribed format. This form is available online and is the official application form for the IEC code.<\/p>\n<p>Fill out the &#8216;Aayaat Niryaat Form &#8211; ANF2A&#8217; with accurate and complete details of your business entity, including applicant details, business identification number, bank details, and other relevant information.<\/p>\n<p>Attach mandatory documents such as address proofs, bank account certificates from the authorized bank, passport-size photographs, and any other requisite documents as specified in the form.<\/p>\n<h3>Step 2: Complete the Application<\/h3>\n<p>Check that your application is complete and accurate. Incomplete applications may lead to delays or rejection.<\/p>\n<p>Ensure that the details provided in the application form match the details in your supporting documents.<\/p>\n<h3>Step 3: Payment of Application Fee<\/h3>\n<p>Pay the application fee through the designated payment methods, such as debit card, credit card, or net banking.<\/p>\n<h3>Step 4: Submit Your Application<\/h3>\n<p>Submit your completed application form, along with all necessary documents and the payment receipt, either online through the IEC Online Application portal or by post to the Regional Authority of the Directorate General of Foreign Trade.<\/p>\n<h3>Step 5: Application Processing and Verification<\/h3>\n<p>The Directorate General of Foreign Trade will process your application and verify the provided details.<\/p>\n<h3>Step 6: Issuance of IEC Code<\/h3>\n<p>Upon successful verification, the Directorate General of Foreign Trade will issue your IEC code, which is a 10-digit code unique to your business entity.<\/p>\n<h3>Step 7: Post-Issuance Steps<\/h3>\n<p>Make sure to update your IEC profile management with any changes in business details for successful updation.<\/p>\n<p>For future business transactions, use your IEC code on documents such as the Commercial Invoice cum Packing List, shipping bills, and other relevant documents.<\/p>\n<h3>Important Tips:<\/h3>\n<ul>\n<li>The IEC code has lifetime validity, and there is no need for renewal.<\/li>\n<li>Keep a copy of your IEC code and related documents for your records.<\/li>\n<li>Seek professional advice if needed, especially if you&#8217;re dealing with complex trade scenarios.<\/li>\n<li>Stay updated with changes in the Foreign Trade Policy issued by Government departments and bodies.<\/li>\n<li>Use your IEC code for both import and export purposes and ensure the proper realization of export proceeds.<\/li>\n<\/ul>\n<p>By following these steps and tips, you can successfully obtain your IEC code and venture into the world of international trade. Remember that the IEC code is a crucial component of your import-export business, enabling you to engage with overseas markets and expand your trade operations seamlessly.<\/p>\n<h2><strong>IEC Profile Management<\/strong><\/h2>\n<p>Once you have your IEC, it&#8217;s essential to manage your profile regularly:<\/p>\n<p><strong>Update Details<\/strong><\/p>\n<p>Keep your IEC profile updated with any changes in business information, address, or contact details.<\/p>\n<p><strong>Annual Filing<\/strong><\/p>\n<p>Ensure timely filing of returns and compliance documents, including GST filing and annual reports.<\/p>\n<p><strong>Access Export Promotion Councils<\/strong><\/p>\n<p>Leverage your IEC to gain membership in Export Promotion Councils related to your product category, providing networking and growth opportunities.<\/p>\n<h2><strong>Additional Benefits and Conclusion<\/strong><\/h2>\n<p>Apart from the primary function of facilitating import-export transactions, an IEC opens doors to additional benefits:<\/p>\n<p><strong>Cross-Border Financial Services<\/strong><\/p>\n<p>Many foreign banks require an IEC for cross-border financial transactions.<\/p>\n<p><strong>Customs Duty Exemption<\/strong><\/p>\n<p>An IEC can lead to customs duty exemption for certain products and markets.<\/p>\n<p><strong>Lifetime Validity<\/strong><\/p>\n<p>The IEC has lifetime validity, eliminating the need for frequent renewals.<\/p>\n<p>In conclusion, the Importer-Exporter Code (IEC) is an indispensable tool for businesses venturing into the realm of international trade. Its significance in ensuring seamless customs clearance, compliance with regulations, and access to government schemes cannot be overstated. By following the prescribed procedures and understanding the essentials of IEC registration, businesses can pave the way for successful cross-border endeavors and contribute to their overall growth and prosperity.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The world of international trade offers a plethora of opportunities for businesses to expand their horizons and tap into global markets. To embark on this exciting journey, one of the fundamental requirements is the Importer-Exporter Code (IEC), commonly known as the Import Export License. This 10-digit alpha-numeric code serves as a key business identification number [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2088,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,442],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Import Export License (IEC) - All you need to know<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Import Export License (IEC) - All you need to know\" \/>\n<meta property=\"og:description\" content=\"The world of international trade offers a plethora of opportunities for businesses to expand their horizons and tap into global markets. To embark on this exciting journey, one of the fundamental requirements is the Importer-Exporter Code (IEC), commonly known as the Import Export License. This 10-digit alpha-numeric code serves as a key business identification number [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-17T08:42:43+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/17083855\/Import-Export-License-IEC-All-you-need-to-know.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Import Export License (IEC) &#8211; All you need to know\",\"datePublished\":\"2023-08-17T08:42:43+00:00\",\"dateModified\":\"2023-08-17T08:42:43+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\"},\"wordCount\":1919,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Import-Export Code (IEC)\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\",\"url\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\",\"name\":\"Import Export License (IEC) - All you need to know\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-17T08:42:43+00:00\",\"dateModified\":\"2023-08-17T08:42:43+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Import Export License (IEC) &#8211; All you need to know\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Import Export License (IEC) - All you need to know","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/","og_locale":"en_US","og_type":"article","og_title":"Import Export License (IEC) - All you need to know","og_description":"The world of international trade offers a plethora of opportunities for businesses to expand their horizons and tap into global markets. To embark on this exciting journey, one of the fundamental requirements is the Importer-Exporter Code (IEC), commonly known as the Import Export License. This 10-digit alpha-numeric code serves as a key business identification number [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-17T08:42:43+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/17083855\/Import-Export-License-IEC-All-you-need-to-know.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Import Export License (IEC) &#8211; All you need to know","datePublished":"2023-08-17T08:42:43+00:00","dateModified":"2023-08-17T08:42:43+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/"},"wordCount":1919,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Import-Export Code (IEC)"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/","url":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/","name":"Import Export License (IEC) - All you need to know","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-17T08:42:43+00:00","dateModified":"2023-08-17T08:42:43+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/import-export-license-iec-all-you-need-to-know\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Import Export License (IEC) &#8211; All you need to know"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2087"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2087"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2087\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2088"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2087"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2087"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2087"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}