{"id":2122,"date":"2023-08-18T10:15:56","date_gmt":"2023-08-18T10:15:56","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2122"},"modified":"2023-08-18T10:16:55","modified_gmt":"2023-08-18T10:16:55","slug":"no-objection-certificate-noc-what-it-is","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/","title":{"rendered":"No Objection Certificate (NOC) &#8211; What it is?"},"content":{"rendered":"<div id=\"text-body\">\n<p>In the realm of legal documents, the No-Objection Certificate (NOC) stands as a significant official document that finds application in a plethora of situations. From property transactions to vehicle ownership transfers, business deals to construction approvals, the NOC plays a pivotal role in easing various processes and ensuring smooth transitions. In this article, we will delve into the usage, importance, and drafting of the NOC, shedding light on its essential role across diverse scenarios.<\/p>\n<h2><strong>The NOC: A Brief Overview<\/strong><\/h2>\n<p>A No-Objection Certificate, commonly abbreviated as NOC, is a formal document issued by an authority, organization, or individual, declaring no objections to a particular action or transaction. It serves as an official letter of consent, indicating that the concerned party does not oppose the intended course of action.<\/p>\n<h2><strong>The Importance of the NOC<\/strong><\/h2>\n<p>The NOC holds immense importance due to its versatility and application across various domains. Let&#8217;s explore its significance in different contexts:<\/p>\n<h4>Property Transactions and Construction:<\/h4>\n<p>When it comes to property transactions, the NOC serves as a proof of consent from existing co-owners or legal heirs. It&#8217;s often required during the transfer of land, land registration, or sale of immovable property. Additionally, it plays a key role in the approval process for construction bylaws and development authorities, ensuring that the concerned authority grants permission without any objections.<\/p>\n<h4>Vehicle Ownership and Transfers:<\/h4>\n<p>For vehicle owners, the NOC acts as a crucial document during vehicle transfers, especially in interstate transactions. The NOC from the lending institution or bank holding the vehicle loan demonstrates that there are no outstanding loan dues. This certificate is essential for the new buyer to register the vehicle in their name. Similarly, commercial vehicle owners seeking to transfer ownership or change the vehicle&#8217;s registration location rely on the NOC for a hassle-free process.<\/p>\n<h4>Business Transactions and Approvals:<\/h4>\n<p>In the realm of business deals, the NOC is often required when transferring business ownership, altering the registered office address, or obtaining licenses. It also plays a role in obtaining approvals from various government authorities and developmental bodies, ensuring that the business complies with regulations.<\/p>\n<h4>Employment and Salary Transactions:<\/h4>\n<p>When an employee changes jobs, the new employer may require an NOC from the previous employer as part of the approval process. This NOC signifies that the employee left on good terms and clears any dues. Additionally, financial institutions might seek an NOC from an employer as part of the process of salary transactions or loan approvals.<\/p>\n<h2><strong>Drafting an NOC: Essential Elements<\/strong><\/h2>\n<p>A NOC typically contains the following components:<\/p>\n<h4>Basic Details:<\/h4>\n<p>The NOC should include the name, address, and contact details of both the issuing and receiving parties.<\/p>\n<h4>Description of Transaction:<\/h4>\n<p>Clearly state the purpose of the NOC, whether it&#8217;s related to property transfer, vehicle ownership, business deals, etc.<\/p>\n<h4>Acknowledgment of Consent:<\/h4>\n<p>Explicitly mention that the issuing party has no objections to the intended action or transaction.<\/p>\n<h4>Supporting Documents:<\/h4>\n<p>Reference any relevant documents such as proof of ownership, identity proofs, address proof, etc., depending on the nature of the transaction.<\/p>\n<h4>Date and Signatures:<\/h4>\n<p>The NOC should bear the date of issuance and be signed by authorized representatives.<\/p>\n<h2><strong>Types of No Objection Certificates<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2124 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101228\/Types-of-No-Objection-Certificates-300x169.jpg\" alt=\"Types of No Objection Certificates\" width=\"905\" height=\"510\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101228\/Types-of-No-Objection-Certificates-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101228\/Types-of-No-Objection-Certificates-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101228\/Types-of-No-Objection-Certificates-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101228\/Types-of-No-Objection-Certificates-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101228\/Types-of-No-Objection-Certificates.jpg 1920w\" sizes=\"(max-width: 905px) 100vw, 905px\" \/><\/a><\/p>\n<p>There are several types of No Objection Certificates (NOCs) that are issued in different contexts and for various purposes. Here are some common types of NOCs:<\/p>\n<h4>Employment NOC:<\/h4>\n<p>This is issued by an employer to an employee who intends to change jobs or pursue other employment opportunities. It states that the employer has no objections to the employee&#8217;s decision and may include information about the employee&#8217;s tenure, performance, and any pending obligations.<\/p>\n<h4>Education NOC:<\/h4>\n<p>Educational institutions may issue NOCs to students who wish to transfer to another school or college. It confirms that the institution has no objections to the student&#8217;s transfer and may include details about the student&#8217;s academic performance.<\/p>\n<h4>Property\/Real Estate NOC:<\/h4>\n<p>When selling, leasing, or transferring property, a property owner may obtain a NOC from relevant authorities or neighbors. It states that there are no objections to the transaction and may include information about property disputes, pending dues, or other legal matters.<\/p>\n<h4>Vehicle Transfer NOC:<\/h4>\n<p>When selling a vehicle to someone in a different state or jurisdiction, the seller may obtain a NOC from the local Regional Transportation Office (RTO). This document confirms that there are no outstanding traffic offenses or financial liabilities associated with the vehicle.<\/p>\n<h4>Travel\/Immigration NOC:<\/h4>\n<p>Individuals applying for certain visas or permits may require an NOC from their home country or employer. It indicates that there are no objections to their travel or stay abroad and may include details about their employment, purpose of travel, and duration of stay.<\/p>\n<h4>Event\/Function NOC:<\/h4>\n<p>For organizing events, functions, or gatherings, organizers may need to obtain NOCs from local authorities, police, or relevant departments. This ensures that there are no objections to holding the event and may involve compliance with safety regulations, noise restrictions, etc.<\/p>\n<h2><strong>Frequently Asked Questions (FAQs) &#8211; No Objection Certificate (NOC)<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2030 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/11091254\/FAQ-300x169.jpg\" alt=\"FAQ\" width=\"905\" height=\"510\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/11091254\/FAQ-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/11091254\/FAQ-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/11091254\/FAQ-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/11091254\/FAQ-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/11091254\/FAQ.jpg 1920w\" sizes=\"(max-width: 905px) 100vw, 905px\" \/><\/a><\/p>\n<h4>What is a No Objection Certificate (NOC)?<\/h4>\n<p>A No Objection Certificate (NOC) is an official document issued by a relevant authority indicating their lack of objections or concerns regarding a specific matter, often required for various legal and administrative purposes.<\/p>\n<h4>Which documents are required when applying for a NOC?<\/h4>\n<p>The essential documents include the filled-out application form, insurance certificate, registration certificate, fitness certificate, legal certificate, proof of address, proof of identity, lease documents (if applicable), and other relevant documents.<\/p>\n<h4>How long does it take to process a NOC request?<\/h4>\n<p>The processing time for a NOC request varies, but it usually takes around [X] business days for the concerned authority to review and approve the application.<\/p>\n<h4>Who provides the authority for construction in the context of a NOC?<\/h4>\n<p>The authority for construction approval is typically granted by the local developmental authority or relevant government department.<\/p>\n<h4>Do I need a police authority&#8217;s approval for a NOC?<\/h4>\n<p>Police authority approval might be necessary in certain cases, especially when the NOC pertains to activities that involve public safety or security.<\/p>\n<h4>What is the refund process for NOC applications that are not approved?<\/h4>\n<p>If a NOC application is not approved, you may follow the specified refund process outlined by the issuing authority. Contact them directly for further guidance.<\/p>\n<h4>Is an acknowledgment receipt provided upon submission of the NOC application?<\/h4>\n<p>Yes, upon submitting your NOC application, you should receive an acknowledgement receipt as proof of submission.<\/p>\n<h4>What is the purpose of the initial road tax mentioned in the NOC documents?<\/h4>\n<p>The initial road tax is a one-time payment made for registering a vehicle in a particular region. It might be relevant when obtaining an NOC for a vehicle transfer.<\/p>\n<h4>What is a Non-Utilisation Certificate, and when is it required?<\/h4>\n<p>A Non-Utilisation Certificate is a document that confirms the non-utilization of a particular asset or property. It may be required for certain legal or administrative purposes.<\/p>\n<h4>What are Emission Test, Occupancy, and Pollution Under Control Certificates?<\/h4>\n<ul>\n<li>Emission Test Certificate: Validates that a vehicle complies with emission standards.<\/li>\n<li>Occupancy Certificate: Certifies that a building is fit for occupancy as per local regulations.<\/li>\n<li>Pollution Under Control Certificate: Affirms that a vehicle meets pollution control standards.<\/li>\n<\/ul>\n<h4>Is it possible to obtain an NOC for interstate vehicle transfers?<\/h4>\n<p>Yes, people often require an NOC when they transfer a vehicle from one state to another.<\/p>\n<h4>Who can apply for an NOC for property transfer?<\/h4>\n<p>Any legal owner or authorized representative can apply for an NOC for property transfer.<\/p>\n<h4>What is a credit score, and how does it affect NOC applications?<\/h4>\n<p>A credit score is a numerical representation of an individual&#8217;s creditworthiness. While it may not directly affect NOC applications, a healthy credit score could reflect positively on your financial standing.<\/p>\n<h4>Is the Property Identification Number (PIN) crucial for an NOC application?<\/h4>\n<p>Yes, you often need the Property Identification Number (PIN) to identify the property accurately and process the NOC.<\/p>\n<h4>What role does the registrar of properties play in the NOC process?<\/h4>\n<p>The registrar of properties oversees property registrations and related matters, which can impact the NOC process.<\/p>\n<h4>How does the NOC application process work for business entities?<\/h4>\n<p>Business entities need to follow a specific format for employees, fill out the application form, and submit relevant documents to the concerned authority.<\/p>\n<h4>Is it possible to obtain the NOC online?<\/h4>\n<p>Yes, many authorities provide an online process for submitting NOC applications.<\/p>\n<h4>Is a letter from the employer necessary for NOC applications?<\/h4>\n<p>You might need an employer&#8217;s letter to verify your employment status and sincerity.<\/p>\n<h4>What is the significance of a sincere employee in the NOC context?<\/h4>\n<p>A sincere employee is someone who has adhered to all legal and financial responsibilities, which can positively influence the NOC application.<\/p>\n<h4>Is road tax payment essential for NOC applications?<\/h4>\n<p>Yes, road tax payment might be relevant, especially for vehicle-related NOC applications.<\/p>\n<p>These FAQs aim to provide a general understanding of the No Objection Certificate (NOC) process. For specific inquiries, please consult the relevant authorities or legal experts.<\/p>\n<h2><strong>Conclusion: The Backbone of Smooth Transactions<\/strong><\/h2>\n<p>In the world of legal documents, the No-Objection Certificate stands as a must-have document for a range of situations.<\/p>\n<div class=\"group w-full text-token-text-primary border-b border-black\/10 dark:border-gray-900\/50 bg-gray-50 dark:bg-[#444654]\">\n<div class=\"flex p-4 gap-4 text-base md:gap-6 md:max-w-2xl lg:max-w-[38rem] xl:max-w-3xl md:py-6 lg:px-0 m-auto\">\n<div class=\"relative flex w-[calc(100%-50px)] flex-col gap-1 md:gap-3 lg:w-[calc(100%-115px)]\">\n<div class=\"flex flex-grow flex-col gap-3\">\n<div class=\"min-h-[20px] flex flex-col items-start gap-3 overflow-x-auto whitespace-pre-wrap break-words\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p>In property transfers, business deals, and vehicle ownership changes, people cannot overstate its importance. Whether you&#8217;re a property owner, a business professional, or a vehicle buyer, understanding the significance of the NOC and its proper drafting can save you from legal troubles and ensure a seamless process for various transactions. Always remember that obtaining the necessary NOCs is an integral part of adhering to legal compliances and facilitating future endeavors.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p>For online legal advice and <a href=\"https:\/\/legal251.com\/noc-no-objection-certificate\" target=\"_blank\" rel=\"noopener\">No Objection Certificate (NOC) drafting<\/a>, please contact Legal251 at toll-free no.- (+91) 77728-77729 or download the <a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\">Legal251 mobile app<\/a> now.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>In the realm of legal documents, the No-Objection Certificate (NOC) stands as a significant official document that finds application in a plethora of situations. From property transactions to vehicle ownership transfers, business deals to construction approvals, the NOC plays a pivotal role in easing various processes and ensuring smooth transitions. In this article, we will [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2123,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,228,451],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>No Objection Certificate (NOC) - What it is?<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"No Objection Certificate (NOC) - What it is?\" \/>\n<meta property=\"og:description\" content=\"In the realm of legal documents, the No-Objection Certificate (NOC) stands as a significant official document that finds application in a plethora of situations. From property transactions to vehicle ownership transfers, business deals to construction approvals, the NOC plays a pivotal role in easing various processes and ensuring smooth transitions. In this article, we will [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-18T10:15:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-18T10:16:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101125\/No-Objection-Certificate-NOC-What-it-is.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"No Objection Certificate (NOC) &#8211; What it is?\",\"datePublished\":\"2023-08-18T10:15:56+00:00\",\"dateModified\":\"2023-08-18T10:16:55+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\"},\"wordCount\":1630,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Drafting\",\"No Objection Certificate (NOC)\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\",\"url\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\",\"name\":\"No Objection Certificate (NOC) - What it is?\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-18T10:15:56+00:00\",\"dateModified\":\"2023-08-18T10:16:55+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"No Objection Certificate (NOC) &#8211; What it is?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"No Objection Certificate (NOC) - What it is?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/","og_locale":"en_US","og_type":"article","og_title":"No Objection Certificate (NOC) - What it is?","og_description":"In the realm of legal documents, the No-Objection Certificate (NOC) stands as a significant official document that finds application in a plethora of situations. From property transactions to vehicle ownership transfers, business deals to construction approvals, the NOC plays a pivotal role in easing various processes and ensuring smooth transitions. In this article, we will [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-18T10:15:56+00:00","article_modified_time":"2023-08-18T10:16:55+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18101125\/No-Objection-Certificate-NOC-What-it-is.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"No Objection Certificate (NOC) &#8211; What it is?","datePublished":"2023-08-18T10:15:56+00:00","dateModified":"2023-08-18T10:16:55+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/"},"wordCount":1630,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Drafting","No Objection Certificate (NOC)"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/","url":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/","name":"No Objection Certificate (NOC) - What it is?","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-18T10:15:56+00:00","dateModified":"2023-08-18T10:16:55+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/no-objection-certificate-noc-what-it-is\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"No Objection Certificate (NOC) &#8211; What it is?"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2122"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2122"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2122\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2123"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2122"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2122"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2122"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}