{"id":2134,"date":"2023-08-18T12:05:23","date_gmt":"2023-08-18T12:05:23","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2134"},"modified":"2023-08-18T12:05:23","modified_gmt":"2023-08-18T12:05:23","slug":"pvt-ltd-company-registration","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/","title":{"rendered":"Pvt. Ltd. Company Registration"},"content":{"rendered":"<div id=\"text-body\">\n<p>Setting up a business in India involves navigating a range of legalities and formalities, and one of the key decisions you&#8217;ll need to make is choosing the right type of company registration. Among the various options available, the Private Limited Company structure has gained significant popularity due to its numerous advantages and flexibility. In this article, we will delve into the intricacies of Private Limited Company registration in India, exploring its benefits, the registration process, and the various services offered by reputable consultancy firms.<\/p>\n<h2><strong>Understanding Private Limited Companies<\/strong><\/h2>\n<p>A Private Limited Company is a business entity that offers a blend of limited liability protection and operational flexibility. It is distinct from other forms of business structures such as a partnership firm or a sole proprietorship. Unlike a partnership firm, where the liability of partners can be unlimited, a Private Limited Company limits the liability of its shareholders to their shareholding in the company. This feature shields personal assets from business liabilities.<\/p>\n<h2><strong>Private Limited Company Registration Process<\/strong><\/h2>\n<p>The process of Private Limited Company registration involves several steps that need to be meticulously followed. The Government of India oversees this process, ensuring adherence to legal requirements. The steps include selecting a suitable name for the company, obtaining Digital Signature Certificates (DSCs), and Director Identification Numbers (DINs) for the proposed directors, drafting the company&#8217;s Memorandum and Articles of Association, and filing the necessary incorporation documents with the Registrar of Companies.<\/p>\n<h2><strong>Company Registration Process<br \/>\n<a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2135 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18115651\/Company-Registration-Process-300x169.jpg\" alt=\"Company Registration Process\" width=\"900\" height=\"507\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18115651\/Company-Registration-Process-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18115651\/Company-Registration-Process-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18115651\/Company-Registration-Process-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18115651\/Company-Registration-Process-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18115651\/Company-Registration-Process.jpg 1920w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/a><br \/>\n<\/strong><\/h2>\n<p>The process of company registration in India involves several important steps, and Legal251 is available to assist you throughout the entire process. Here is a breakdown of the steps involved:<\/p>\n<h3>Step 1: RUN Name Approval<\/h3>\n<p>The first step is to register the desired name for your company. You need to submit a name approval request to the Ministry of Corporate Affairs (MCA). You can provide one or two potential names along with a description of your business objectives. If your first choice is not approved, you can suggest alternative names. The MCA typically approves name requests within five business days. Legal251’s experts can help you select an appropriate name and guide you through the registration process.<\/p>\n<h3>Step 2: Directors&#8217; Digital Signature Certificate (DSC)<\/h3>\n<p>The MCA recognizes only digital signatures for all filings. Therefore, it is mandatory for directors to have a Digital Signature Certificate (DSC) before the company&#8217;s incorporation. Legal251 can assist in obtaining DSCs for the directors through a recognized certification entity. Directors need to provide identification documents and complete a video KYC process. For foreign nationals, their passport and other documents should be apostilled by the nearest embassy.<\/p>\n<h3>Step 3: Submitting the Company Incorporation Application<\/h3>\n<p>Once the directors have obtained their DSCs, you need to submit the incorporation application in the SPICe form, along with all the required attachments, to the MCA. The application includes the company&#8217;s Memorandum of Association (MOA) and Articles of Association (AOA). If the MCA finds the application complete and acceptable, the company will receive the Incorporation certificate and PAN (Permanent Account Number). Usually, the MCA approves all incorporation applications within five business days.<\/p>\n<p>By following these steps and with the assistance of Legal251, you can successfully register your company in India and gain a competitive advantage over non-registered competitors.<\/p>\n<h2><strong>Private Limited Company Compliances<\/strong><\/h2>\n<p>Compliance requirements are crucial after the registration of a private limited company in India to ensure legal adherence and avoid potential penalties. Here are some important post-registration compliances:<\/p>\n<h3>Auditor Appointment<\/h3>\n<p>Within 30 days of company incorporation, it is mandatory to appoint a practicing and registered Chartered Accountant (CA) as the company&#8217;s auditor.<\/p>\n<h3>Director DIN KYC<\/h3>\n<p>Directors with a Director Identification Number (DIN) need to undergo a DIN KYC process annually. This helps verify the accuracy of their contact details registered with the Ministry of Corporate Affairs (MCA).<\/p>\n<h3>Commencement of Business<\/h3>\n<p>Shareholders must deposit the subscription amount mentioned in the Memorandum of Association (MOA) within 180 days of incorporation. The company must also create a bank current account and deposit the specified capital amount. A copy of the bank statement should be filed with the MCA to obtain the business incorporation certificate.<\/p>\n<h3>MCA Annual Filings<\/h3>\n<p>Every year, companies registered in India must submit financial statements to the MCA. If a company incorporates between January and March, it can include the first MCA annual return in the filing for the subsequent financial year. The MCA annual return comprises Forms MGT-7 and AOC-4, which directors and a practicing professional need to digitally sign.<\/p>\n<h3>Income Tax Filing<\/h3>\n<p>Companies should file an income tax return using Form ITR-6 each financial year, regardless of the date of incorporation. The filing must be completed before the deadline. The income tax return should be digitally signed using the director&#8217;s digital signature.<\/p>\n<p>By fulfilling these compliance obligations, a private limited company can ensure legal compliance, maintain transparency, and meet its financial and reporting obligations to regulatory authorities in India.<\/p>\n<h2><strong>Types of Company Registration Services<\/strong><\/h2>\n<p>For hassle-free Private Limited Company registration, various consultancy firms offer their expertise and guidance. Legal251, for instance, provides efficient Private Limited Company Registration Services, streamlining the entire procedure. These services encompass a wide range of business needs, including online company registration, consultancy for industrial companies, video service packer registration, and more.<\/p>\n<h2><strong>Certificate Registration Process and Pricing<\/strong><\/h2>\n<p>The certification process is a crucial aspect of Private Limited Company registration, as it validates the legality and authenticity of the business. This process involves the submission of various documents and fees. The certificate pricing varies based on the type of certification required, such as certification for food, business activities, or specific industry compliance. Timely certificate renewal is also a vital step to maintain the company&#8217;s legal standing.<\/p>\n<h2><strong>Transparency and Trust<\/strong><\/h2>\n<p>Transparency International India emphasizes the importance of maintaining transparency in business operations. Private Limited Companies, by nature, are expected to adhere to legal regulations and operate with integrity. This not only ensures smooth registration but also fosters a sense of trust among stakeholders, including customers, suppliers, and investors.<\/p>\n<h2><strong>Frequently Asked Questions (FAQs) &#8211; Private Limited Company Registration in India<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2130 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg\" alt=\"FAQs\" width=\"900\" height=\"507\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs.jpg 1920w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/a><\/p>\n<h4>A Private Limited Company represents what?<\/h4>\n<p>A Private Limited Company is a type of business entity that offers limited liability protection to its shareholders. It is distinct from other forms, such as a partnership firm or sole proprietorship, and has restrictions on the transfer of shares.<\/p>\n<h4><strong>How does a Private Limited Company differ from a Partnership Firm?<\/strong><\/h4>\n<p>Unlike a partnership firm, a Private Limited Company grants limited liability to its shareholders and is regarded as a distinct legal entity. It allows for easier share transfer and has a more structured management hierarchy.<\/p>\n<h4>What does the registration process for a Private Limited Company entail?<\/h4>\n<p>The registration process involves selecting a suitable name, obtaining Digital Signature Certificates (DSCs) and Director Identification Numbers (DINs), drafting the company&#8217;s Memorandum and Articles of Association, and submitting the necessary documents to the Registrar of Companies.<\/p>\n<h4><strong>Can I Register Online for a Private Limited Company?<\/strong><\/h4>\n<p>Yes, you can register a Private Limited Company online. Various consultancy firms, like Legal251, offer Online Company Registration services to simplify the process.<\/p>\n<h4><strong>Are there Different Types of Company Registration?<\/strong><\/h4>\n<p>Yes, company registration can vary based on the type of business structure. Types include Private Limited Company, Public Company, Unlimited Company, and more.<\/p>\n<h4>What do HALAL-Certified Companies refer to?<\/h4>\n<p>HALAL-certified companies are businesses that adhere to Islamic dietary laws and are certified by organizations like HALAL India.<\/p>\n<h4><strong>Can I Register my Company Online, like Medlab Pharmaceuticals Private Limited?<\/strong><\/h4>\n<p>Yes, businesses like Legal251 offer Online Company Registration services for added convenience.<\/p>\n<h4><strong>What is a Nidhi Company?<\/strong><\/h4>\n<p>A Nidhi Company, falling under the Non-Banking Financial Company (NBFC) category, primarily involves its members in lending and borrowing activities.<\/p>\n<h4><strong>What is the Difference Between a Private Company and a Private Limited Company?<\/strong><\/h4>\n<p>A Private Limited Company is a type of private company, but it has stricter regulations and limits on the number of shareholders.<\/p>\n<h4><strong>What is the Process for Certificate Registration?<\/strong><\/h4>\n<p>The certificate registration process involves submitting necessary documents and fees to obtain various certifications, such as certificates for food, business activities, etc.<\/p>\n<h4><strong>How Much is the Certificate Price for Food Certification?<\/strong><\/h4>\n<p>Certificate pricing can vary based on the type of certification required. The price for food certification depends on the specific service provider and the scope of the certification.<\/p>\n<h4><strong>Do I Need to Renew Certificates Periodically?<\/strong><\/h4>\n<p>Yes, certificates typically require renewal at specified intervals to ensure the company&#8217;s ongoing compliance with relevant regulations.<\/p>\n<h4>What documents do you need for the certification procedure?<\/h4>\n<p>The documents required for the certification procedure may vary based on the type of certification sought. Common documents include business licenses, permits, and compliance records.<\/p>\n<h4><strong>What is the Complete Procedure for Company Registration?<\/strong><\/h4>\n<p>The entire procedure for company registration includes selecting a name, obtaining necessary approvals and certificates, drafting legal documents, and filing them with the appropriate authorities.<\/p>\n<h4><strong>Can a Consultancy Firm Assist with Business Activities like Galway Business?<\/strong><\/h4>\n<p>Yes, consultancy firms can provide guidance and services related to various business activities, including those similar to Galway Business. Further for such services you may contact Legal251.<\/p>\n<h4><strong>Can I Register a Proprietorship Firm as a Consultancy Firm?<\/strong><\/h4>\n<p>Yes, you can register a consultancy firm as a proprietorship firm, but keep in mind that the legal and liability implications may differ from those of a Private Limited Company.<\/p>\n<h4>What addresses do you need for registration, such as complete office and plant addresses?<\/h4>\n<p>During registration, you need to provide complete office and plant addresses as part of the documentation to establish the physical location of your business operations.<\/p>\n<p>Remember that company registration procedures and requirements can change over time, so it&#8217;s important to stay updated with the latest guidelines from relevant authorities. To ensure a smooth and compliant registration process, it is recommended that you consult with professionals and legal experts.<\/p>\n<p>With the assistance of Legal251, you can successfully register your company in India and gain a competitive advantage over non-registered competitors. For online legal advice, please contact Legal251 on toll-free no.- (+91) 77728-77729 or download the Legal251 mobile app now.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Setting up a business in India involves navigating a range of legalities and formalities, and one of the key decisions you&#8217;ll need to make is choosing the right type of company registration. Among the various options available, the Private Limited Company structure has gained significant popularity due to its numerous advantages and flexibility. In this [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2136,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,453],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Pvt. Ltd. Company Registration<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Pvt. Ltd. Company Registration\" \/>\n<meta property=\"og:description\" content=\"Setting up a business in India involves navigating a range of legalities and formalities, and one of the key decisions you&#8217;ll need to make is choosing the right type of company registration. Among the various options available, the Private Limited Company structure has gained significant popularity due to its numerous advantages and flexibility. In this [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-18T12:05:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18120446\/Pvt.-Ltd.-Company-Registration.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Pvt. Ltd. Company Registration\",\"datePublished\":\"2023-08-18T12:05:23+00:00\",\"dateModified\":\"2023-08-18T12:05:23+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\"},\"wordCount\":1676,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Private Limited Company registration\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\",\"url\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\",\"name\":\"Pvt. Ltd. Company Registration\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-18T12:05:23+00:00\",\"dateModified\":\"2023-08-18T12:05:23+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Pvt. Ltd. Company Registration\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Pvt. Ltd. Company Registration","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/","og_locale":"en_US","og_type":"article","og_title":"Pvt. Ltd. Company Registration","og_description":"Setting up a business in India involves navigating a range of legalities and formalities, and one of the key decisions you&#8217;ll need to make is choosing the right type of company registration. Among the various options available, the Private Limited Company structure has gained significant popularity due to its numerous advantages and flexibility. In this [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-18T12:05:23+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18120446\/Pvt.-Ltd.-Company-Registration.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Pvt. Ltd. Company Registration","datePublished":"2023-08-18T12:05:23+00:00","dateModified":"2023-08-18T12:05:23+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/"},"wordCount":1676,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Private Limited Company registration"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/","url":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/","name":"Pvt. Ltd. Company Registration","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-18T12:05:23+00:00","dateModified":"2023-08-18T12:05:23+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/pvt-ltd-company-registration\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Pvt. Ltd. Company Registration"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2134"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2134"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2134\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2136"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2134"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2134"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2134"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}