{"id":2147,"date":"2023-08-19T09:36:20","date_gmt":"2023-08-19T09:36:20","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2147"},"modified":"2023-08-19T09:36:20","modified_gmt":"2023-08-19T09:36:20","slug":"a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/","title":{"rendered":"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985"},"content":{"rendered":"<div id=\"text-body\">\n<h2><strong>Introduction<\/strong><\/h2>\n<p>Narcotic Drugs and Psychotropic Substances possess a range of medical and scientific applications, but abusers and traffickers can exploit them. Article 47 of the Constitution of India outlines India&#8217;s approach to handling Narcotic Drugs and Psychotropic Substances, emphasizing the objective of prohibiting the consumption, except for medicinal purposes, of intoxicating drinks and drugs harmful to health.<\/p>\n<p>This principle aligns with India&#8217;s stance in three international drug-related conventions: the Single Convention on Narcotic Drugs, 1961; the Convention on Psychotropic Substances, 1971; and the United Nations Convention Against Illicit Traffic in Narcotic Drugs and Psychotropic Substances, 1988. India has both signed and ratified these conventions.<\/p>\n<p>People in India have practiced cannabis smoking since at least 2000 BC. However, the country did not prohibit cannabis and its derivatives, such as marijuana, hashish\/charas, etc., until 1985. Prior to the prohibition, people commonly used them for recreation.<\/p>\n<p>The Indian government enacted the Narcotic Drugs and Psychotropic Substances (NDPS) Act, 1985, which is an important legislation aiming to counter drug abuse and the illicit trafficking of narcotics and psychotropic substances.<\/p>\n<p>The Indian government enacted the Narcotic Drugs and Psychotropic Substances Act as significant legislation to combat illicit activities involving narcotic drugs and psychotropic substances. The Act&#8217;s purpose is to control the production, transportation, consumption, and possession of such drugs and substances within India. The Act passed on November 14, 1985, and has undergone amendments to address emerging challenges and ensure effective enforcement.<\/p>\n<h2><strong>Fundamental Principles of the NDPS Act<\/strong><\/h2>\n<p>The NDPS Act incorporates several fundamental principles for addressing drug abuse and trafficking:<\/p>\n<p><strong>Differentiating between Soft Drugs and Harder Drugs:<\/strong><\/p>\n<p>The Act establishes a differentiation between soft drugs and harder drugs based on their potential for abuse and harm. It prescribes stringent punishments for offenses involving harder drugs.<\/p>\n<p><strong>Recognizing Personal Consumption Exemption: <\/strong><\/p>\n<p>The Act acknowledges the distinction between drug trafficking and personal consumption. It imposes less severe penalties on individuals caught with a quantity lower than the prescribed limit for personal consumption.<\/p>\n<p><strong>Empowering Authorities to Forfeit Property Derived from Illicit Activities: <\/strong><\/p>\n<p>The Act grants authorities the power to seize and forfeit properties acquired from drug-related offenses.<\/p>\n<p><strong>Prescribing Mandatory Death Sentence: <\/strong><\/p>\n<p>In specific cases of drug trafficking, the Act mandates a death sentence, eliminating any possibility of leniency.<\/p>\n<h2><strong>Provisions of the NDPS Act, 1985<\/strong><\/h2>\n<p><strong>Prohibition on Consumption of Drugs: <\/strong><\/p>\n<p>The Act strictly forbids individuals from consuming narcotic drugs and psychotropic substances, except for medical or scientific purposes.<\/p>\n<p><strong>Punishments and Offences: <\/strong><\/p>\n<p>The Act outlines offenses that result in imprisonment, fines, or both, depending on the severity of the crime.<\/p>\n<p><strong>Conscious Possession: <\/strong><\/p>\n<p>The Act defines &#8220;conscious possession&#8221; of drugs as a punishable offense, indicating that individuals must be aware of and in control of the drugs they possess.<\/p>\n<p><strong>Dealing with Poppy Straw and Physical Possession: <\/strong><\/p>\n<p>The Act addresses poppy straw and other components of the opium poppy plant and encompasses offenses linked to physically possessing them.<\/p>\n<p><strong>Exemptions: <\/strong><\/p>\n<p>The Act grants specific exemptions for certain purposes, such as medicinal and scientific use under particular conditions.<\/p>\n<h2><strong>NDPS Act, 1985: Implementation and Challenges<\/strong><\/h2>\n<p>The NDPS Act implemented a robust plan and an enforcement team responsible for enforcing it. The Act&#8217;s time dimensions are designed to ensure timely resolution of cases and provide justice to all parties involved.<\/p>\n<h3>Challenges Faced<\/h3>\n<p><strong>Occupational Health Services and Mental Health<\/strong><\/p>\n<p>The Act acknowledges the importance of occupational health services and mental health concerning drug abuse and trafficking. However, challenges persist in effectively implementing and providing access to such services.<\/p>\n<p><strong>Awareness and Prevention<\/strong><\/p>\n<p>Despite the provisions of the NDPS Act, raising awareness about the consequences of drug abuse and preventing its occurrence remains crucial challenges.<\/p>\n<p><strong>Drafting Errors<\/strong><\/p>\n<p>Over time, certain drafting errors in the Act have caused interpretation issues and necessitated clarifications.<\/p>\n<h3>Notable Cases<\/h3>\n<p>Various high-profile cases involving celebrities like Michael Jackson, F. Murray Abraham, Lionel Richie, and Cyndi Lauper have seen the application of the NDPS Act, 1985. The Act also drew attention during the Aryan Khan case, in which reasonable doubt played a crucial role in the proceedings.<\/p>\n<p>The Narcotic Drugs and Psychotropic Substances Act, 1985, stands as a significant legislative piece in India&#8217;s fight against drug abuse and trafficking. While it encompasses several fundamental principles and specifies punishable offenses, there remains an ongoing necessity for continuous improvement, awareness, and preventive measures to effectively combat the menace of narcotics and psychotropic substances.<\/p>\n<h2><strong>Some of the key features of the NDPS Act are<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2149 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093214\/key-features-of-the-NDPS-Act-300x169.jpg\" alt=\"key features of the NDPS Act\" width=\"801\" height=\"451\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093214\/key-features-of-the-NDPS-Act-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093214\/key-features-of-the-NDPS-Act-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093214\/key-features-of-the-NDPS-Act-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093214\/key-features-of-the-NDPS-Act-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093214\/key-features-of-the-NDPS-Act.jpg 1920w\" sizes=\"(max-width: 801px) 100vw, 801px\" \/><\/a><\/p>\n<h4><strong>Classification of drugs<\/strong><\/h4>\n<p>The NDPS Act categorizes drugs into different schedules based on their potential for abuse and therapeutic value. It establishes separate schedules for narcotic drugs and psychotropic substances, imposing stricter regulations on substances with higher abuse potential.<\/p>\n<h4><strong>Prohibition and regulation<\/strong><\/h4>\n<p>The Act prohibits individuals from producing, manufacturing, cultivating, possessing, selling, purchasing, transporting, or consuming narcotic drugs and psychotropic substances, except for medical and scientific purposes. It sets up stringent controls and licensing requirements for authorized activities.<\/p>\n<h4><strong>Punishments and penalties<\/strong><\/h4>\n<p>The NDPS Act outlines strict punishments for offenses related to drugs. It differentiates between small quantities and commercial quantities, imposing harsher penalties for trafficking and commercial activities. Offenders may be subject to imprisonment ranging from several years to life imprisonment, in addition to fines.<\/p>\n<h4><strong>Special Courts<\/strong><\/h4>\n<p>The Act establishes special courts responsible for handling NDPS cases. These courts are designated to ensure the prompt trial of drug-related offenses and the effective implementation of the Act.<\/p>\n<h4><strong>Forfeiture of property<\/strong><\/h4>\n<p>The NDPS Act grants authorities the power to seize and forfeit properties acquired through illicit drug activities. This provision serves as a deterrent and aids in disrupting the financial aspects of drug trafficking.<\/p>\n<h4><strong>International cooperation<\/strong><\/h4>\n<p>The Act facilitates international cooperation and coordination in addressing drug-related offenses. It enables the extradition of offenders, sharing of intelligence and information, and cooperation in investigations and legal proceedings.<\/p>\n<h4><strong>Rehabilitation and treatment<\/strong><\/h4>\n<p>Recognizing the significance of rehabilitating and treating drug addicts, the NDPS Act provides for the establishment of rehabilitation centers and programs. These initiatives assist individuals in overcoming drug addiction and reintegrating into society.<\/p>\n<h2><strong>Enactment of NDPS Act, 1985<\/strong><\/h2>\n<p>Before the implementation of the Narcotic Drugs and Psychotropic Substances (NDPS) Act of 1985, three Central Acts primarily governed the regulation of narcotic drugs in India: the Opium Act of 1857 (Act XIII), the Opium Act of 1878 (Act I), and the Dangerous Drugs Act of 1930 (Act II).<\/p>\n<p>In order to fulfill India&#8217;s obligations under the three United Nations drug conventions and in accordance with Article 47 of the Constitution, India enacted the NDPS Act of 1985 (Act LXI). This legislation prohibits individuals from involving themselves in the production, manufacturing, cultivation, possession, sale, purchase, transportation, storage, and\/or consumption of any narcotic drug or psychotropic substance, except for authorized medical or scientific purposes. The NDPS Act has undergone three subsequent amendments in 1988, 2001, and 2014. It applies across the entire territory of India and extends to all Indian citizens outside the country, as well as to individuals on board ships and aircraft registered in India.<\/p>\n<h2><strong>Aims And Object of the Act<\/strong><\/h2>\n<p>The legislature has enacted the NDPS Act with the following objectives in mind:<\/p>\n<p><strong>Consolidation and Amendment<\/strong><\/p>\n<p>The Act aims to consolidate and amend the laws concerning narcotic drugs, providing a comprehensive framework for regulating them.<\/p>\n<p><strong>Stringent Control and Regulation<\/strong><\/p>\n<p>The NDPS Act introduces stringent provisions to control and regulate all activities related to narcotic drugs and psychotropic substances. It encompasses cultivation, manufacturing, distribution, sale, purchase, and consumption, intending to prevent their abuse and illicit trafficking.<\/p>\n<p><strong>Forfeiture of Property<\/strong><\/p>\n<p>The Act includes provisions for forfeiting property acquired through or used in illicit drug trafficking. This measure acts as a deterrent and helps disrupt the financial aspects of drug-related operations.<\/p>\n<p><strong>Implementation of International Conventions<\/strong><\/p>\n<p>The NDPS Act aligns with and implements the provisions of the International Conventions on Narcotic Drugs and Psychotropic Substances. India&#8217;s participation in these conventions necessitates enacting legislation that effectively addresses drug-related issues and aligns with international standards.<\/p>\n<h2><strong>Drug possession classification under NDPS Act, 1985<\/strong><\/h2>\n<p>The NDPS Act classifies the possession of drugs into three categories, each carrying different penalties:<\/p>\n<h4><strong>Small Quantity: <\/strong><\/h4>\n<p>This category refers to a quantity lower than the limit specified by the Government in the official gazette. If an individual illegally possesses drugs like opium, cannabis, poppy seeds, etc., in a small quantity, they could face imprisonment for up to one year, a fine of Rs. 10,000, or both.<\/p>\n<h4><strong>Intermediate Quantity: <\/strong><\/h4>\n<p>This category covers quantities higher than the small quantity but lower than the commercial quantity. If a person possesses drugs such as opium, cannabis, poppy seeds, etc., exclusively and in an intermediate quantity, they may face imprisonment for up to ten years and a fine of up to Rs. 1 lakh. The case of State v. Mushtaq Ahmad and Others (2015) clarified that the intermediate quantity falls between the small quantity and the commercial quantity.<\/p>\n<h4><strong>Commercial Quantity: <\/strong><\/h4>\n<p>This category pertains to a quantity higher than the limit specified by the government in the official gazette. If an individual exclusively possesses drugs like opium, cannabis, poppy seeds, etc., in a commercial quantity, they may face a minimum imprisonment term of ten years, extendable up to twenty years, along with a fine ranging from Rs. 1 lakh to Rs. 2 lakhs.<\/p>\n<p>In summary, the NDPS Act establishes distinct sentencing provisions based on the quantity of drugs involved, differentiating between small, intermediate, and commercial quantities. These categories determine the duration of imprisonment and the amount of fine that can be imposed on individuals found in possession of drugs.<\/p>\n<h2><strong>Punishment And Penalties<\/strong><\/h2>\n<p><strong>Small Quantity<\/strong>: Rigorous imprisonment for a term upto 1 year, or with a fine upto Rs 10,000, or with both<\/p>\n<p><strong>Less than Commercial<\/strong>: Rigorous imprisonment for a term upto10 years, or with fine upto rupees 1 Lakh, or both<\/p>\n<p><strong>Commercial Quantity<\/strong>: Rigorous imprisonment for a term of 10 to 20 years, or fine of rupees 1 Lakhs to 2 lakh<\/p>\n<p>The Court was empowered to impose a fine exceeding two lakhs by recording reasons for the same in the judgment.<\/p>\n<p><strong>Habitual Offenders<\/strong><\/p>\n<p>For individuals who are habitual offenders and are convicted of an offense with the same punishment after a previous conviction, the punishment will be enhanced to one and a half times the maximum term of imprisonment and the fine.<\/p>\n<p><strong>Death Penalty Provision<\/strong><\/p>\n<p>The NDPS Act also includes a provision for the death penalty for habitual offenders who commit or attempt certain specified offenses outlined in Section 31A.<\/p>\n<h2><strong>Bail under NDPS Act, 1985<\/strong><\/h2>\n<p>The Supreme Court, in the case of the Union of India vs. Ram Samujh and Others (1999), emphasized the severe impact of drug dealing on vulnerable young minds and society as a whole. While murder might affect a few individuals, drug dealers possess the potential to harm numerous lives. Granting bail to such individuals increases the risk of their return to drug dealing.<\/p>\n<p>Section 37 of the NDPS Act establishes strict criteria for granting bail. Possessing illegal drugs in unlawful quantities is regarded as a serious offense and falls under both cognizable and non-bailable categories. To secure bail under the Act, two conditions need fulfillment:<\/p>\n<p>The Public Prosecutor must have an opportunity to contest the application for release. If the Public Prosecutor opposes the bail application, the court must be convinced that there are reasonable grounds to believe in the accused&#8217;s innocence and that they are unlikely to commit any offense while on bail.<\/p>\n<h3>Reasonable Ground:<\/h3>\n<p>In the recent case of Aryan Shah Rukh Khan vs. Union of India (2021), the court repeatedly denied bail under the NDPS Act&#8217;s requirement of &#8220;reasonable grounds for believing that he is not guilty&#8221;. Although the NDPS Act does not specifically define the term &#8220;reasonable ground&#8221;, the Supreme Court, in the case of State of Kerala vs. Rajesh (2020), stated that it encompasses a strong likelihood that the accused will not be found guilty of any offenses listed in the Act. The facts and circumstances of the case should be clear to eliminate any doubt about the accused&#8217;s involvement.<\/p>\n<p>Furthermore, according to the Supreme Court&#8217;s decision in the case of Municipal Corporation of Greater Mumbai vs. Kamla Mills Ltd (2003), &#8220;reasonable ground&#8221; means acting in accordance with reason. The determination of whether the accused&#8217;s actions were reasonable depends on the facts, and after careful consideration of the evidence, the court must make a wise decision.<\/p>\n<p>In the case of Union of India vs. Shiv Shanker Kesari (2007), the Apex Court defined reasonable grounds as having a substantial probable cause to believe that the accused is not guilty of the charged offense, especially in cases where bail has been granted under the NDPS Act despite the accused&#8217;s criminal antecedents.<\/p>\n<p>In the case of Jagdish Chand vs. State of H.P. (2020), the court observed that the accused exclusively possessed 837 grams of cannabis, which, as per the official gazette, falls under the category of an intermediate quantity with a punishment of up to 10 years of imprisonment and a fine of up to 1 lakh.<\/p>\n<h3>Undue delay in the trial as a ground for bail:<\/h3>\n<p>In the landmark case of Hussainara Khatoon v. Home Secretary, State of Bihar (1980), the Supreme Court acknowledged the &#8220;right to a speedy trial&#8221; as a fundamental right implicitly present in the right to life and personal liberty guaranteed by Article 21 of the Indian Constitution. The Court stressed the significance of ensuring a reasonably swift trial and imposed stricter bail requirements, enhanced living conditions for undertrial prisoners, and advocated for a reduced duration between arrest and trial. It declared that any procedure failing to guarantee a reasonable speedy trial cannot be considered reasonable, fair, or just.<\/p>\n<p>In the case of Mohd. Muslim @ Hussain v. State (NCT of Delhi) (2023), the Supreme Court granted bail to an undertrial prisoner who had been held in detention for seven years due to suspected involvement in a marijuana supply gang. The Court highlighted that the grant of bail based on undue delay in trial should not be confined by Section 37 of the NDPS Act, taking into account the imperative of Section 436A of the Code of Criminal Procedure (CrPC), which is applicable to offenses under the NDPS Act as well.<\/p>\n<h2><strong>Frequently Asked Questions (FAQs) on the Narcotic Drugs and Psychotropic Substances Act, 1985<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2130 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg\" alt=\"FAQs\" width=\"802\" height=\"452\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs.jpg 1920w\" sizes=\"(max-width: 802px) 100vw, 802px\" \/><\/a><\/p>\n<h4><strong>1. What is the Narcotic Drugs and Psychotropic Substances Act, 1985?<\/strong><\/h4>\n<p>The Narcotic Drugs and Psychotropic Substances Act, 1985, is an Indian legislation that the government enacted to regulate and control the production, manufacture, possession, sale, transport, import, inter-State, export, use, consumption, purchase, sale, etc., of narcotic drugs and psychotropic substances. It aims to prevent individuals from abusing them and to combat drug trafficking.<\/p>\n<h4><strong>2. Which substances does this Act cover?<\/strong><\/h4>\n<p>The Act covers a wide range of substances classified as narcotic drugs and psychotropic substances, all listed in its schedules. These include substances like opium, heroin, cocaine, cannabis, morphine, codeine, LSD, MDMA, and other similar substances.<\/p>\n<h4><strong>3. What is the purpose of enacting the Act?<\/strong><\/h4>\n<p>The Act primarily intends to regulate and control the production, distribution, and use of narcotic drugs and psychotropic substances. Its goal is to prevent these substances from being misused for non-medical purposes and to address the issue of drug abuse and trafficking.<\/p>\n<h4><strong>4. How does the Act regulate possession and consumption of these substances?<\/strong><\/h4>\n<p>The Act generally forbids individuals from engaging in activities such as possessing, purchasing, selling, transporting, warehousing, using, consuming, importing, exporting, engaging in inter-State transactions, and cross-border transport of these substances. Exceptions are made for medical and scientific purposes, provided individuals have the necessary licenses and follow regulations.<\/p>\n<h4><strong>5. Are there any exceptions for medical and scientific use?<\/strong><\/h4>\n<p>Indeed, the Act includes provisions that allow medical and scientific use of narcotic drugs and psychotropic substances under licenses issued by government authorities. Medical professionals and researchers can obtain licenses to legitimately possess and use these substances.<\/p>\n<h4><strong>6. What penalties does the Act impose for violating its provisions?<\/strong><\/h4>\n<p>The Act enforces stringent penalties for various offenses, including engaging in unauthorized activities such as producing, manufacturing, possessing, purchasing, selling, transporting, warehousing, using, consuming, importing, exporting, and other related actions involving these substances. Penalties include fines, imprisonment, and asset forfeiture.<\/p>\n<h4><strong>7. What are the consequences for trafficking and illegally cultivating narcotic plants?<\/strong><\/h4>\n<p>Trafficking and illegally cultivating narcotic plants can lead to severe punishments, including rigorous imprisonment and fines. The severity of the punishment depends on factors such as the quantity of the substance involved and the nature of the offense.<\/p>\n<h4><strong>8. How does the Act address international drug trafficking?<\/strong><\/h4>\n<p>The Act includes provisions to address offenses linked to international drug trafficking and transshipment. It enables India to fulfill its obligations under various international treaties and conventions related to narcotics and psychotropic substances.<\/p>\n<h4><strong>9. Can the Act undergo amendments?<\/strong><\/h4>\n<p>Yes, similar to any other legislation, the government can amend the Act through a proper legislative process if the need arises to update its provisions or tackle emerging challenges related to drug abuse and trafficking.<\/p>\n<h4><strong>10. How can individuals and organizations maintain compliance with the Act?<\/strong><\/h4>\n<p>To ensure compliance, individuals and organizations should possess knowledge of the substances listed in the schedules of the Act and their permissible uses. For medical and scientific purposes, they should obtain the necessary licenses and adhere to the regulations stipulated by the authorities.<\/p>\n<p>Please note that this information serves as general reference and should not be considered legal advice. For specific legal matters, it&#8217;s recommended to <a href=\"https:\/\/legal251.com\/consultancy\" target=\"_blank\" rel=\"noopener\">consult legal experts or professionals<\/a> knowledgeable about the Narcotic Drugs and Psychotropic Substances Act, 1985.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Introduction Narcotic Drugs and Psychotropic Substances possess a range of medical and scientific applications, but abusers and traffickers can exploit them. Article 47 of the Constitution of India outlines India&#8217;s approach to handling Narcotic Drugs and Psychotropic Substances, emphasizing the objective of prohibiting the consumption, except for medicinal purposes, of intoxicating drinks and drugs harmful [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2148,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,443,456],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985\" \/>\n<meta property=\"og:description\" content=\"Introduction Narcotic Drugs and Psychotropic Substances possess a range of medical and scientific applications, but abusers and traffickers can exploit them. Article 47 of the Constitution of India outlines India&#8217;s approach to handling Narcotic Drugs and Psychotropic Substances, emphasizing the objective of prohibiting the consumption, except for medicinal purposes, of intoxicating drinks and drugs harmful [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-19T09:36:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093106\/A-brief-about-the-Narcotic-Drugs-and-Psychotropic-Substances-Act-1985.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985\",\"datePublished\":\"2023-08-19T09:36:20+00:00\",\"dateModified\":\"2023-08-19T09:36:20+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\"},\"wordCount\":2850,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Criminal Law\",\"Narcotic Drugs and Psychotropic Substances Act\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\",\"url\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\",\"name\":\"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-19T09:36:20+00:00\",\"dateModified\":\"2023-08-19T09:36:20+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/","og_locale":"en_US","og_type":"article","og_title":"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985","og_description":"Introduction Narcotic Drugs and Psychotropic Substances possess a range of medical and scientific applications, but abusers and traffickers can exploit them. Article 47 of the Constitution of India outlines India&#8217;s approach to handling Narcotic Drugs and Psychotropic Substances, emphasizing the objective of prohibiting the consumption, except for medicinal purposes, of intoxicating drinks and drugs harmful [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-19T09:36:20+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19093106\/A-brief-about-the-Narcotic-Drugs-and-Psychotropic-Substances-Act-1985.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985","datePublished":"2023-08-19T09:36:20+00:00","dateModified":"2023-08-19T09:36:20+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/"},"wordCount":2850,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Criminal Law","Narcotic Drugs and Psychotropic Substances Act"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/","url":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/","name":"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-19T09:36:20+00:00","dateModified":"2023-08-19T09:36:20+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/a-brief-about-the-narcotic-drugs-and-psychotropic-substances-act-1985\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"A brief about the Narcotic Drugs and Psychotropic Substances Act, 1985"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2147"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2147"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2147\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2148"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2147"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2147"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2147"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}