{"id":2156,"date":"2023-08-19T13:08:38","date_gmt":"2023-08-19T13:08:38","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2156"},"modified":"2023-08-19T13:08:38","modified_gmt":"2023-08-19T13:08:38","slug":"liberalised-remittance-scheme-lrs","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/","title":{"rendered":"Liberalised Remittance Scheme (LRS)"},"content":{"rendered":"<div id=\"text-body\">\n<h2><strong>A Brief Introduction to Liberalised Remittance Scheme<\/strong><\/h2>\n<p>The Reserve Bank of India (RBI) introduced the Liberalised Remittance Scheme (LRS) in 2004 so that Indian residents could transfer funds abroad for specific purposes. This scheme has played a crucial role in promoting international trade and investment, as well as in facilitating capital flows into and out of India.<\/p>\n<p>Before the LRS, the Foreign Exchange Management Act (FEMA) 1999 imposed several restrictions on fund transfers from India to other countries. However, with the implementation of the LRS, individuals gained the freedom to remit up to USD 25,000 per financial year for eligible transactions. Over time, authorities raised the limit to USD 50,000 in 2007 and further increased it to USD 250,000 in 2013.<\/p>\n<p>Under the LRS, resident individuals can remit funds up to a specified limit for various permissible transactions involving a current or capital account. This scheme facilitates the smooth transfer of funds and offers individuals the flexibility to engage in international financial activities within the defined boundaries of the LRS framework.<\/p>\n<p>The primary goal of the Liberalised Remittance Scheme is to ease existing foreign exchange regulations and enable Indian residents to transfer funds abroad seamlessly. Additionally, the scheme aims to attract non-residents to invest in India while also encouraging outward remittances from the country.<\/p>\n<h2><strong>Who can avail benefits under this scheme?<\/strong><\/h2>\n<p>To benefit from the Liberalised Remittance Scheme (LRS), you must fulfill certain eligibility criteria. The individual needs to be an Indian resident as defined by the Foreign Exchange Management Act (FEMA) and possess a valid PAN card, a bank account in India, and a valid passport. Additionally, the remitted amount must not exceed the prescribed limit of USD 250,000 per financial year.<\/p>\n<p>Under the LRS, Indian citizens who reside in India have permission to remit up to USD 250,000 per financial year (April-March) for various permissible current or capital account transactions, or a combination thereof. You can utilize this flexible amount for business ventures, personal expenses, educational pursuits, and other approved purposes.<\/p>\n<h2><strong>Benefits of Liberalised Remittance Scheme in India<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2158 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130656\/Benefits-of-Liberalised-Remittance-Scheme-in-India-300x169.jpg\" alt=\"Benefits of Liberalised Remittance Scheme in India\" width=\"900\" height=\"507\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130656\/Benefits-of-Liberalised-Remittance-Scheme-in-India-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130656\/Benefits-of-Liberalised-Remittance-Scheme-in-India-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130656\/Benefits-of-Liberalised-Remittance-Scheme-in-India-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130656\/Benefits-of-Liberalised-Remittance-Scheme-in-India-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130656\/Benefits-of-Liberalised-Remittance-Scheme-in-India.jpg 1920w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/a><\/p>\n<p>The Liberalised Remittance Scheme (LRS) grants several notable benefits, which include:<\/p>\n<h4><strong>Diversification of Investment<\/strong><\/h4>\n<p>Individuals can diversify their investment portfolio by using the LRS to invest in foreign assets like stocks, bonds, mutual funds, and real estate. This offers a greater exposure to global markets and potential financial growth.<\/p>\n<h4><strong>Overseas Education<\/strong><\/h4>\n<p>The LRS simplifies the remittance of funds for educational expenses such as tuition fees, living costs, and books. This empowers students to pursue higher education in foreign universities and colleges, enriching their academic and cultural experiences.<\/p>\n<h4><strong>Medical Treatment<\/strong><\/h4>\n<p>Individuals can use the LRS to remit money for receiving medical treatment abroad. This is especially valuable for individuals in need of specialized medical procedures or treatments that might not be available in India, providing access to advanced healthcare options.<\/p>\n<h4><strong>Travel Expenses<\/strong><\/h4>\n<p>The LRS empowers individuals to remit money for expenses related to travel, including flight tickets, hotel reservations, and other associated costs. This streamlines international travel arrangements and enhances the overall travel experience.<\/p>\n<h4><strong>Start-ups and Business Investments<\/strong><\/h4>\n<p>The LRS permits individuals to invest in foreign businesses, start-ups, and joint ventures. This creates opportunities for entrepreneurs and business owners to expand their ventures globally and tap into international markets.<\/p>\n<h4><strong>Gifts and Donations<\/strong><\/h4>\n<p>Through the LRS, individuals can give or donate money to family members or charitable organizations outside India. This encourages generosity and philanthropy by facilitating cross-border financial support.<\/p>\n<p>Since its inception, the Liberalised Remittance Scheme has played a significant role in promoting international trade, attracting foreign investment, and providing individuals with increased financial flexibility. However, it is crucial to acquaint yourself with the specific eligibility criteria and documentation requirements of the LRS to ensure a smooth and trouble-free transaction process.<\/p>\n<h2>Tax on Liberalised Remittance Scheme<\/h2>\n<p>The Reserve Bank of India (RBI) introduced the Liberalised Remittance Scheme (LRS), a significant foreign exchange management policy that allows Indian residents to remit money abroad for various purposes, including education, travel, medical treatment, investment, and gifting, within certain limits. While the LRS has brought about greater flexibility and accessibility for Indian individuals to diversify their financial activities globally, it&#8217;s important to understand the tax implications associated with this scheme.<\/p>\n<p>As of my last update in September 2021, the tax implications of the Liberalised Remittance Scheme in India were generally related to outward remittances. Here are some key points to consider:<\/p>\n<h4><strong>Income Tax<\/strong>:<\/h4>\n<p>Indian residents need to pay income tax on any income earned from investments made using funds remitted under the LRS. This includes income from interests, dividends, capital gains, and other sources. The tax treatment depends on the nature of the income and the applicable tax treaties between India and the recipient country.<\/p>\n<h4><strong>Capital Gains Tax<\/strong>:<\/h4>\n<p>Individuals who invest the remitted funds in assets like stocks, real estate, or other securities and make a profit upon selling these assets might be subject to capital gains tax. The tax rate varies based on whether the gain is short-term or long-term and the type of asset.<\/p>\n<h4><strong>Reporting Foreign Assets<\/strong>:<\/h4>\n<p>Residents with overseas bank accounts, financial assets, or properties must disclose these in their income tax returns. The goal of Foreign Asset Reporting is to prevent tax evasion and promote transparency.<\/p>\n<h4><strong>Gift Tax<\/strong>:<\/h4>\n<p>While India doesn&#8217;t have a specific &#8216;gift tax&#8217; as of my last update, gifts received from non-relatives beyond a certain threshold might be considered as taxable income for the recipient.<\/p>\n<h4><strong>Tax Treaties<\/strong>:<\/h4>\n<p>India has signed Double Taxation Avoidance Agreements (DTAA) with several countries. These agreements prevent double taxation on income earned in one country by a resident of another. Tax treaties address issues like income taxation, capital gains, and more. Tax residents can use these treaties to reduce or eliminate certain types of taxes on remittances.<\/p>\n<h4><strong>Foreign Tax Credits<\/strong>:<\/h4>\n<p>Individuals who pay taxes on income earned abroad due to foreign country regulations may claim a foreign tax credit in their Indian tax return. This avoids double taxation on the same income.<\/p>\n<h4><strong>Documentation and Compliance<\/strong>:<\/h4>\n<p>Those using the LRS must maintain accurate records of remittances, investments, income earned, and taxes paid both in India and abroad. Failing to comply with reporting and documentation requirements can result in penalties and legal consequences.<\/p>\n<p>It&#8217;s important to note that tax regulations can change. Consulting a qualified tax advisor or financial consultant is advisable to understand the most current tax implications related to the Liberalised Remittance Scheme and any recent changes to Indian tax laws.<\/p>\n<h2><strong>FAQs on Liberalised Remittance Scheme (LRS)<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2130 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg\" alt=\"FAQs\" width=\"900\" height=\"507\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs.jpg 1920w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/a><\/p>\n<h4><strong>1. What is the Liberalised Remittance Scheme (LRS)?<\/strong><\/h4>\n<p>The Reserve Bank of India (RBI) introduced the Liberalised Remittance Scheme (LRS), which allows resident individuals to freely remit a certain amount of money outside India for various permissible purposes, such as education, travel, investments, and gifting.<\/p>\n<h4><strong>2. Who can avail the LRS?<\/strong><\/h4>\n<p>Resident individuals, including minors (through their guardians), can avail the LRS. However, the scheme is not available for companies, partnership firms, HUFs (Hindu Undivided Families), and trusts.<\/p>\n<h4><strong>3. What is the maximum remittance amount allowed under the LRS?<\/strong><\/h4>\n<p>The RBI periodically revises the maximum remittance amount allowed under the LRS. As of my last knowledge update in September 2021, the limit was USD 250,000 per financial year per resident individual. For the latest limits, it&#8217;s important to check with the RBI or authorized banks.<\/p>\n<h4><strong>4. What purposes does the LRS cover?<\/strong><\/h4>\n<p>The LRS covers various purposes including travel, education, medical treatment, buying immovable property, gifting, investments, setting up subsidiaries\/joint ventures abroad, and more. However, the scheme does not allow for investing in prohibited activities and speculative transactions.<\/p>\n<h4><strong>5. Can the LRS be used for investing in overseas stock markets?<\/strong><\/h4>\n<p>Yes, the LRS permits investment in overseas stock markets. Resident individuals can use the LRS to invest in equities, debt instruments, mutual funds, and other securities listed on recognized stock exchanges abroad.<\/p>\n<h4><strong>6. Are there any reporting requirements for LRS transactions?<\/strong><\/h4>\n<p>Yes, individuals who make remittances under the LRS must submit a declaration to their bank stating the purpose of the remittance. Additionally, authorized banks are required to report these transactions to the RBI.<\/p>\n<h4><strong>7. Are there any tax implications on LRS remittances?<\/strong><\/h4>\n<p>Remittances made under the LRS for permissible purposes are generally not subject to tax. However, any income earned from investments made abroad using LRS funds could be subject to tax as per Indian tax laws. It&#8217;s advisable to consult a tax expert for accurate advice.<\/p>\n<h4><strong>8. Can family members collectively use the LRS limit?<\/strong><\/h4>\n<p>Yes, family members (such as parents and children) can pool their individual LRS limits to make a larger remittance for a specific purpose, as long as the source of funds is legitimate and complies with applicable regulations.<\/p>\n<h4><strong>9. Are there any restrictions on gifting money abroad under the LRS?<\/strong><\/h4>\n<p>Yes, gifting money abroad is one of the permissible purposes under the LRS. However, there are limits and conditions on the amount that can be gifted to a non-resident individual. To know the exact limits and conditions, you should confirm with authorized banks.<\/p>\n<h4><strong>10. Can the LRS be used for repatriating funds from foreign investments back to India?<\/strong><\/h4>\n<p>Yes, the LRS can be used to repatriate funds from investments made abroad back to India. However, any capital gains earned on these investments may have tax implications in India.<\/p>\n<h2><strong>Conclusion<\/strong><\/h2>\n<h4><strong>Conclusion: Liberalised Remittance Scheme (LRS)<\/strong><\/h4>\n<p>The Liberalised Remittance Scheme (LRS) has emerged as a pivotal framework facilitating various overseas financial activities for Indian residents. Under this scheme, individuals can make foreign remittances and engage in foreign exchange transactions for a range of purposes. The scheme has been instrumental in promoting international transactions and expanding investment horizons. In this conclusion, we will delve into key aspects of the LRS and its implications across multiple domains.<\/p>\n<h4><strong>Facilitating Global Engagements<\/strong><\/h4>\n<p>The LRS enables individuals to engage in overseas exchanges, contributing to a global economy. It caters to a diverse range of purposes, including expenses in connection with travel, education, medical treatment, family support, business investments, and more. The scheme has empowered individuals to explore international opportunities, expand businesses, and enhance their personal experiences.<\/p>\n<h4><strong>Empowering Financial Flexibility<\/strong><\/h4>\n<p>By allowing remittances for purchase of assets, investment in foreign companies, and participation in equity investment, the LRS empowers Indian residents to invest in overseas markets. It has led to the acquisition of qualification shares and equity instruments in foreign entities, thereby fostering economic growth and cross-border collaborations.<\/p>\n<h4><strong>Encouraging Investments and Business Activities<\/strong><\/h4>\n<p>The LRS has been pivotal in encouraging investments in overseas direct investment, including equity investments and establishment of overseas companies. It serves as a conduit for specialized training, acquisition of shares, and development of townships. The scheme bolsters Indian entrepreneurs and businesses seeking expansion and diversification in foreign countries.<\/p>\n<h4><strong>Ensuring Compliance and Regulation<\/strong><\/h4>\n<p>The scheme operates within the framework of the Foreign Exchange Management (Current Account Transactions) Rules, with authorized dealer banks acting as intermediaries. The stipulated limits on remittances and transactions aim to strike a balance between individual aspirations and the need to maintain the stability of the Indian Rupee. The scheme also addresses concerns related to money laundering, terrorism, and financial crimes, aligning with international standards set by organizations like the Financial Action Task Force.<\/p>\n<h4><strong>Fostering Personal and Family Well-being<\/strong><\/h4>\n<p>The LRS has also played a significant role in addressing personal and family needs. It allows remittances for maintenance and support of family members, education of children, medical treatment, and meeting expenses for overseas tours. This has strengthened family ties and contributed to the well-being of Indian residents and their loved ones.<\/p>\n<h4><strong>Charting the Future<\/strong><\/h4>\n<p>As the Indian economy continues to integrate with global markets, the Liberalised Remittance Scheme remains a cornerstone of this integration process. Its flexibility, coupled with defined limits, ensures that while individuals are empowered to explore global opportunities, there are checks in place to maintain stability and uphold the integrity of the financial system.<\/p>\n<p>In conclusion, the Liberalised Remittance Scheme stands as a bridge connecting individuals, families, and businesses to the world. It embodies the spirit of financial exploration, international collaboration, and personal growth while adhering to the regulatory framework that safeguards the nation&#8217;s economic interests. As India&#8217;s role in the global landscape evolves, the LRS will likely continue to evolve as well, adapting to changing circumstances and contributing to the country&#8217;s journey towards greater prosperity.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>A Brief Introduction to Liberalised Remittance Scheme The Reserve Bank of India (RBI) introduced the Liberalised Remittance Scheme (LRS) in 2004 so that Indian residents could transfer funds abroad for specific purposes. This scheme has played a crucial role in promoting international trade and investment, as well as in facilitating capital flows into and out [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2157,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,457],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Liberalised Remittance Scheme (LRS)<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Liberalised Remittance Scheme (LRS)\" \/>\n<meta property=\"og:description\" content=\"A Brief Introduction to Liberalised Remittance Scheme The Reserve Bank of India (RBI) introduced the Liberalised Remittance Scheme (LRS) in 2004 so that Indian residents could transfer funds abroad for specific purposes. This scheme has played a crucial role in promoting international trade and investment, as well as in facilitating capital flows into and out [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-19T13:08:38+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130628\/Liberalised-Remittance-Scheme-LRS-.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Liberalised Remittance Scheme (LRS)\",\"datePublished\":\"2023-08-19T13:08:38+00:00\",\"dateModified\":\"2023-08-19T13:08:38+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\"},\"wordCount\":2027,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Government Schemes\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\",\"url\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\",\"name\":\"Liberalised Remittance Scheme (LRS)\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-08-19T13:08:38+00:00\",\"dateModified\":\"2023-08-19T13:08:38+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Liberalised Remittance Scheme (LRS)\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Liberalised Remittance Scheme (LRS)","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/","og_locale":"en_US","og_type":"article","og_title":"Liberalised Remittance Scheme (LRS)","og_description":"A Brief Introduction to Liberalised Remittance Scheme The Reserve Bank of India (RBI) introduced the Liberalised Remittance Scheme (LRS) in 2004 so that Indian residents could transfer funds abroad for specific purposes. This scheme has played a crucial role in promoting international trade and investment, as well as in facilitating capital flows into and out [&hellip;]","og_url":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-08-19T13:08:38+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/19130628\/Liberalised-Remittance-Scheme-LRS-.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Liberalised Remittance Scheme (LRS)","datePublished":"2023-08-19T13:08:38+00:00","dateModified":"2023-08-19T13:08:38+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/"},"wordCount":2027,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Government Schemes"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/","url":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/","name":"Liberalised Remittance Scheme (LRS)","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-08-19T13:08:38+00:00","dateModified":"2023-08-19T13:08:38+00:00","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/liberalised-remittance-scheme-lrs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Liberalised Remittance Scheme (LRS)"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2156"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2156"}],"version-history":[{"count":0,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2156\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2157"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2156"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2156"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2156"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}