{"id":2543,"date":"2023-10-17T11:39:03","date_gmt":"2023-10-17T11:39:03","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2543"},"modified":"2023-10-17T11:40:44","modified_gmt":"2023-10-17T11:40:44","slug":"gumasta-license-your-ticket-to-operating-a-legal-business","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/","title":{"rendered":"Gumasta License: Your Ticket to Operating a Legal Business"},"content":{"rendered":"<h2>Introduction<\/h2>\n<p>The Gumasta License is a registration for conducting business in Maharashtra that is managed by the Municipal Corporation of Mumbai. The Maharashtra Shops and Establishment Act gives you permission to do so at a certain site. All registrations required by this law must be made through the Labour Department. No matter if a business is run by a single person or a large organization, it is a basic requirement for any business to be recognized by the government or bank. Without a Gumasta Licence, it is impossible to obtain a GST registration in Maharashtra.<\/p>\n<p>To register under this legislation, nevertheless, you must do so within 30 days of opening your firm. This Gumasta Certificate has a 5-year expiration date. However, it needs to be renewed once five years have passed.<\/p>\n<p>In India, specific licenses and certificates are necessary to operate any type of business. These documents serve as legitimate evidence that you successfully completed all steps in accordance with federal and state legal standards. Additionally, the licensing procedure is required to make sure that companies comply with legislation. An entrepreneur is obliged to abide by the Shop and Establishment Act by applying for a license in addition to typically necessary documents like a certificate of incorporation.<\/p>\n<p>In terms of the Shops and Establishment Act, each state has its own set of laws. A Gumasta Licence in Maharashtra is required for business operations in the state. The Shops and Establishments Act, which the Mumbai Municipal Corporation administers, governs the Gumasta License.<\/p>\n<h2>Various Gumasta Licence Types:<\/h2>\n<ul>\n<li>Retail or wholesale establishments.<\/li>\n<li>Godowns, warehouses, and storerooms.<\/li>\n<li>Any additional workplace.<\/li>\n<li>Hotels with residences.<\/li>\n<li>Eateries or restaurants.<\/li>\n<li>Any public entertainment venue, theatre, or amusement park.<\/li>\n<\/ul>\n<h2>Characteristics of Gumasta License<\/h2>\n<p>The following business operations require regulation under the Shop Act:<\/p>\n<ul>\n<li>Business hours of operation.<\/li>\n<li>Expiration dates.<\/li>\n<li>Working Hours.<\/li>\n<li>Weekly employee vacation and leave policies.<\/li>\n<li>Paying for holidays with pay.<\/li>\n<li>The cleanliness of the business location and other elements, such as ventilation, etc.<\/li>\n<li>Rest periods and mealtimes.<\/li>\n<li>Safety precautions and backup plans in case of incidents.<\/li>\n<li>The upkeep of records.<\/li>\n<li>A procedure for firing employees.<\/li>\n<li>The timing of wage payments as well as other terms.<\/li>\n<li>Prohibitions on hiring children.<\/li>\n<\/ul>\n<p><a href=\"https:\/\/legal251.com\/\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2545 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113439\/Gumasta-300x212.png\" alt=\"Gumasta License\" width=\"818\" height=\"578\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113439\/Gumasta-300x212.png 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113439\/Gumasta-1024x722.png 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113439\/Gumasta-1536x1083.png 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113439\/Gumasta-2048x1444.png 2048w\" sizes=\"(max-width: 818px) 100vw, 818px\" \/><\/a><\/p>\n<h2>Documents needed to obtain a Gumasta licence<\/h2>\n<ul>\n<li>Name of the store or business.<\/li>\n<li>The business&#8217;s full address.<\/li>\n<li>The employer&#8217;s name.<\/li>\n<li>Mention the type of business, such as a bakery, boutique, etc.<\/li>\n<li>Mention the company&#8217;s location.<\/li>\n<li>Any identification showing who the tenant or employer is, such as a passport, voter ID, or Aadhar card.<\/li>\n<li>a copy of the occupier&#8217;s or employer&#8217;s PAN card.<\/li>\n<li>Any address Evidence of residence, such as a lease agreement or deed to a rental property.<\/li>\n<li>Mention the establishment&#8217;s category, such as a store, theatre, restaurant, etc.<\/li>\n<\/ul>\n<p><strong>Private Company-<\/strong><\/p>\n<ul>\n<li>Association&#8217;s Memorandum and Articles.<\/li>\n<li>Company incorporation certificate.<\/li>\n<li>Identity and address verification for the company directors.<\/li>\n<\/ul>\n<p><strong>Partnership Firm-<\/strong><\/p>\n<ul>\n<li>Deed of partnership.<\/li>\n<li>PAN card for a partnership firm.<\/li>\n<li>All partners have shown confirmation of identity and residence.<\/li>\n<li>Fees that must be paid by a partnership business.<\/li>\n<\/ul>\n<h2>Gumasta Licence Registration Process<\/h2>\n<ol>\n<li>The applicant can visit the government&#8217;s main website to register for a Gumasta license and submit the Shops and Establishment Section form online.<\/li>\n<li>Make the payment after completing the form and including the required files.<\/li>\n<li>Print out the shop license application and deliver it to the Mumbai Municipal Corporation.<\/li>\n<li>If all the paperwork is approved, the applicant will get a store license in 7 working days.<\/li>\n<li>The concerned officer must also visit the location of the store and establishment.<\/li>\n<li>Following that, you have 30 days to launch your company before submitting an application for a Gumasta license registration.<\/li>\n<\/ol>\n<h2>Benefits of Obtaining a Gumasta Licence<\/h2>\n<ul>\n<li>Once you register for a Gumasta Licence, you can take advantage of all the benefits and tax breaks provided by the Maharashtra State government for this program.<\/li>\n<li>Without it, you are unable to submit an application for a GST registration license because it serves as proof of your legal standing and grants you permission to run a business in the state of Maharashtra.<\/li>\n<li>Every company needs a corporate bank account to receive payments from clients.<\/li>\n<li>With customers, it builds trust.<\/li>\n<\/ul>\n<h2>Tickets to Operating a Legal Business<\/h2>\n<h4><strong>Understand the importance of a Gumasta License:<\/strong><\/h4>\n<p>A Gumasta license, also known as a Shops and Establishments license, is a legal requirement for opening any commercial establishment in India. It ensures that your business operates within the guidelines set by the local municipal corporation.<\/p>\n<h4><strong>Determine if you need a Gumasta License:<\/strong><\/h4>\n<p>Different states in India have different rules regarding when a Gumasta License is required. Generally, if your business involves selling goods or services to the public, you will need to obtain this license.<\/p>\n<h4><strong>Gather necessary documents: <\/strong><\/h4>\n<p>Before applying for a Gumasta License, gather all the required documents such as proof of identity (Aadhaar card, PAN card), proof of address (electricity bill, rent agreement), passport-sized photographs, and any other specific documents requested by your local municipal corporation.<\/p>\n<h4><strong>Visit your local municipal corporation office:<\/strong><\/h4>\n<p>Once you have all the necessary documents ready, visit your local municipal corporation office where they issue Gumasta licenses. Inquire about their specific requirements and procedures for obtaining the license.<\/p>\n<h4><strong>Fill out application forms:<\/strong><\/h4>\n<p>Obtain and fill out the application forms provided by your local municipal corporation office accurately and completely. Make sure to attach all required supporting documents along with it.<\/p>\n<h4><strong>Pay applicable fees: <\/strong><\/h4>\n<p>There may be certain fees associated with obtaining a Gumasta License depending on your location and type of business activity planned. Ensure that you pay these fees at the time of submitting your application.<\/p>\n<h4><strong>Submit application form: <\/strong><\/h4>\n<p>After completing all paperwork and paying any required fees, submit your filled-out application form along with supporting documents to your local municipal corporation office as per their instructions.<\/p>\n<h4><strong>Await verification and processing: <\/strong><\/h4>\n<p>Once you have submitted your application, the local municipal corporation will verify the information provided and process your Gumasta License application. This may take some time, so be patient during this stage.<\/p>\n<h4><strong>Follow up with the municipal corporation: <\/strong><\/h4>\n<p>If there is a delay in receiving your Gumasta License or if you have any queries regarding the status of your application, it is advisable to follow up with the local municipal corporation office for updates.<\/p>\n<h4><strong>Obtain your Gumasta License:<\/strong><\/h4>\n<p>Once your application has been approved and processed successfully, you will receive your Gumasta License. Make sure to collect it from the municipal corporation office as per their instructions.<\/p>\n<h4><strong>Display your license prominently: <\/strong><\/h4>\n<p>It is mandatory to display a copy of your Gumasta License at a visible location in your business establishment as proof that you are operating legally.<\/p>\n<h4><strong>Renewal and compliance:<\/strong><\/h4>\n<p>A Gumasta License typically needs to be renewed periodically, usually annually or biennially depending on state regulations. Ensure that you renew it on time and comply with any additional requirements imposed by the local authorities.<\/p>\n<h4><strong>Update changes in business details: <\/strong><\/h4>\n<p>If there are any changes in business ownership, address, or other relevant details after obtaining a Gumasta License, inform the local municipal corporation promptly to update their records accordingly.<\/p>\n<h4><strong>Stay updated with legal requirements: <\/strong><\/h4>\n<p>As a responsible business owner, it&#8217;s important to stay informed about any changes or amendments to laws related to operating commercial establishments in India. Keep yourself updated with new regulations that may affect your business operations.<\/p>\n<h4><strong>Seek professional assistance if needed:<\/strong><\/h4>\n<p>If you find the process of obtaining a Gumasta License overwhelming or confusing, consider seeking professional assistance from consultants who specialize in helping businesses navigate through licensing procedures efficiently.<\/p>\n<h2>Costs and Penalties<\/h2>\n<p>Heavy fines are imposed on any business owner who fails to submit the required registration paperwork or operates an establishment without a licence. A late fee equal to 50% of the entire renewal amount will be applied if their Gumasta Licence has expired and the establishment owner hasn&#8217;t renewed it.<\/p>\n<p>Therefore, it is advisable to apply for the Gumasta Licence while opening a business in the state of Maharashtra if you do not want your store or establishment to encounter any sort of legal issues. Don&#8217;t forget to show the Gumasta Licence at your store or place of business as well.<\/p>\n<h2>Obtaining an Indian Gumasta Licence<\/h2>\n<ul>\n<li>The Gumasta license is a compulsory license that is required for all commercial establishments in Maharashtra.<\/li>\n<li>The Gumasta license is valid for a period of two years and can be renewed. The fee for the license is generally ₹ 2,000. Commercial establishments that operate without a Gumasta license can face fines of ₹ 10,000 per day.<\/li>\n<li>Before submitting an application for a Gumasta license, you must, among other things, satisfy the following conditions:<\/li>\n<\/ul>\n<ul class=\"tox-checklist\">\n<li class=\"tox-checklist--checked\">The business must generate at least 20 lakh in annual revenue.<\/li>\n<li class=\"tox-checklist--checked\">At least four people must be employed by the business.<\/li>\n<li class=\"tox-checklist--checked\">The place of business must have a floor area of at least 25 square meters.<\/li>\n<li class=\"tox-checklist--checked\">At least three parking spaces must be available at the facility.<\/li>\n<li class=\"tox-checklist--checked\">A fire escape strategy is required for the establishment.<\/li>\n<\/ul>\n<h2>How Useful Is a Gumasta Licence?<\/h2>\n<p>In Maharashtra, gummata licenses are necessary for all commercial establishments. Businesses can operate without worrying about penalties or arrests thanks to a Gumasta license. Additionally, it enables companies to import and export items without paying exorbitant taxes.<\/p>\n<p>Businesses must first submit an online application to obtain a Gumasta license. The company will have to submit an inspection report and pay a charge after the application is finished. Finally, a Gumasta license will be granted to the company.<\/p>\n<h2>Details of the several forms that you must fill out in order to register online<\/h2>\n<ul>\n<li>If it requires a new registration, use Form A.<\/li>\n<li>Form B &#8211; Licence Renewal<\/li>\n<li>Form I is an application that must be filled out whenever there are ten or more employees, and it serves as notice of any changes.<\/li>\n<li>Form F &#8211; This is used when there are fewer than ten employees.<\/li>\n<li>In the event of a business closure, Form J must be properly completed and filed within 10 days after the closure. This is relevant when there are fewer than ten employees.<\/li>\n<li>Form K &#8211; In the event that the business closes. When there are fewer than 10 employees, this applies.<\/li>\n<\/ul>\n<h2>Conclusion<\/h2>\n<p>Every business entity, whether a sole proprietorship or a partnership, must have a Gumasta licence in order to establish a commercial enterprise in Maharashtra. The article&#8217;s details support the need for this authorization, which allows companies to pick their own location. Businesses can benefit from several tax breaks that the Maharashtra government gives once they have this state authorization. If you have all the required paperwork, the process is extremely easy.<\/p>\n<p data-sourcepos=\"3:1-3:283\">A Gumasta license, also known as a Shops and Establishment Act license, is a legal document required for operating any business in India. It is a mandatory requirement under the Shops and Establishment Act of the respective state, and it is issued by the local municipal corporation. A Gumasta license is proof of legal authorization for a business to operate in a particular state. It also ensures that the business is complying with all applicable labor laws and workplace safety standards.<\/p>\n<p data-sourcepos=\"31:1-31:279\">A Gumasta license is an essential document for any business operating in India. It is a legal requirement that ensures that the business is complying with all applicable laws and regulations. Businesses that fail to obtain a Gumasta license may be subject to penalties and fines.<\/p>\n<p data-sourcepos=\"33:1-33:252\">If you are planning to start a business in India, it is important to obtain a Gumasta license as soon as possible. This will ensure that your business is legally authorized to operate and that you are complying with all applicable laws and regulations.<\/p>\n<p data-sourcepos=\"33:1-33:252\">This Blog is written by Suruchi Singh.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction The Gumasta License is a registration for conducting business in Maharashtra that is managed by the Municipal Corporation of Mumbai. The Maharashtra Shops and Establishment Act gives you permission to do so at a certain site. All registrations required by this law must be made through the Labour Department. No matter if a business [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2544,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,458],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Gumasta License: Your Ticket to Operating a Legal Business<\/title>\n<meta name=\"description\" content=\"The Gumasta License is a registration for conducting business, this blog discuss the aspects of the same in detailed\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Gumasta License: Your Ticket to Operating a Legal Business\" \/>\n<meta property=\"og:description\" content=\"The Gumasta License is a registration for conducting business, this blog discuss the aspects of the same in detailed\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-10-17T11:39:03+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-10-17T11:40:44+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113252\/Gumasta-License-Your-Ticket-to-Operating-a-Legal-Business.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"Gumasta License: Your Ticket to Operating a Legal Business\",\"datePublished\":\"2023-10-17T11:39:03+00:00\",\"dateModified\":\"2023-10-17T11:40:44+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\"},\"wordCount\":1939,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"Gumasta License\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\",\"url\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\",\"name\":\"Gumasta License: Your Ticket to Operating a Legal Business\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-10-17T11:39:03+00:00\",\"dateModified\":\"2023-10-17T11:40:44+00:00\",\"description\":\"The Gumasta License is a registration for conducting business, this blog discuss the aspects of the same in detailed\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Gumasta License: Your Ticket to Operating a Legal Business\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Gumasta License: Your Ticket to Operating a Legal Business","description":"The Gumasta License is a registration for conducting business, this blog discuss the aspects of the same in detailed","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/","og_locale":"en_US","og_type":"article","og_title":"Gumasta License: Your Ticket to Operating a Legal Business","og_description":"The Gumasta License is a registration for conducting business, this blog discuss the aspects of the same in detailed","og_url":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-10-17T11:39:03+00:00","article_modified_time":"2023-10-17T11:40:44+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/17113252\/Gumasta-License-Your-Ticket-to-Operating-a-Legal-Business.jpg","type":"image\/jpeg"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"Gumasta License: Your Ticket to Operating a Legal Business","datePublished":"2023-10-17T11:39:03+00:00","dateModified":"2023-10-17T11:40:44+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/"},"wordCount":1939,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","Gumasta License"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/","url":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/","name":"Gumasta License: Your Ticket to Operating a Legal Business","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-10-17T11:39:03+00:00","dateModified":"2023-10-17T11:40:44+00:00","description":"The Gumasta License is a registration for conducting business, this blog discuss the aspects of the same in detailed","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/gumasta-license-your-ticket-to-operating-a-legal-business\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"Gumasta License: Your Ticket to Operating a Legal Business"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2543"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2543"}],"version-history":[{"count":1,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2543\/revisions"}],"predecessor-version":[{"id":2546,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2543\/revisions\/2546"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2544"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2543"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2543"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2543"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}