{"id":2657,"date":"2023-10-25T11:45:48","date_gmt":"2023-10-25T11:45:48","guid":{"rendered":"https:\/\/legal251.com\/resources\/?p=2657"},"modified":"2023-10-25T11:45:48","modified_gmt":"2023-10-25T11:45:48","slug":"msme-registration-eligibility-process-and-benefits","status":"publish","type":"post","link":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/","title":{"rendered":"MSME Registration: Eligibility, Process, and Benefits"},"content":{"rendered":"<div id=\"text-body\">\n<p>MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration since July 2020 that is provided along with a certificate of recognition and a unique number. <a href=\"https:\/\/legal251.com\/msme-udhyam-registration\">MSME<\/a> stands for micro, small, and medium enterprises and helps in certifying these enterprises through this registration process.<\/p>\n<h2><strong>ELIGIBILITY FOR MSME REGISTRATION<\/strong><\/h2>\n<p>Any type of Micro, Small, and Medium enterprises are eligible for MSME Registration and no individual can apply for MSME. MSME, as per the Government of India, refers only to manufacturing and service industries, with trading companies being excluded from the scheme. Manufacturing enterprises are engaged in the production of goods, while service enterprises provide services. Both types of businesses have separate investment and turnover criteria for MSME classification. The MSMED Act 2006 categorizes businesses under Manufacturing or Service Enterprises based on their definition and categorization, as well as the registration policy relevant to Central government and State governments.<\/p>\n<h4><strong>Here are the breakups of investments for registration of MSME<\/strong>:-<\/h4>\n<p>1) For<strong> Micro-Enterprise,<\/strong> the investments in machinery\/ equipment should not exceed Rs. 1 crore, and annual turnover should be below Rs. 5 crores.<\/p>\n<p>2) For <strong>Small- Enterprises<\/strong>, investment in machinery\/equipment should not exceed Rs. 10 crores, and annual turnover should not exceed Rs. 50 crores.<\/p>\n<p>3) For <strong>Medium-enterprises,<\/strong> investment in machinery\/equipment should not exceed Rs. 50 crores and annual turnover should not exceed Rs. 250 crores.<\/p>\n<p>The following are the entities that can apply:-<\/p>\n<p>1) Startups, business owners, and entrepreneurs<\/p>\n<p>2) Private and Public LTD companies.<\/p>\n<p>3) Sole Proprietorship.<\/p>\n<p>4) Partnership firm.<\/p>\n<p>5) Limited Liability Partnerships.<\/p>\n<p>6) Self-help groups.<\/p>\n<p>7) Co-operative societies.<\/p>\n<p>8) Trusts.<\/p>\n<h2><strong>PROCESS OF REGISTRATION<\/strong><\/h2>\n<p data-sourcepos=\"1:1-1:198\">The MSME (Micro, Small, and Medium Enterprise) registration process in India is fully online and paperless and is based on self-declaration. The registration process does not require any cost and can be registered even if not incorporated. The validity of registration is for a lifetime and doesn&#8217;t require renewal.<\/p>\n<p>Registering as a Micro, Small, or Medium Enterprise (MSME) in India involves a straightforward process. MSME registration provides various benefits, including access to credit at lower interest rates, subsidies, and various government schemes. Here&#8217;s a step-by-step guide on how to register your business as an MSME:<\/p>\n<h4>Step 1:<\/h4>\n<p>Visit the Udyam Registration Portal Go to the official Udyam Registration portal, which is managed by the Ministry of Micro, Small, and Medium Enterprises (MSME), Government of India. The URL for the portal is <a href=\"https:\/\/udyamregistration.gov.in\/\" target=\"_new\" rel=\"noopener\">https:\/\/udyamregistration.gov.in<\/a>.<\/p>\n<h4>Step 2:<\/h4>\n<p>Check Eligibility Before proceeding, ensure that your business qualifies as an MSME based on the investment in plant and machinery or equipment and annual turnover. As of my last update in September 2021, the eligibility criteria for MSMEs are as follows:<\/p>\n<h3>a.<strong> Micro Enterprises:<\/strong><\/h3>\n<ul>\n<li>Investment in plant and machinery or equipment should not exceed ₹1 crore.<\/li>\n<li>Annual turnover should not exceed ₹5 crore.<\/li>\n<\/ul>\n<h3>b. <strong>Small Enterprises:<\/strong><\/h3>\n<ul>\n<li>Investment in plant and machinery or equipment should not exceed ₹10 crore.<\/li>\n<li>Annual turnover should not exceed ₹50 crore.<\/li>\n<\/ul>\n<h3>c. <strong>Medium Enterprises:<\/strong><\/h3>\n<ul>\n<li>Investment in plant and machinery or equipment should not exceed ₹50 crore.<\/li>\n<li>Annual turnover should not exceed ₹250 crore.<\/li>\n<\/ul>\n<h4>Step 3:<\/h4>\n<p>Gather Required Information Prepare the following information and documents before starting the registration process:<\/p>\n<ul>\n<li>The Aadhaar Number of the business owner or authorized signatory.<\/li>\n<li>PAN (Permanent Account Number) of the business.<\/li>\n<li>Business name, type, and location.<\/li>\n<li>Contact details.<\/li>\n<li>Bank account details.<\/li>\n<li>NIC code (National Industrial Classification) of your business activity (you can find this code on the Udyam portal).<\/li>\n<\/ul>\n<h4>Step 4:<\/h4>\n<p>Registration Process Follow these steps to complete the registration process:<\/p>\n<p>a. Visit the Udyam Registration Portal: Go to <a href=\"https:\/\/udyamregistration.gov.in\/\" target=\"_new\" rel=\"noopener\">https:\/\/udyamregistration.gov.in<\/a>.<\/p>\n<p>b. Click on the link &#8211; &#8220;For New Entrepreneurs who are not Registered yet as MSME&#8221;.<\/p>\n<p>c. Enter Aadhaar Number: Enter the Aadhaar number of the business owner or authorized signatory.<\/p>\n<p>d. Verification: Click on &#8220;Validate and Generate OTP.&#8221; You will receive an OTP (One-Time Password) on the registered mobile number linked to your Aadhaar. Enter the OTP for verification.<\/p>\n<p>e. Business Details: Provide the necessary business details, including PAN, business name, location, NIC code, and other requested information.<\/p>\n<p>f. Bank Details: Enter your bank account details.<\/p>\n<p>g. Submit Application: Review the information provided and click on the &#8220;Submit&#8221; button.<\/p>\n<h4>Step 5:<\/h4>\n<p>Acknowledgment After successfully submitting the application, you will receive an acknowledgment number. Keep this number for future reference.<\/p>\n<h4>Step 6:<\/h4>\n<p>Certificate Generation Your MSME certificate will be generated instantly, and you can download it from the portal. The certificate will contain your Udyam Registration Number.<\/p>\n<p>To download your MSME certificate Go to the official Udyam Registration portal managed by the Ministry of Micro, Small, and Medium Enterprises (MSME), Government of India. The URL for the portal is <a href=\"https:\/\/udyamregistration.gov.in\/\">https:\/\/udyamregistration.gov.in<\/a>. Log in to your Udyam Registration account using your Udyam Registration Number or the Aadhaar Number associated with the registration. You&#8217;ll need to enter the One-Time Password (OTP) received on your registered mobile number to log in. Access Your Certificate: Once logged in, you will see the dashboard or user panel. Look for an option like &#8220;Print\/Udyam Certificate&#8221; or &#8220;Download Certificate.&#8221; Click on it to access your MSME certificate.<\/p>\n<p>Download and Save: Your MSME certificate will be displayed on the screen. You can either download it directly from the portal by clicking on the download button or print it if needed. It&#8217;s advisable to save the certificate in a secure location on your computer or device for future reference. Make sure to check the details on the certificate to ensure accuracy. If you find any discrepancies, contact the appropriate authorities to rectify them. Print a Hard Copy if required.<\/p>\n<p>That&#8217;s it! You have successfully completed the MSME registration process. You can now enjoy the benefits and support provided to MSMEs by the government.<\/p>\n<h4 data-sourcepos=\"1:1-1:69\"><strong>Below is the list of documents required for MSME registration in India :<\/strong><\/h4>\n<ul data-sourcepos=\"3:1-9:0\">\n<li data-sourcepos=\"3:1-3:68\">Aadhaar card of the proprietor\/partner\/director of the enterprise.<\/li>\n<li data-sourcepos=\"4:1-4:64\">PAN card of the proprietor\/partner\/director of the enterprise.<\/li>\n<li data-sourcepos=\"5:1-5:109\">Proof of address of the business premises. This could be a rent agreement, electricity bill, or water bill.<\/li>\n<li data-sourcepos=\"6:1-6:79\">If the enterprise is registered under GST, then the GSTIN number is required.<\/li>\n<li data-sourcepos=\"7:1-7:81\">If the enterprise is a partnership firm, then the partnership deed is required.<\/li>\n<li data-sourcepos=\"8:1-9:0\">If the enterprise is a private limited company, then the certificate of incorporation is required.<\/li>\n<\/ul>\n<h2 data-sourcepos=\"13:1-13:69\"><strong>BENEFITS<\/strong> <strong>OF MSME REGISTRATION:<\/strong><\/h2>\n<p data-sourcepos=\"13:1-13:69\">Registering as an MSME can foster growth by unlocking a range of advantages. These include easier access to credit, favorable loan terms, and participation in government schemes and subsidies. MSME status also enhances credibility, attracting investors and partners. Reduced compliance burdens and tax incentives further stimulate expansion. Moreover, networking opportunities within the MSME community and access to specialized support services boost competitiveness. In summary, MSME registration provides a conducive ecosystem for enterprises to thrive, encouraging innovation, job creation, and sustainable growth.<\/p>\n<h3 data-sourcepos=\"13:1-13:69\"><strong>ADDITIONAL BENEFITS ARE AS FOLLOWS:<\/strong><\/h3>\n<h4>1) <strong>Collateral-free bank loans<\/strong>:<\/h4>\n<p>MSMEs registered with the government are eligible for collateral-free bank loans. This means that they can get loans without having to pledge any assets as security and also MSMEs may be eligible for priority sector lending at lower interest rates from banks. Access to affordable credit can indirectly help businesses manage their operational costs, including electricity expenses.<\/p>\n<h4><strong>2) Subsidy on patent registration:<\/strong><\/h4>\n<p>MSMEs registered with the government are eligible for a subsidy on patent registration fees. This can help MSMEs to protect their intellectual property.<\/p>\n<h4><strong>3) Overdraft interest rate exemption:<\/strong><\/h4>\n<p>MSMEs registered with the government are exempt from overdraft interest rates. This can save MSMEs money on their borrowing costs.<\/p>\n<h4><strong>4) Industrial promotion subsidy:<\/strong><\/h4>\n<p>MSMEs registered with the government are eligible for industrial promotion subsidies. These subsidies can be used to set up or expand businesses.<\/p>\n<h4><strong>5) Protection against delayed payments:<\/strong><\/h4>\n<p>MSMEs registered with the government are protected against delayed payments from buyers. This means that they can get compensation if buyers do not pay their bills on time.<\/p>\n<h4><strong>6) Fewer electricity bills:<\/strong><\/h4>\n<p>MSMEs registered with the government often pay lower electricity bills. This is because they are given a discount on their electricity bills.<\/p>\n<h4><strong>7) ISO certification charges reimbursement:<\/strong><\/h4>\n<p>MSMEs registered with the government are eligible for reimbursement of ISO certification charges. This can help MSMEs to improve their quality standards.<\/p>\n<h3 data-sourcepos=\"1:1-1:113\"><strong>There are a number of tax benefits available to MSME-registered firms which are:<\/strong><\/h3>\n<ul data-sourcepos=\"3:1-8:0\">\n<li data-sourcepos=\"3:1-3:163\"><strong>Concessional tax rate:<\/strong> MSME registered with the government are eligible for a concessional tax rate of 25%. This is lower than the standard tax rate of 30%.<\/li>\n<li data-sourcepos=\"4:1-4:179\"><strong>Deduction for depreciation:<\/strong> MSME registered with the government are eligible for a deduction for depreciation on their assets. This can help to reduce their taxable income.<\/li>\n<li data-sourcepos=\"5:1-5:283\"><strong>Deduction for training expenses:<\/strong> MSME registered with the government are eligible for a deduction for training expenses incurred by their employees. This can help to improve the skills and knowledge of their employees, which can help them to grow and expand their businesses.<\/li>\n<li data-sourcepos=\"6:1-6:238\"><strong>Deduction for research and development expenses:<\/strong> MSME registered with the government are eligible for a deduction for research and development expenses incurred. This can help them to innovate and develop new products and services.<\/li>\n<li data-sourcepos=\"7:1-8:0\"><strong>Tax holiday:<\/strong> MSME registered with the government may be eligible for a tax holiday for a certain number of years. This means that they will not have to pay any taxes during this period.<\/li>\n<li data-sourcepos=\"7:1-8:0\"><strong>GST Benefits<\/strong>: The introduction of the Goods and Services Tax (GST) has streamlined the taxation system in India. MSME may benefit from reduced GST rates on certain goods and services, indirectly impacting their operational costs, including electricity expenses.<\/li>\n<\/ul>\n<h2><strong>In conclusion<\/strong><\/h2>\n<p>MSME Registration, also known as Udyam Registration, has emerged as a transformative tool for micro, small, and medium enterprises in India. It streamlines the registration process, making it accessible to a wide range of business entities, from startups to cooperatives. Eligible businesses enjoy a plethora of benefits, including easier access to credit, reduced compliance burdens, and tax incentives, fostering growth and innovation. Furthermore, protection against delayed payments, subsidies, and reimbursement for various expenses provide crucial support for MSMEs. The government&#8217;s focus on promoting these enterprises is instrumental in driving economic development, job creation, and sustainability. Embracing MSME Registration is not only a recognition of business legitimacy but also a pathway to a brighter and more prosperous future for enterprises across the country.<\/p>\n<h2><strong>FAQs<\/strong><\/h2>\n<p><a href=\"https:\/\/legal251.com\/legal251app\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-2130 aligncenter\" src=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg\" alt=\"FAQs\" width=\"884\" height=\"498\" srcset=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-300x169.jpg 300w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1024x576.jpg 1024w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-768x432.jpg 768w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs-1536x864.jpg 1536w, https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/08\/18105718\/FAQs.jpg 1920w\" sizes=\"(max-width: 884px) 100vw, 884px\" \/><\/a><\/p>\n<h4><strong>1. Is MSME Registration mandatory?<\/strong><\/h4>\n<p><strong>ANS: <\/strong>MSME Registration is optional, but it is advisable because it provides access to various benefits and opportunities for MSMEs.<\/p>\n<h4><strong>2. <\/strong><strong>Can an MSME upgrade or downgrade its registration category?<\/strong><\/h4>\n<p><strong>ANS: <\/strong>Yes, MSME can upgrade or downgrade their registration category based on their growth and investments. They need to inform the appropriate authorities for the necessary changes.<\/p>\n<h4><strong>3. <\/strong><strong>Is there any support available for MSMEs in case of delayed payments by buyers?<\/strong><\/h4>\n<p><strong>ANS<\/strong>: Yes, MSME are protected against delayed payments under the MSMED Act. They can seek compensation if buyers do not pay within the stipulated time.<\/p>\n<h4><strong>4<\/strong>. <strong>Can a trading company apply for MSME Registration?<\/strong><\/h4>\n<p><strong>ANS<\/strong>: No, as of the last update in September 2021, trading companies are typically excluded from MSME Registration. MSME status is primarily for manufacturing and service enterprises.<\/p>\n<h4><strong>5. <\/strong><strong>How can I check the authenticity of an MSME certificate?<\/strong><\/h4>\n<p><strong>ANS<\/strong>: You can verify the authenticity of an MSME certificate by checking it on the Udyam Registration portal or contacting the appropriate government authorities.<\/p>\n<h4><strong>6. Can a business registered as an MSME avail of benefits from both the central and state governments?<\/strong><\/h4>\n<p><strong>ANS:<\/strong> Yes, businesses registered as MSMEs can typically avail of benefits from both the central and state governments. Different schemes and incentives may be available at both levels.<\/p>\n<h4><strong>7. Is there any difference between MSME and Udyog Aadhaar Registration?<\/strong><\/h4>\n<p><strong>ANS<\/strong>: Yes, Udyog Aadhaar Registration was the previous system, and MSME Registration (Udyam Registration) is the updated version introduced in July 2020. Both serve the same purpose but have different registration processes and formats.<\/p>\n<h4><strong>8. Are there any specific benefits for MSMEs in terms of export promotion?<\/strong><\/h4>\n<p><strong>ANS:<\/strong> Yes, MSMEs may receive support for export promotion through various government schemes, including financial assistance and incentives to explore international markets.<\/p>\n<h4><strong>9. Can an MSME apply for a patent subsidy after registration?<\/strong><\/h4>\n<p><strong>ANS:<\/strong> Yes, MSMEs can apply for a subsidy on patent registration fees to protect their intellectual property. This is one of the benefits available to them.<\/p>\n<h4><strong>10. Is it necessary to have a physical office or commercial space for MSME Registration?<\/strong><\/h4>\n<p><strong>ANS:<\/strong> No, having a physical office or commercial space is not a mandatory requirement for MSME Registration. The registration is based on self-declaration.<\/p>\n<h4><strong>11. How long does it take to receive the MSME certificate after registration?<\/strong><\/h4>\n<p><strong>ANS:<\/strong> The MSME certificate is typically generated instantly upon successful registration on the Udyam portal. You can download it immediately.<\/p>\n<h4><strong>12. What happens if an MSME exceeds the investment or turnover limits for its registered category?<\/strong><\/h4>\n<p><strong>ANS:<\/strong> If an MSME exceeds the investment or turnover limits for its registered category (micro, small, or medium), it may need to reclassify and update its registration accordingly.<\/p>\n<p>This <a href=\"https:\/\/legal251.com\/\">Blog<\/a> is written by Sovik Sen.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration since July 2020 that is provided along with a certificate of recognition and a unique number. MSME stands for micro, small, and medium enterprises and helps in certifying these enterprises through this registration process. ELIGIBILITY FOR MSME REGISTRATION Any [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":2658,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,224],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>MSME Registration: Eligibility, Process, and Benefits<\/title>\n<meta name=\"description\" content=\"MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"MSME Registration: Eligibility, Process, and Benefits\" \/>\n<meta property=\"og:description\" content=\"MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration\" \/>\n<meta property=\"og:url\" content=\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\" \/>\n<meta property=\"og:site_name\" content=\"Legal251 - Your Legal Consultant\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/legal251\" \/>\n<meta property=\"article:published_time\" content=\"2023-10-25T11:45:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/25114424\/MSME-Registration-Eligibility-Process-and-Benefits.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Purvi Pareek\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@legal251\" \/>\n<meta name=\"twitter:site\" content=\"@legal251\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Purvi Pareek\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\"},\"author\":{\"name\":\"Purvi Pareek\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\"},\"headline\":\"MSME Registration: Eligibility, Process, and Benefits\",\"datePublished\":\"2023-10-25T11:45:48+00:00\",\"dateModified\":\"2023-10-25T11:45:48+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\"},\"wordCount\":2122,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"articleSection\":[\"Blogs\",\"MSME Registration\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\",\"url\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\",\"name\":\"MSME Registration: Eligibility, Process, and Benefits\",\"isPartOf\":{\"@id\":\"https:\/\/legal251.com\/resources\/#website\"},\"datePublished\":\"2023-10-25T11:45:48+00:00\",\"dateModified\":\"2023-10-25T11:45:48+00:00\",\"description\":\"MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration\",\"breadcrumb\":{\"@id\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/legal251.com\/resources\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"MSME Registration: Eligibility, Process, and Benefits\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/legal251.com\/resources\/#website\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"name\":\"Legal251 - Your Legal Consultant\",\"description\":\"Legal Updates, Guides &amp; Resources\",\"publisher\":{\"@id\":\"https:\/\/legal251.com\/resources\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/legal251.com\/resources\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/legal251.com\/resources\/#organization\",\"name\":\"Legal251 - Your Legal Consultant\",\"url\":\"https:\/\/legal251.com\/resources\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"contentUrl\":\"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg\",\"width\":2560,\"height\":640,\"caption\":\"Legal251 - Your Legal Consultant\"},\"image\":{\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/legal251\",\"https:\/\/twitter.com\/legal251\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3\",\"name\":\"Purvi Pareek\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g\",\"caption\":\"Purvi Pareek\"},\"url\":\"https:\/\/legal251.com\/resources\/author\/purvi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"MSME Registration: Eligibility, Process, and Benefits","description":"MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/","og_locale":"en_US","og_type":"article","og_title":"MSME Registration: Eligibility, Process, and Benefits","og_description":"MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration","og_url":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/","og_site_name":"Legal251 - Your Legal Consultant","article_publisher":"https:\/\/www.facebook.com\/legal251","article_published_time":"2023-10-25T11:45:48+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/10\/25114424\/MSME-Registration-Eligibility-Process-and-Benefits.png","type":"image\/png"}],"author":"Purvi Pareek","twitter_card":"summary_large_image","twitter_creator":"@legal251","twitter_site":"@legal251","twitter_misc":{"Written by":"Purvi Pareek","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#article","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/"},"author":{"name":"Purvi Pareek","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3"},"headline":"MSME Registration: Eligibility, Process, and Benefits","datePublished":"2023-10-25T11:45:48+00:00","dateModified":"2023-10-25T11:45:48+00:00","mainEntityOfPage":{"@id":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/"},"wordCount":2122,"commentCount":0,"publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"articleSection":["Blogs","MSME Registration"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/","url":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/","name":"MSME Registration: Eligibility, Process, and Benefits","isPartOf":{"@id":"https:\/\/legal251.com\/resources\/#website"},"datePublished":"2023-10-25T11:45:48+00:00","dateModified":"2023-10-25T11:45:48+00:00","description":"MSME Registration also known as Udayam Registration is a transformed government registration of Udyog Adhaar Registration","breadcrumb":{"@id":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/legal251.com\/resources\/msme-registration-eligibility-process-and-benefits\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/legal251.com\/resources\/"},{"@type":"ListItem","position":2,"name":"MSME Registration: Eligibility, Process, and Benefits"}]},{"@type":"WebSite","@id":"https:\/\/legal251.com\/resources\/#website","url":"https:\/\/legal251.com\/resources\/","name":"Legal251 - Your Legal Consultant","description":"Legal Updates, Guides &amp; Resources","publisher":{"@id":"https:\/\/legal251.com\/resources\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/legal251.com\/resources\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/legal251.com\/resources\/#organization","name":"Legal251 - Your Legal Consultant","url":"https:\/\/legal251.com\/resources\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/","url":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","contentUrl":"https:\/\/legal251resources.s3.ap-south-1.amazonaws.com\/resources\/wp-content\/uploads\/2023\/07\/21144306\/legal251-logo-scaled.jpeg","width":2560,"height":640,"caption":"Legal251 - Your Legal Consultant"},"image":{"@id":"https:\/\/legal251.com\/resources\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/legal251","https:\/\/twitter.com\/legal251"]},{"@type":"Person","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/955b280c89c032987073cb5e395aa5f3","name":"Purvi Pareek","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/legal251.com\/resources\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8a50a885040ace9508b9d61adfa12d87?s=96&d=mm&r=g","caption":"Purvi Pareek"},"url":"https:\/\/legal251.com\/resources\/author\/purvi\/"}]}},"_links":{"self":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2657"}],"collection":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/comments?post=2657"}],"version-history":[{"count":1,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2657\/revisions"}],"predecessor-version":[{"id":2659,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/posts\/2657\/revisions\/2659"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media\/2658"}],"wp:attachment":[{"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/media?parent=2657"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/categories?post=2657"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/legal251.com\/resources\/wp-json\/wp\/v2\/tags?post=2657"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}